zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
/*
** ###################################################################
**     Processors:          MCXW70ACMFT
**                          MCXW70ACMMP
**                          MCXW70ADMFT
**                          MCXW70ADMMP
**
**     Version:             rev. 1.0, 2026-01-09
**     Build:               b260813
**
**     Abstract:
**         CMSIS Peripheral Access Layer for ZLL
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2026-01-09)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file PERI_ZLL.h
 * @version 1.0
 * @date 2026-01-09
 * @brief CMSIS Peripheral Access Layer for ZLL
 *
 * CMSIS Peripheral Access Layer for ZLL
 */

#if !defined(PERI_ZLL_H_)
#define PERI_ZLL_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXW70ACMFT) || defined(CPU_MCXW70ACMMP))
#include "MCXW70AC_COMMON.h"
#elif (defined(CPU_MCXW70ADMFT) || defined(CPU_MCXW70ADMMP))
#include "MCXW70AD_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- ZLL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ZLL_Peripheral_Access_Layer ZLL Peripheral Access Layer
 * @{
 */

/** ZLL - Register Layout Typedef */
typedef struct {
  __IO uint32_t IRQSTS;                            /**< INTERRUPT REQUEST STATUS (IRQSTS). The IRQSTS register indicates the status of interrupt requests in the802.15.4 module., offset: 0x0 */
  __IO uint32_t PHY_CTRL;                          /**< PHY CONTROL (PHY_CTRL)PHY Control Register, offset: 0x4 */
  __I  uint32_t EVENT_TMR;                         /**< EVENT TIMER (EVENT_TMR), offset: 0x8 */
  __I  uint32_t TIMESTAMP;                         /**< TIMESTAMP (TIMESTAMP), offset: 0xC */
  __IO uint32_t T1CMP;                             /**< T1 COMPARE (T1CMP)TMR1 Compare Value, offset: 0x10 */
  __IO uint32_t T2CMP;                             /**< T2 COMPARE (T2CMP)TMR2 Compare Value, offset: 0x14 */
  __IO uint32_t T2PRIMECMP;                        /**< T2 PRIME COMPARE (T2PRIMECMP)TMR2 Prime Compare Value, offset: 0x18 */
  __IO uint32_t T3CMP;                             /**< T3 COMPARE (T3CMP)TMR3 Compare Value, offset: 0x1C */
  __IO uint32_t T4CMP;                             /**< T4 COMPARE (T4CMP)TMR4 Compare Value, offset: 0x20 */
  __IO uint32_t PA_PWR;                            /**< PA POWER (PA_PWR), offset: 0x24 */
  __IO uint32_t CHANNEL_NUM0;                      /**< CHANNEL NUMBER 0 (CHANNEL_NUM0)Channel Number for PAN0, offset: 0x28 */
  __I  uint32_t LQI_AND_RSSI;                      /**< LQI AND RSSI (LQI_AND_RSSI), offset: 0x2C */
  __IO uint32_t MACSHORTADDRS0;                    /**< MAC SHORT ADDRESS 0 (MACSHORTADDRS0)MAC SHORT ADDRESS for PAN0, offset: 0x30 */
  __IO uint32_t MACLONGADDRS0_LSB;                 /**< MAC LONG ADDRESS 0 LSB (MACLONGADDRS0_LSB)MAC LONG ADDRESS for PAN0 LSB, offset: 0x34 */
  __IO uint32_t MACLONGADDRS0_MSB;                 /**< MAC LONG ADDRESS 0 MSB (MACLONGADDRS0_MSB)MAC LONG ADDRESS for PAN0 MSB, offset: 0x38 */
  __IO uint32_t RX_FRAME_FILTER;                   /**< RECEIVE FRAME FILTER (RX_FRAME_FILTER)RECEIVE FRAME FILTER, offset: 0x3C */
  __IO uint32_t CCA_LQI_CTRL;                      /**< CCA AND LQI CONTROL (CCA_LQI_CTRL), offset: 0x40 */
  __IO uint32_t CCA2_CTRL;                         /**< CCA2 CONTROL (CCA2_CTRL)CCA Mode 2 Control in Link Layer. This register provides control for CCA Mode 2 Correlation Threshold and Correlation Peaks related settings, offset: 0x44 */
       uint8_t RESERVED_0[4];
  __IO uint32_t DSM_CTRL;                          /**< DSM CONTROL (DSM_CTRL), offset: 0x4C */
  __I  uint32_t BSM_CTRL;                          /**< BSM CONTROL (BSM_CTRL), offset: 0x50 */
  __IO uint32_t MACSHORTADDRS1;                    /**< MAC SHORT ADDRESS FOR PAN1 (MACSHORTADDRS1)The MACSHORTADDRS1 register ., offset: 0x54 */
  __IO uint32_t MACLONGADDRS1_LSB;                 /**< MAC LONG ADDRESS 1 LSB (MACLONGADDRS1_LSB)MAC Long Address for PAN1, offset: 0x58 */
  __IO uint32_t MACLONGADDRS1_MSB;                 /**< MAC LONG ADDRESS 1 MSB (MACLONGADDRS1_MSB)MAC Long Address for PAN1, offset: 0x5C */
  __IO uint32_t DUAL_PAN_CTRL;                     /**< DUAL PAN CONTROL (DUAL_PAN_CTRL)Dual PAN Control Register, offset: 0x60 */
  __IO uint32_t CHANNEL_NUM1;                      /**< CHANNEL NUMBER 1 (CHANNEL_NUM1), offset: 0x64 */
  __IO uint32_t SAM_CTRL;                          /**< SAM CONTROL (SAM_CTRL)Source Address Management Control Register, offset: 0x68 */
  __IO uint32_t SAM_TABLE;                         /**< SOURCE ADDRESS MANAGEMENT TABLE (SAM_TABLE)Source Address Management Table, offset: 0x6C */
  __I  uint32_t SAM_MATCH;                         /**< SOURCE ADDRESS MANAGEMENT MATCH (SAM_MATCH), offset: 0x70 */
  __I  uint32_t SAM_FREE_IDX;                      /**< SAM FREE INDEX (SAM_FREE_IDX), offset: 0x74 */
  __IO uint32_t SEQ_CTRL_STS;                      /**< SEQUENCE CONTROL AND STATUS (SEQ_CTRL_STS), offset: 0x78 */
  __IO uint32_t ACKDELAY;                          /**< ACK DELAY (ACKDELAY)Provides a fine-tune adjustment of the time delay between Rx warmdownand the beginning of Tx warmup for an autoTxAck packet., offset: 0x7C */
  __IO uint32_t FILTERFAIL_CODE;                   /**< FILTER FAIL CODE (FILTERFAIL_CODE), offset: 0x80 */
  __IO uint32_t RX_WTR_MARK;                       /**< RECEIVE WATER MARK (RX_WTR_MARK), offset: 0x84 */
  __IO uint32_t RESET_CTRL;                        /**< offset: 0x88 */
  __IO uint32_t SLOT_PRELOAD;                      /**< SLOT PRELOAD (SLOT_PRELOAD)Slotted Mode Preload, offset: 0x8C */
  __I  uint32_t SEQ_STATE;                         /**< 802.15.4 SEQUENCE STATE (SEQ_STATE)802.15.4 Sequence State Register, offset: 0x90 */
  __IO uint32_t TMR_PRESCALE;                      /**< TIMER PRESCALER (TMR_PRESCALE)Timer Prescaler Control Register, offset: 0x94 */
  __IO uint32_t LENIENCY_LSB;                      /**< LENIENCY LSB (LENIENCY_LSB)Packet Processor Leniency Bits (LSB), offset: 0x98 */
  __IO uint32_t LENIENCY_MSB;                      /**< LENIENCY MSB (LENIENCY_MSB)Packet Processor Leniency Bits (MSB), offset: 0x9C */
  __I  uint32_t PART_ID;                           /**< PART ID (PART_ID), offset: 0xA0 */
  __IO uint32_t COEX_CTRL;                         /**< COEXISTENCE CONTROL (COEX_CTRL)Coexistence Control Registers in Link Layer.This Register provides various control bits for Coexistence funciton. It contains the bits to enable the Coexistence funciton. Also contains Coexistence Timeout Interrupt, Coexistence Timeout Interrupt Mask bit and some other COEX bits, offset: 0xA4 */
  __IO uint32_t COEX_PRIORITY;                     /**< COEXISTENCE PRIORITY (COEX_PRIORITY)Programmable 2-bit priority for each RX or TX state in each ZSM., offset: 0xA8 */
  __IO uint32_t ENHACK_CTRL0;                      /**< ENHACK_CTRL 0 (ENHACK_CTRL0)Control Register 0 for Enhanced Acknowledgment Feature, offset: 0xAC */
  __IO uint32_t CG_OVRD;                           /**< Clock Gating Override Register (CG_OVRD), offset: 0xB0 */
  __IO uint32_t PROG_PKT_FLTR_LO_PATT_A;           /**< offset: 0xB4 */
  __IO uint32_t PROG_PKT_FLTR_UP_PATT_A;           /**< offset: 0xB8 */
  __IO uint32_t PROG_PKT_FLTR_LO_MSK_A;            /**< offset: 0xBC */
  __IO uint32_t PROG_PKT_FLTR_UP_MSK_A;            /**< offset: 0xC0 */
  __IO uint32_t PROG_PKT_FLTR_CTRL_A;              /**< offset: 0xC4 */
  __IO uint32_t PROG_PKT_FLTR_LO_PATT_B;           /**< offset: 0xC8 */
  __IO uint32_t PROG_PKT_FLTR_UP_PATT_B;           /**< offset: 0xCC */
  __IO uint32_t PROG_PKT_FLTR_LO_MSK_B;            /**< offset: 0xD0 */
  __IO uint32_t PROG_PKT_FLTR_UP_MSK_B;            /**< offset: 0xD4 */
  __IO uint32_t PROG_PKT_FLTR_CTRL_B;              /**< offset: 0xD8 */
  __I  uint32_t SAM_ADDR_PRESENT;                  /**< SAM ADDRESS PRESENT (SAM_ADDR_PRESENT), offset: 0xDC */
  __IO uint32_t TIMER_CTRL;                        /**< TIMER CONTROL (TIMER_CTRL), offset: 0xE0 */
  __I  uint32_t UNIV_CNTR_TIMESTAMP;               /**< Universal Counter Timestamp (UNIV_CNTR_TIMESTAMP), offset: 0xE4 */
  __I  uint32_t UNIV_CLK_CNTR;                     /**< Universal Clock Counter Freerunning value (UNIV_CLK_CNTR), offset: 0xE8 */
  __IO uint32_t EVENT_TMR_PRESET;                  /**< EVENT TIMER Preset value (EVENT_TMR_PRESET), offset: 0xEC */
  __IO uint32_t PROG_PKT_FLTR_INTR_MSK_STS;        /**< offset: 0xF0 */
  __I  uint32_t INTR_SUMMARY;                      /**< offset: 0xF4 */
  __I  uint32_t SAM_FREE_IDX_FND;                  /**< SAM FREE INDEX FOUND (SAM_FREE_IDX_FND), offset: 0xF8 */
} ZLL_Type;

/* ----------------------------------------------------------------------------
   -- ZLL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ZLL_Register_Masks ZLL Register Masks
 * @{
 */

/*! @name IRQSTS - INTERRUPT REQUEST STATUS (IRQSTS). The IRQSTS register indicates the status of interrupt requests in the802.15.4 module. */
/*! @{ */

#define ZLL_IRQSTS_SEQIRQ_MASK                   (0x1U)
#define ZLL_IRQSTS_SEQIRQ_SHIFT                  (0U)
/*! SEQIRQ - Sequencer IRQ Sequence-end Interrupt Status bit. A '1' indicates the completion of an
 *    autosequence. This interrupt will assert whenever the Sequence Manager transitions from
 *    non-idle to idle state, for any reason. This is write a '1' to clear bit. 0x0,A Sequencer Interrupt
 *    has not occurred, 0x1,A Sequencer Interrupt has occurred
 */
#define ZLL_IRQSTS_SEQIRQ(x)                     (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_SEQIRQ_SHIFT)) & ZLL_IRQSTS_SEQIRQ_MASK)

#define ZLL_IRQSTS_TXIRQ_MASK                    (0x2U)
#define ZLL_IRQSTS_TXIRQ_SHIFT                   (1U)
/*! TXIRQ - TX IRQ Transmitter Interrupt Status bit. A '1' indicates the completion of a transmit
 *    operation. This is write a '1' to clear bit. 0x0,A TX Interrupt has not occurred, 0x1,A TX
 *    Interrupt has occurred
 */
#define ZLL_IRQSTS_TXIRQ(x)                      (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_TXIRQ_SHIFT)) & ZLL_IRQSTS_TXIRQ_MASK)

#define ZLL_IRQSTS_RXIRQ_MASK                    (0x4U)
#define ZLL_IRQSTS_RXIRQ_SHIFT                   (2U)
/*! RXIRQ - RX IRQ Receiver Interrupt Status bit. A '1' indicates the completion of a receive
 *    operation. This is write a '1' to clear bit. 0x0,A RX Interrupt has not occurred, 0x1,A RX Interrupt
 *    has occurred
 */
#define ZLL_IRQSTS_RXIRQ(x)                      (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_RXIRQ_SHIFT)) & ZLL_IRQSTS_RXIRQ_MASK)

#define ZLL_IRQSTS_CCAIRQ_MASK                   (0x8U)
#define ZLL_IRQSTS_CCAIRQ_SHIFT                  (3U)
/*! CCAIRQ - CCA IRQ Clear Channel Assessment Interrupt Status bit. A '1' indicates completion of
 *    CCA operation. This is write '1' to clear bit. 0x0,A CCA Interrupt has not occurred, 0x1,A CCA
 *    Interrupt has occurred
 */
#define ZLL_IRQSTS_CCAIRQ(x)                     (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_CCAIRQ_SHIFT)) & ZLL_IRQSTS_CCAIRQ_MASK)

