zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_IRQSTS_RXWTRMRKIRQ_MASK              (0x10U)
#define ZLL_IRQSTS_RXWTRMRKIRQ_SHIFT             (4U)
/*! RXWTRMRKIRQ - Receive Watermark IRQ Receiver Byte Count Water Mark Interrupt Status bit. A '1'
 *    indicates that the number of bytes specified in the RX_WTR_MARK register has been reached. This
 *    is write a '1' to clear bit. 0x0,A Receive Watermark Interrupt has not occurred, 0x1,A
 *    Receive Watermark Interrupt has occurred
 */
#define ZLL_IRQSTS_RXWTRMRKIRQ(x)                (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_RXWTRMRKIRQ_SHIFT)) & ZLL_IRQSTS_RXWTRMRKIRQ_MASK)

#define ZLL_IRQSTS_FILTERFAIL_IRQ_MASK           (0x20U)
#define ZLL_IRQSTS_FILTERFAIL_IRQ_SHIFT          (5U)
/*! FILTERFAIL_IRQ - Filter Fail IRQ Receiver Packet Filter Fail Interrupt Status bit. A '1'
 *    indicates that the most-recently received packet has been rejected due to elements within the packet.
 *    This is write a '1' to clear bit. In Dual PAN mode, FILTERFAIL_IRQ applies to either or both
 *    networks, as follows: A: If PAN0 and PAN1 occupy different channels and CURRENT_NETWORK=0,
 *    FILTERFAIL_IRQ applies to PAN0. B: If PAN0 and PAN1 occupy different channels and
 *    CURRENT_NETWORK=1, FILTERFAIL_IRQ applies to PAN1. C: If PAN0 and PAN1 occupy the same channel,
 *    FILTERFAIL_IRQ is the logical 'AND' of the individual PANs' Filter Fail status. 0x0,A Filter Fail Interrupt
 *    has not occurred, 0x1,A Filter Fail Interrupt has occurred
 */
#define ZLL_IRQSTS_FILTERFAIL_IRQ(x)             (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_FILTERFAIL_IRQ_SHIFT)) & ZLL_IRQSTS_FILTERFAIL_IRQ_MASK)

#define ZLL_IRQSTS_PLL_UNLOCK_IRQ_MASK           (0x40U)
#define ZLL_IRQSTS_PLL_UNLOCK_IRQ_SHIFT          (6U)
/*! PLL_UNLOCK_IRQ - PLL Unlock IRQ PLL Un-lock Interrupt Status bit. A '1' indicates an unlock
 *    event has occurred in the PLL. This is write a '1' to clear bit. 0x0,A PLL Unlock Interrupt has
 *    not occurred, 0x1,A PLL Unlock Interrupt has occurred
 */
#define ZLL_IRQSTS_PLL_UNLOCK_IRQ(x)             (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_PLL_UNLOCK_IRQ_SHIFT)) & ZLL_IRQSTS_PLL_UNLOCK_IRQ_MASK)

#define ZLL_IRQSTS_RX_FRM_PEND_MASK              (0x80U)
#define ZLL_IRQSTS_RX_FRM_PEND_SHIFT             (7U)
/*! RX_FRM_PEND - RX Frame Pending Status of the frame pending bit of the frame control field for
 *    the most-recently received packet. Read-only.
 */
#define ZLL_IRQSTS_RX_FRM_PEND(x)                (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_RX_FRM_PEND_SHIFT)) & ZLL_IRQSTS_RX_FRM_PEND_MASK)

#define ZLL_IRQSTS_WAKE_IRQ_MASK                 (0x100U)
#define ZLL_IRQSTS_WAKE_IRQ_SHIFT                (8U)
/*! WAKE_IRQ - WAKE Interrupt Request Wake Interrupt. The RFMC TIMER has matched the WOR WKUP_TIME
 *    register, and DSM has exited. The 802.15.4 EVENT_TMR has resumed counting. 0x0,A Wake Interrupt
 *    has not occurred, 0x1,A Wake Interrupt has occurred
 */
#define ZLL_IRQSTS_WAKE_IRQ(x)                   (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_WAKE_IRQ_SHIFT)) & ZLL_IRQSTS_WAKE_IRQ_MASK)

#define ZLL_IRQSTS_ARB_GRANT_DEASSERTION_IRQ_MASK (0x200U)
#define ZLL_IRQSTS_ARB_GRANT_DEASSERTION_IRQ_SHIFT (9U)
/*! ARB_GRANT_DEASSERTION_IRQ - arb_grant Deassertion IRQ arb_grant(!RF_NOT_ALLOWED) Deassertion
 *    Interrupt Status bit. A '1' indicates an arb_grant deassertion event has occurred. This is write
 *    a '1' to clear bit. 0x0,An arb_grant Deassertion Interrupt has not occurred, 0x1,An arb_grant
 *    Deassertion Interrupt has occurred
 */
#define ZLL_IRQSTS_ARB_GRANT_DEASSERTION_IRQ(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_ARB_GRANT_DEASSERTION_IRQ_SHIFT)) & ZLL_IRQSTS_ARB_GRANT_DEASSERTION_IRQ_MASK)

#define ZLL_IRQSTS_TSM_IRQ_MASK                  (0x400U)
#define ZLL_IRQSTS_TSM_IRQ_SHIFT                 (10U)
/*! TSM_IRQ - TSM IRQ TSM Interrupt Request 0x0,A TSM Interrupt has not occurred, 0x1,A TSM Interrupt has occurred */
#define ZLL_IRQSTS_TSM_IRQ(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_TSM_IRQ_SHIFT)) & ZLL_IRQSTS_TSM_IRQ_MASK)

#define ZLL_IRQSTS_ENH_PKT_STATUS_MASK           (0x800U)
#define ZLL_IRQSTS_ENH_PKT_STATUS_SHIFT          (11U)
/*! ENH_PKT_STATUS - Enhanced Packet Status 0x0,The last packet received was neither 4e- nor
 *    2015-compliant, 0x1,The last packet received was 4e- or 2015-compliant (RX_FRAME_FILTER, register
 *    should be queried for additional status bits)
 */
#define ZLL_IRQSTS_ENH_PKT_STATUS(x)             (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_ENH_PKT_STATUS_SHIFT)) & ZLL_IRQSTS_ENH_PKT_STATUS_MASK)

#define ZLL_IRQSTS_PI_MASK                       (0x1000U)
#define ZLL_IRQSTS_PI_SHIFT                      (12U)
/*! PI - Poll Indication 0x0,the received packet was not a data request, 0x1,the received packet was
 *    a data request, regardless of whether a, Source Address table match occurred, or whether
 *    Source Address Management is enabled or not
 */
#define ZLL_IRQSTS_PI(x)                         (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_PI_SHIFT)) & ZLL_IRQSTS_PI_MASK)

#define ZLL_IRQSTS_SRCADDR_MASK                  (0x2000U)
#define ZLL_IRQSTS_SRCADDR_SHIFT                 (13U)
/*! SRCADDR - Source Address Match Status If Source Address Management is engaged, meaning at least
 *    one of the following bits is set: SAP0_EN SAA0_EN SAP1_EN SAA1_EN Then SRCADDR will be set to
 *    1 if the packet just received is a poll request (PI=1), and at least one of the following
 *    conditions is met: SAP0_EN and SAP0_ADDR_PRESENT SAA0_EN and SAA0_ADDR_ABSENT SAP1_EN and
 *    SAP1_ADDR_PRESENT SAA1_EN and SAA1_ADDR_ABSENT If SRCADDR=1, this indicates to SW that the Packet
 *    Processor has determined that an auto-TxACK frame must be transmitted with the FramePending
 *    subfield of the FrameControlField set to 1. HW will assemble and transmit this Ack packet. If the
 *    above conditions are not met, SRCADDR will be cleared to 0.
 */
#define ZLL_IRQSTS_SRCADDR(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_SRCADDR_SHIFT)) & ZLL_IRQSTS_SRCADDR_MASK)

#define ZLL_IRQSTS_CCA_MASK                      (0x4000U)
#define ZLL_IRQSTS_CCA_SHIFT                     (14U)
/*! CCA - CCA Status Channel IDLE/BUSY indicator. This indicator is valid at CCAIRQ and also at
 *    SEQIRQ. This flag is cleared at next receiver warm up. 0x0,IDLE, 0x1,BUSY
 */
#define ZLL_IRQSTS_CCA(x)                        (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_CCA_SHIFT)) & ZLL_IRQSTS_CCA_MASK)

#define ZLL_IRQSTS_CRCVALID_MASK                 (0x8000U)
#define ZLL_IRQSTS_CRCVALID_SHIFT                (15U)
/*! CRCVALID - CRC Valid Status * Code Redundancy Check Valid: This flag indicates the compare
 *    result between the FCS field, in the most-recently received frame, and the internally calculated
 *    CRC value. This flag is cleared at next receiver warm up. 0x0,Rx FCS != calculated CRC
 *    (incorrect), 0x1,Rx FCS = calculated CRC (correct)
 */
#define ZLL_IRQSTS_CRCVALID(x)                   (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_CRCVALID_SHIFT)) & ZLL_IRQSTS_CRCVALID_MASK)

#define ZLL_IRQSTS_TMR1IRQ_MASK                  (0x10000U)
#define ZLL_IRQSTS_TMR1IRQ_SHIFT                 (16U)
/*! TMR1IRQ - Timer 1 IRQ * Timer Comparator 1 Interrupt Status bit: Indicates T1CMP comparator
 *    value matched event timer counter. This is write '1' to clear bit
 */
#define ZLL_IRQSTS_TMR1IRQ(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_TMR1IRQ_SHIFT)) & ZLL_IRQSTS_TMR1IRQ_MASK)

#define ZLL_IRQSTS_TMR2IRQ_MASK                  (0x20000U)
#define ZLL_IRQSTS_TMR2IRQ_SHIFT                 (17U)
/*! TMR2IRQ - Timer 2 IRQ * Timer Comparator 2 Interrupt Status bit: Indicates comparator value
 *    matched event timer counter. This flag is shared between the T2CMP (24-bit) and T2PRIMECMP
 *    (16-bit) compare registers. This is write '1' to clear bit
 */
#define ZLL_IRQSTS_TMR2IRQ(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_TMR2IRQ_SHIFT)) & ZLL_IRQSTS_TMR2IRQ_MASK)

#define ZLL_IRQSTS_TMR3IRQ_MASK                  (0x40000U)
#define ZLL_IRQSTS_TMR3IRQ_SHIFT                 (18U)
/*! TMR3IRQ - Timer 3 IRQ * Timer Comparator 3 Interrupt Status bit: Indicates T3CMP comparator
 *    value matched event timer counter. This is write '1' to clear bit
 */
#define ZLL_IRQSTS_TMR3IRQ(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_TMR3IRQ_SHIFT)) & ZLL_IRQSTS_TMR3IRQ_MASK)

#define ZLL_IRQSTS_TMR4IRQ_MASK                  (0x80000U)
#define ZLL_IRQSTS_TMR4IRQ_SHIFT                 (19U)
/*! TMR4IRQ - Timer 4 IRQ * Timer Comparator 4 Interrupt Status bit: Indicates T4CMP comparator
 *    value matched event timer counter. This is write '1' to clear bit
 */
#define ZLL_IRQSTS_TMR4IRQ(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_TMR4IRQ_SHIFT)) & ZLL_IRQSTS_TMR4IRQ_MASK)

#define ZLL_IRQSTS_TMR1MSK_MASK                  (0x100000U)
#define ZLL_IRQSTS_TMR1MSK_SHIFT                 (20U)
/*! TMR1MSK - Timer Comparator 1 Interrupt Mask bit 0x0,allows interrupt when comparator matches
 *    event timer count, 0x1,Interrupt generation is disabled, but a TMR1IRQ flag can be set
 */
#define ZLL_IRQSTS_TMR1MSK(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_TMR1MSK_SHIFT)) & ZLL_IRQSTS_TMR1MSK_MASK)

#define ZLL_IRQSTS_TMR2MSK_MASK                  (0x200000U)
#define ZLL_IRQSTS_TMR2MSK_SHIFT                 (21U)
/*! TMR2MSK - Timer Comparator 2 Interrupt Mask bit 0x0,allows interrupt when comparator matches
 *    event timer count, 0x1,Interrupt generation is disabled, but a TMR2IRQ flag can be set
 */
#define ZLL_IRQSTS_TMR2MSK(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_TMR2MSK_SHIFT)) & ZLL_IRQSTS_TMR2MSK_MASK)

