zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_IRQSTS_TMR3MSK_MASK                  (0x400000U)
#define ZLL_IRQSTS_TMR3MSK_SHIFT                 (22U)
/*! TMR3MSK - Timer Comparator 3 Interrupt Mask bit 0x0,allows interrupt when comparator matches
 *    event timer count, 0x1,Interrupt generation is disabled, but a TMR3IRQ flag can be set
 */
#define ZLL_IRQSTS_TMR3MSK(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_TMR3MSK_SHIFT)) & ZLL_IRQSTS_TMR3MSK_MASK)

#define ZLL_IRQSTS_TMR4MSK_MASK                  (0x800000U)
#define ZLL_IRQSTS_TMR4MSK_SHIFT                 (23U)
/*! TMR4MSK - Timer Comparator 4 Interrupt Mask bit 0x0,allows interrupt when comparator matches
 *    event timer count, 0x1,Interrupt generation is disabled, but a TMR4IRQ flag can be set
 */
#define ZLL_IRQSTS_TMR4MSK(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_TMR4MSK_SHIFT)) & ZLL_IRQSTS_TMR4MSK_MASK)

#define ZLL_IRQSTS_RX_FRAME_LENGTH_MASK          (0xFF000000U)
#define ZLL_IRQSTS_RX_FRAME_LENGTH_SHIFT         (24U)
/*! RX_FRAME_LENGTH - Receive Frame Length Contents of the PHR (PHY header), or FrameLength field,
 *    of the most recently received packet. Read-only.
 */
#define ZLL_IRQSTS_RX_FRAME_LENGTH(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_IRQSTS_RX_FRAME_LENGTH_SHIFT)) & ZLL_IRQSTS_RX_FRAME_LENGTH_MASK)
/*! @} */

/*! @name PHY_CTRL - PHY CONTROL (PHY_CTRL)PHY Control Register */
/*! @{ */

#define ZLL_PHY_CTRL_XCVSEQ_MASK                 (0x7U)
#define ZLL_PHY_CTRL_XCVSEQ_SHIFT                (0U)
/*! XCVSEQ - 802.15.4 Transceiver Sequence Selector The Transceiver Sequence Selector register
 *    selects an autosequence for the sequence manager to execute. Sequence initiation can be immediate,
 *    or scheduled (see TMRTRIGEN). A write of XCVSEQ=IDLE will abort any ongoing sequence. A write
 *    of XCVSEQ=IDLE must always be performed after a sequence is complete, and before a new
 *    sequence is programmed. Any write to XCVSEQ other than XCVSEQ=IDLE during an ongoing sequence, shall
 *    be ignored. The mapping of XCVSEQ to sequence types is as follows: 0x0,I (IDLE), 0x1,R
 *    (RECEIVE), 0x2,T (TRANSMIT), 0x3,C (CCA), 0x4,TR (TRANSMIT/RECEIVE), 0x5,CCCA (CONTINUOUS CCA),
 *    0x6,Reserved, 0x7,Reserved
 */
#define ZLL_PHY_CTRL_XCVSEQ(x)                   (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_XCVSEQ_SHIFT)) & ZLL_PHY_CTRL_XCVSEQ_MASK)

#define ZLL_PHY_CTRL_RXACKRQD_MASK               (0x10U)
#define ZLL_PHY_CTRL_RXACKRQD_SHIFT              (4U)
/*! RXACKRQD - Receive Acknowledge Frame required Applies only to Sequence TR, ignored during all
 *    other sequences. 0x0,An ordinary receive frame (any type of frame) follows the transmit, frame.
 *    0x1,A receive Ack frame is expected to follow the transmit frame, (non-Ack frames are
 *    rejected).
 */
#define ZLL_PHY_CTRL_RXACKRQD(x)                 (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_RXACKRQD_SHIFT)) & ZLL_PHY_CTRL_RXACKRQD_MASK)

#define ZLL_PHY_CTRL_CCABFRTX_MASK               (0x20U)
#define ZLL_PHY_CTRL_CCABFRTX_SHIFT              (5U)
/*! CCABFRTX - CCA Before TX Applies only to Sequences T and TR, ignored during all other sequences.
 *    0x0,no CCA required, transmit operation begins immediately., 0x1,at least one CCA measurement
 *    is required prior to the transmit, operation (see also SLOTTED).
 */
#define ZLL_PHY_CTRL_CCABFRTX(x)                 (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_CCABFRTX_SHIFT)) & ZLL_PHY_CTRL_CCABFRTX_MASK)

#define ZLL_PHY_CTRL_SLOTTED_MASK                (0x40U)
#define ZLL_PHY_CTRL_SLOTTED_SHIFT               (6U)
/*! SLOTTED - Slotted Mode Slotted Mode, for beacon-enabled networks. Applies only to Sequences T,
 *    TR, and R, ignored during all other sequences. Used, in concert with CCABFRTX, to determine how
 *    many CCA measurements are required prior to a transmit operation. Also used during R sequence
 *    to determine whether the ensuing transmit acknowledge frame (if any) needs to be synchronized
 *    to a backoff slot boundary.
 */
#define ZLL_PHY_CTRL_SLOTTED(x)                  (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_SLOTTED_SHIFT)) & ZLL_PHY_CTRL_SLOTTED_MASK)

#define ZLL_PHY_CTRL_TMRTRIGEN_MASK              (0x80U)
#define ZLL_PHY_CTRL_TMRTRIGEN_SHIFT             (7U)
/*! TMRTRIGEN - Timer2 Trigger Enable 0x0,programmed sequence initiates immediately upon write to
 *    XCVSEQ., 0x1,allow timer TC2 (or TC2') to initiate a preprogrammed sequence (see, XCVSEQ
 *    register).
 */
#define ZLL_PHY_CTRL_TMRTRIGEN(x)                (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_TMRTRIGEN_SHIFT)) & ZLL_PHY_CTRL_TMRTRIGEN_MASK)

#define ZLL_PHY_CTRL_SEQMSK_MASK                 (0x100U)
#define ZLL_PHY_CTRL_SEQMSK_SHIFT                (8U)
/*! SEQMSK - Sequencer Interrupt Mask 0x0,allows completion of an autosequence to generate a zigbee
 *    interrupt, 0x1,Completion of an autosequence will set the SEQIRQ status bit, but a, zigbee
 *    interrupt is not generated
 */
#define ZLL_PHY_CTRL_SEQMSK(x)                   (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_SEQMSK_SHIFT)) & ZLL_PHY_CTRL_SEQMSK_MASK)

#define ZLL_PHY_CTRL_TXMSK_MASK                  (0x200U)
#define ZLL_PHY_CTRL_TXMSK_SHIFT                 (9U)
/*! TXMSK - TX Interrupt Mask 0x0,allows completion of a TX operation to generate a zigbee
 *    interrupt, 0x1,Completion of a TX operation will set the TXIRQ status bit, but a, zigbee interrupt is
 *    not generated
 */
#define ZLL_PHY_CTRL_TXMSK(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_TXMSK_SHIFT)) & ZLL_PHY_CTRL_TXMSK_MASK)

#define ZLL_PHY_CTRL_RXMSK_MASK                  (0x400U)
#define ZLL_PHY_CTRL_RXMSK_SHIFT                 (10U)
/*! RXMSK - RX Interrupt Mask 0x0,allows completion of a RX operation to generate a zigbee
 *    interrupt, 0x1,Completion of a RX operation will set the RXIRQ status bit, but a, zigbee interrupt is
 *    not generated
 */
#define ZLL_PHY_CTRL_RXMSK(x)                    (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_RXMSK_SHIFT)) & ZLL_PHY_CTRL_RXMSK_MASK)

#define ZLL_PHY_CTRL_CCAMSK_MASK                 (0x800U)
#define ZLL_PHY_CTRL_CCAMSK_SHIFT                (11U)
/*! CCAMSK - CCA Interrupt Mask CCA Interrupt Mask 0x0,allows completion of a CCA operation to
 *    generate a zigbee interrupt, 0x1,Completion of a CCA operation will set the CCA status bit, but a,
 *    zigbee interrupt is not generated
 */
#define ZLL_PHY_CTRL_CCAMSK(x)                   (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_CCAMSK_SHIFT)) & ZLL_PHY_CTRL_CCAMSK_MASK)

#define ZLL_PHY_CTRL_RX_WMRK_MSK_MASK            (0x1000U)
#define ZLL_PHY_CTRL_RX_WMRK_MSK_SHIFT           (12U)
/*! RX_WMRK_MSK - RX Watermark Interrupt Mask RX Watermark Interrupt Mask 0x0,allows a Received Byte
 *    Count match to the RX_WTR_MARK threshold, register to generate a zigbee interrupt 0x1,A
 *    Received Byte Count match to the RX_WTR_MARK threshold register, will set the RXWTRMRKIRQ status
 *    bit, but a zigbee interrupt is not generated
 */
#define ZLL_PHY_CTRL_RX_WMRK_MSK(x)              (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_RX_WMRK_MSK_SHIFT)) & ZLL_PHY_CTRL_RX_WMRK_MSK_MASK)

#define ZLL_PHY_CTRL_FILTERFAIL_MSK_MASK         (0x2000U)
#define ZLL_PHY_CTRL_FILTERFAIL_MSK_SHIFT        (13U)
/*! FILTERFAIL_MSK - FilterFail Interrupt Mask FilterFail Interrupt Mask 0x0,allows Packet Processor
 *    Filtering Failure to generate a zigbee interrupt, 0x1,A Packet Processor Filtering Failure
 *    will set the FILTERFAIL_IRQ, status bit, but a zigbee interrupt is not generated
 */
#define ZLL_PHY_CTRL_FILTERFAIL_MSK(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_FILTERFAIL_MSK_SHIFT)) & ZLL_PHY_CTRL_FILTERFAIL_MSK_MASK)

