zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_PHY_CTRL_TRCV_MSK_MASK               (0x80000000U)
#define ZLL_PHY_CTRL_TRCV_MSK_SHIFT              (31U)
/*! TRCV_MSK - Transceiver Global Interrupt Mask Transceiver Global Interrupt Mask 0x0,Enable any
 *    unmasked interrupt source to assert zigbee interrupt, 0x1,Mask all interrupt sources from
 *    asserting zigbee interrupt
 */
#define ZLL_PHY_CTRL_TRCV_MSK(x)                 (((uint32_t)(((uint32_t)(x)) << ZLL_PHY_CTRL_TRCV_MSK_SHIFT)) & ZLL_PHY_CTRL_TRCV_MSK_MASK)
/*! @} */

/*! @name EVENT_TMR - EVENT TIMER (EVENT_TMR) */
/*! @{ */

#define ZLL_EVENT_TMR_EVENT_TMR_FRAC_MASK        (0xFU)
#define ZLL_EVENT_TMR_EVENT_TMR_FRAC_SHIFT       (0U)
/*! EVENT_TMR_FRAC - Event Timer Fractional Component The EVENT_TMR represents a 32-bit number with
 *    28 Integer bits and 4 Fractional bits. This field is the fractional component, which appears
 *    to the right of the decimal point. The fractional component can be ignored for most 802.15.4
 *    operations which relate to the Event Timer; it has been provided only to allow for microsecond
 *    accuracy when software updates the Event Timer after a long period of DSM (sleep) mode
 */
#define ZLL_EVENT_TMR_EVENT_TMR_FRAC(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_EVENT_TMR_EVENT_TMR_FRAC_SHIFT)) & ZLL_EVENT_TMR_EVENT_TMR_FRAC_MASK)

#define ZLL_EVENT_TMR_EVENT_TMR_MASK             (0xFFFFFFF0U)
#define ZLL_EVENT_TMR_EVENT_TMR_SHIFT            (4U)
/*! EVENT_TMR - Event Timer Integer Component The EVENT_TMR represents a 32-bit number with 28
 *    Integer bits and 4 Fractional bits. This field is the integer component, which appears to the left
 *    of the decimal point. Most 802.15.4 operations which relate to the Event Timer require only
 *    the integer component.
 */
#define ZLL_EVENT_TMR_EVENT_TMR(x)               (((uint32_t)(((uint32_t)(x)) << ZLL_EVENT_TMR_EVENT_TMR_SHIFT)) & ZLL_EVENT_TMR_EVENT_TMR_MASK)
/*! @} */

/*! @name TIMESTAMP - TIMESTAMP (TIMESTAMP) */
/*! @{ */

#define ZLL_TIMESTAMP_TIMESTAMP_FRAC_MASK        (0xFU)
#define ZLL_TIMESTAMP_TIMESTAMP_FRAC_SHIFT       (0U)
/*! TIMESTAMP_FRAC - Timestamp Fractional Holds the latched value of the fractional portion of the
 *    Event Timer current time corresponding to the beginning of the most recently received packet,
 *    at the point of SFD detection
 */
#define ZLL_TIMESTAMP_TIMESTAMP_FRAC(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_TIMESTAMP_TIMESTAMP_FRAC_SHIFT)) & ZLL_TIMESTAMP_TIMESTAMP_FRAC_MASK)

#define ZLL_TIMESTAMP_TIMESTAMP_MASK             (0xFFFFFFF0U)
#define ZLL_TIMESTAMP_TIMESTAMP_SHIFT            (4U)
/*! TIMESTAMP - Timestamp Holds the latched value of the integer portion of the Event Timer current
 *    time corresponding to the beginning of the most recently received packet, at the point of SFD
 *    detection
 */
#define ZLL_TIMESTAMP_TIMESTAMP(x)               (((uint32_t)(((uint32_t)(x)) << ZLL_TIMESTAMP_TIMESTAMP_SHIFT)) & ZLL_TIMESTAMP_TIMESTAMP_MASK)
/*! @} */

/*! @name T1CMP - T1 COMPARE (T1CMP)TMR1 Compare Value */
/*! @{ */

#define ZLL_T1CMP_T1CMP_MASK                     (0xFFFFFFFU)
#define ZLL_T1CMP_T1CMP_SHIFT                    (0U)
/*! T1CMP - TMR1 Compare Value TMR1 compare value. If TMR1CMP_EN=1 and the Event Timer matches this value, TMR1IRQ is set. */
#define ZLL_T1CMP_T1CMP(x)                       (((uint32_t)(((uint32_t)(x)) << ZLL_T1CMP_T1CMP_SHIFT)) & ZLL_T1CMP_T1CMP_MASK)
/*! @} */

/*! @name T2CMP - T2 COMPARE (T2CMP)TMR2 Compare Value */
/*! @{ */

#define ZLL_T2CMP_T2CMP_MASK                     (0xFFFFFFFU)
#define ZLL_T2CMP_T2CMP_SHIFT                    (0U)
/*! T2CMP - TMR2 Compare Value TMR2 compare value. If TMR2CMP_EN=1 and TC2PRIME_EN=0 and the Event
 *    Timer matches this value, TMR2IRQ is set.
 */
#define ZLL_T2CMP_T2CMP(x)                       (((uint32_t)(((uint32_t)(x)) << ZLL_T2CMP_T2CMP_SHIFT)) & ZLL_T2CMP_T2CMP_MASK)
/*! @} */

/*! @name T2PRIMECMP - T2 PRIME COMPARE (T2PRIMECMP)TMR2 Prime Compare Value */
/*! @{ */

#define ZLL_T2PRIMECMP_T2PRIMECMP_MASK           (0xFFFFU)
#define ZLL_T2PRIMECMP_T2PRIMECMP_SHIFT          (0U)
/*! T2PRIMECMP - TMR2 Prime Compare Value TMR2 compare value. If TMR2CMP_EN=1 and TC2PRIME_EN=1 and
 *    the Event Timer matches this value, TMR2IRQ is set.
 */
#define ZLL_T2PRIMECMP_T2PRIMECMP(x)             (((uint32_t)(((uint32_t)(x)) << ZLL_T2PRIMECMP_T2PRIMECMP_SHIFT)) & ZLL_T2PRIMECMP_T2PRIMECMP_MASK)
/*! @} */

/*! @name T3CMP - T3 COMPARE (T3CMP)TMR3 Compare Value */
/*! @{ */

#define ZLL_T3CMP_T3CMP_MASK                     (0xFFFFFFFU)
#define ZLL_T3CMP_T3CMP_SHIFT                    (0U)
/*! T3CMP - TMR3 Compare Value TMR3 compare value. If TMR3CMP_EN=1 and the Event Timer matches this value, TMR3IRQ is set. */
#define ZLL_T3CMP_T3CMP(x)                       (((uint32_t)(((uint32_t)(x)) << ZLL_T3CMP_T3CMP_SHIFT)) & ZLL_T3CMP_T3CMP_MASK)
/*! @} */

/*! @name T4CMP - T4 COMPARE (T4CMP)TMR4 Compare Value */
/*! @{ */

#define ZLL_T4CMP_T4CMP_MASK                     (0xFFFFFFFU)
#define ZLL_T4CMP_T4CMP_SHIFT                    (0U)
/*! T4CMP - TMR4 Compare Value TMR4 compare value. If TMR4CMP_EN=1 and the Event Timer matches this value, TMR4IRQ is set. */
#define ZLL_T4CMP_T4CMP(x)                       (((uint32_t)(((uint32_t)(x)) << ZLL_T4CMP_T4CMP_SHIFT)) & ZLL_T4CMP_T4CMP_MASK)
/*! @} */

/*! @name PA_PWR - PA POWER (PA_PWR) */
/*! @{ */

#define ZLL_PA_PWR_PA_PWR_MASK                   (0x7FU)
#define ZLL_PA_PWR_PA_PWR_SHIFT                  (0U)
/*! PA_PWR - PA Power */
#define ZLL_PA_PWR_PA_PWR(x)                     (((uint32_t)(((uint32_t)(x)) << ZLL_PA_PWR_PA_PWR_SHIFT)) & ZLL_PA_PWR_PA_PWR_MASK)

#define ZLL_PA_PWR_EXT_PA_PWR_MASK               (0x7F0000U)
#define ZLL_PA_PWR_EXT_PA_PWR_SHIFT              (16U)
/*! EXT_PA_PWR - External PA Power When transmitting and grant has been asserted, if
 *    zfdbk_txpower_ind asserts, then zfdbk_tx_power[5:0] is assigned to PA_PWR[6:1] and the status bit
 *    EXT_PA_PWR_CHG is set for software to check later. The value recorded in EXT_PA_PWR[6:0] is
 *    {zfdbk_tx_power[5:0],PA_PWR[0]} for debug purposes.
 */
#define ZLL_PA_PWR_EXT_PA_PWR(x)                 (((uint32_t)(((uint32_t)(x)) << ZLL_PA_PWR_EXT_PA_PWR_SHIFT)) & ZLL_PA_PWR_EXT_PA_PWR_MASK)

