zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_PA_PWR_EXT_PA_PWR_CHG_MASK           (0x80000000U)
#define ZLL_PA_PWR_EXT_PA_PWR_CHG_SHIFT          (31U)
/*! EXT_PA_PWR_CHG - External PA Power Change Flag THis flag is asserted when zfdbk_txpower_ind
 *    asserts during transmitting and grant has been asserted. This is write a '1' to clear bit.
 */
#define ZLL_PA_PWR_EXT_PA_PWR_CHG(x)             (((uint32_t)(((uint32_t)(x)) << ZLL_PA_PWR_EXT_PA_PWR_CHG_SHIFT)) & ZLL_PA_PWR_EXT_PA_PWR_CHG_MASK)
/*! @} */

/*! @name CHANNEL_NUM0 - CHANNEL NUMBER 0 (CHANNEL_NUM0)Channel Number for PAN0 */
/*! @{ */

#define ZLL_CHANNEL_NUM0_CHANNEL_NUM0_MASK       (0x7FU)
#define ZLL_CHANNEL_NUM0_CHANNEL_NUM0_SHIFT      (0U)
/*! CHANNEL_NUM0 - Channel Number for PAN0 This is the mapped channel number used to transmit and
 *    receive Zigbee packets. If Dual PAN is engaged, this register applies to PAN0. CHANNEL_NUM0
 *    should be in the range: 11 <= CHANNEL_NUM0 <= 26
 */
#define ZLL_CHANNEL_NUM0_CHANNEL_NUM0(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_CHANNEL_NUM0_CHANNEL_NUM0_SHIFT)) & ZLL_CHANNEL_NUM0_CHANNEL_NUM0_MASK)

#define ZLL_CHANNEL_NUM0_TEMP_MACSHORTADDRS0_MASK (0xFFFF00U)
#define ZLL_CHANNEL_NUM0_TEMP_MACSHORTADDRS0_SHIFT (8U)
/*! TEMP_MACSHORTADDRS0 - TEMPORARY MAC SHORT ADDRESS for PAN0 DURING TRANSITION FROM CHILD TO PARENT AND VICE-VERSA */
#define ZLL_CHANNEL_NUM0_TEMP_MACSHORTADDRS0(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_CHANNEL_NUM0_TEMP_MACSHORTADDRS0_SHIFT)) & ZLL_CHANNEL_NUM0_TEMP_MACSHORTADDRS0_MASK)

#define ZLL_CHANNEL_NUM0_TEMP_SHORTADDRS_EN0_MASK (0x1000000U)
#define ZLL_CHANNEL_NUM0_TEMP_SHORTADDRS_EN0_SHIFT (24U)
/*! TEMP_SHORTADDRS_EN0 - When asserted Packet Processor will accept the packets with MACSHORTADDRS0
 *    and TEMP_MACSHORTADDRS0 during transition of the device. When de-asserted Packet Processor
 *    will accept only the packets with MACSHORTADDRS0
 */
#define ZLL_CHANNEL_NUM0_TEMP_SHORTADDRS_EN0(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_CHANNEL_NUM0_TEMP_SHORTADDRS_EN0_SHIFT)) & ZLL_CHANNEL_NUM0_TEMP_SHORTADDRS_EN0_MASK)
/*! @} */

/*! @name LQI_AND_RSSI - LQI AND RSSI (LQI_AND_RSSI) */
/*! @{ */

#define ZLL_LQI_AND_RSSI_LQI_VALUE_MASK          (0xFFU)
#define ZLL_LQI_AND_RSSI_LQI_VALUE_SHIFT         (0U)
/*! LQI_VALUE - LQI Value Link Quality Indicator for the most recently received packet. (LQI is also
 *    available in the Packet Buffer, at the end of the received packet data)
 */
#define ZLL_LQI_AND_RSSI_LQI_VALUE(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_LQI_AND_RSSI_LQI_VALUE_SHIFT)) & ZLL_LQI_AND_RSSI_LQI_VALUE_MASK)

#define ZLL_LQI_AND_RSSI_RSSI_MASK               (0xFF00U)
#define ZLL_LQI_AND_RSSI_RSSI_SHIFT              (8U)
/*! RSSI - RSSI Value Received Signal Strength Indicator, in dBm */
#define ZLL_LQI_AND_RSSI_RSSI(x)                 (((uint32_t)(((uint32_t)(x)) << ZLL_LQI_AND_RSSI_RSSI_SHIFT)) & ZLL_LQI_AND_RSSI_RSSI_MASK)

#define ZLL_LQI_AND_RSSI_CCA1_ED_FNL_MASK        (0xFF0000U)
#define ZLL_LQI_AND_RSSI_CCA1_ED_FNL_SHIFT       (16U)
/*! CCA1_ED_FNL - Final Result for CCA Mode 1 and Energy Detect Output register to show final
 *    averaged RSSI value or compensated value of the same at the end of a CCA Mode1 or Energy Detect
 *    computation.
 */
#define ZLL_LQI_AND_RSSI_CCA1_ED_FNL(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_LQI_AND_RSSI_CCA1_ED_FNL_SHIFT)) & ZLL_LQI_AND_RSSI_CCA1_ED_FNL_MASK)

#define ZLL_LQI_AND_RSSI_RSSI_CCA_CONT_MASK      (0xFF000000U)
#define ZLL_LQI_AND_RSSI_RSSI_CCA_CONT_SHIFT     (24U)
/*! RSSI_CCA_CONT - This field is read only and never used in WCS FFU Instantiation. It will always read back zero value. */
#define ZLL_LQI_AND_RSSI_RSSI_CCA_CONT(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_LQI_AND_RSSI_RSSI_CCA_CONT_SHIFT)) & ZLL_LQI_AND_RSSI_RSSI_CCA_CONT_MASK)
/*! @} */

/*! @name MACSHORTADDRS0 - MAC SHORT ADDRESS 0 (MACSHORTADDRS0)MAC SHORT ADDRESS for PAN0 */
/*! @{ */

#define ZLL_MACSHORTADDRS0_MACPANID0_MASK        (0xFFFFU)
#define ZLL_MACSHORTADDRS0_MACPANID0_SHIFT       (0U)
/*! MACPANID0 - MAC PAN ID for PAN0 MAC PAN ID for PAN0. The packet processor compares the incoming
 *    packet's Destination PAN ID against the contents of this register to determine if the packet
 *    is addressed to this device; or if the incoming packet is a Beacon frame, the packet processor
 *    compares the incoming packet Source PAN ID against this register. Also, if PANCORDNTR0=1, and
 *    the incoming packet has no Destination Address field, and if the incoming packet is a Data or
 *    MAC Command frame, the packet processor compares the incoming packet Source PAN ID against
 *    this register.
 */
#define ZLL_MACSHORTADDRS0_MACPANID0(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_MACSHORTADDRS0_MACPANID0_SHIFT)) & ZLL_MACSHORTADDRS0_MACPANID0_MASK)

#define ZLL_MACSHORTADDRS0_MACSHORTADDRS0_MASK   (0xFFFF0000U)
#define ZLL_MACSHORTADDRS0_MACSHORTADDRS0_SHIFT  (16U)
/*! MACSHORTADDRS0 - MAC SHORT ADDRESS FOR PAN0 MAC Short Address for PAN0, for 16-bit destination
 *    addressing mode. The packet processor compares the incoming packet's Destination Address
 *    against the contents of this register to determine if the packet is addressed to this device.
 */
#define ZLL_MACSHORTADDRS0_MACSHORTADDRS0(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_MACSHORTADDRS0_MACSHORTADDRS0_SHIFT)) & ZLL_MACSHORTADDRS0_MACSHORTADDRS0_MASK)
/*! @} */

/*! @name MACLONGADDRS0_LSB - MAC LONG ADDRESS 0 LSB (MACLONGADDRS0_LSB)MAC LONG ADDRESS for PAN0 LSB */
/*! @{ */

#define ZLL_MACLONGADDRS0_LSB_MACLONGADDRS0_LSB_MASK (0xFFFFFFFFU)
#define ZLL_MACLONGADDRS0_LSB_MACLONGADDRS0_LSB_SHIFT (0U)
/*! MACLONGADDRS0_LSB - MAC LONG ADDRESS for PAN0 LSB MAC Long Address for PAN0, for 64-bit
 *    destination addressing mode. The packet processor compares the incoming packet's Destination Address
 *    against the contents of this register to determine if the packet is addressed to this device.
 */
#define ZLL_MACLONGADDRS0_LSB_MACLONGADDRS0_LSB(x) (((uint32_t)(((uint32_t)(x)) << ZLL_MACLONGADDRS0_LSB_MACLONGADDRS0_LSB_SHIFT)) & ZLL_MACLONGADDRS0_LSB_MACLONGADDRS0_LSB_MASK)
/*! @} */

/*! @name MACLONGADDRS0_MSB - MAC LONG ADDRESS 0 MSB (MACLONGADDRS0_MSB)MAC LONG ADDRESS for PAN0 MSB */
/*! @{ */

#define ZLL_MACLONGADDRS0_MSB_MACLONGADDRS0_MSB_MASK (0xFFFFFFFFU)
#define ZLL_MACLONGADDRS0_MSB_MACLONGADDRS0_MSB_SHIFT (0U)
/*! MACLONGADDRS0_MSB - MAC LONG ADDRESS for PAN0 MSB MAC Long Address for PAN0, for 64-bit
 *    destination addressing mode. The packet processor compares the incoming packet's Destination Address
 *    against the contents of this register to determine if the packet is addressed to this device.
 */
#define ZLL_MACLONGADDRS0_MSB_MACLONGADDRS0_MSB(x) (((uint32_t)(((uint32_t)(x)) << ZLL_MACLONGADDRS0_MSB_MACLONGADDRS0_MSB_SHIFT)) & ZLL_MACLONGADDRS0_MSB_MACLONGADDRS0_MSB_MASK)
/*! @} */

/*! @name RX_FRAME_FILTER - RECEIVE FRAME FILTER (RX_FRAME_FILTER)RECEIVE FRAME FILTER */
/*! @{ */

#define ZLL_RX_FRAME_FILTER_BEACON_FT_MASK       (0x1U)
#define ZLL_RX_FRAME_FILTER_BEACON_FT_SHIFT      (0U)
/*! BEACON_FT - Beacon Frame Type Enable 0x0,reject all Beacon frames, 0x1,Beacon frame type enabled. */
#define ZLL_RX_FRAME_FILTER_BEACON_FT(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_BEACON_FT_SHIFT)) & ZLL_RX_FRAME_FILTER_BEACON_FT_MASK)

#define ZLL_RX_FRAME_FILTER_DATA_FT_MASK         (0x2U)
#define ZLL_RX_FRAME_FILTER_DATA_FT_SHIFT        (1U)
/*! DATA_FT - Data Frame Type Enable 0x0,reject all Data frames, 0x1,Data frame type enabled. */
#define ZLL_RX_FRAME_FILTER_DATA_FT(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_DATA_FT_SHIFT)) & ZLL_RX_FRAME_FILTER_DATA_FT_MASK)

