zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_RX_FRAME_FILTER_ACK_FT_MASK          (0x4U)
#define ZLL_RX_FRAME_FILTER_ACK_FT_SHIFT         (2U)
/*! ACK_FT - Ack Frame Type Enable 0x0,reject all Acknowledge frames, 0x1,Acknowledge frame type enabled. */
#define ZLL_RX_FRAME_FILTER_ACK_FT(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_ACK_FT_SHIFT)) & ZLL_RX_FRAME_FILTER_ACK_FT_MASK)

#define ZLL_RX_FRAME_FILTER_CMD_FT_MASK          (0x8U)
#define ZLL_RX_FRAME_FILTER_CMD_FT_SHIFT         (3U)
/*! CMD_FT - MAC Command Frame Type Enable 0x0,reject all MAC Command frames, 0x1,MAC Command frame type enabled. */
#define ZLL_RX_FRAME_FILTER_CMD_FT(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_CMD_FT_SHIFT)) & ZLL_RX_FRAME_FILTER_CMD_FT_MASK)

#define ZLL_RX_FRAME_FILTER_LLDN_FT_MASK         (0x10U)
#define ZLL_RX_FRAME_FILTER_LLDN_FT_SHIFT        (4U)
/*! LLDN_FT - LLDN Frame Type Enable 0x0,reject all LLDN frames, 0x1,LLDN frame type enabled (Frame Type 4). */
#define ZLL_RX_FRAME_FILTER_LLDN_FT(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_LLDN_FT_SHIFT)) & ZLL_RX_FRAME_FILTER_LLDN_FT_MASK)

#define ZLL_RX_FRAME_FILTER_MULTIPURPOSE_FT_MASK (0x20U)
#define ZLL_RX_FRAME_FILTER_MULTIPURPOSE_FT_SHIFT (5U)
/*! MULTIPURPOSE_FT - Multipurpose Frame Type Enable 0x0,reject all Multipurpose frames, 0x1,Multipurpose frame type enabled (Frame Type 5). */
#define ZLL_RX_FRAME_FILTER_MULTIPURPOSE_FT(x)   (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_MULTIPURPOSE_FT_SHIFT)) & ZLL_RX_FRAME_FILTER_MULTIPURPOSE_FT_MASK)

#define ZLL_RX_FRAME_FILTER_NS_FT_MASK           (0x40U)
#define ZLL_RX_FRAME_FILTER_NS_FT_SHIFT          (6U)
/*! NS_FT - Not Specified Frame Type Enable This bit enables reception of all Frame Types not
 *    covered by the other _FT bits in this register. 0x0,reject all Not Specified frames,
 *    0x1,Not-specified (reserved) frame type enabled. Applies to Frame Type, 6. No packet filtering is performed,
 *    except for frame length checking (FrameLength>=5 and FrameLength<=127). No AUTOACK is
 *    transmitted for this Frame Type
 */
#define ZLL_RX_FRAME_FILTER_NS_FT(x)             (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_NS_FT_SHIFT)) & ZLL_RX_FRAME_FILTER_NS_FT_MASK)

#define ZLL_RX_FRAME_FILTER_EXTENDED_FT_MASK     (0x80U)
#define ZLL_RX_FRAME_FILTER_EXTENDED_FT_SHIFT    (7U)
/*! EXTENDED_FT - Extended Frame Type Enable 0x0,reject all Extended frames, 0x1,Extended frame type enabled (Frame Type 7). */
#define ZLL_RX_FRAME_FILTER_EXTENDED_FT(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_EXTENDED_FT_SHIFT)) & ZLL_RX_FRAME_FILTER_EXTENDED_FT_MASK)

#define ZLL_RX_FRAME_FILTER_FRM_VER_FILTER_MASK  (0xF00U)
#define ZLL_RX_FRAME_FILTER_FRM_VER_FILTER_SHIFT (8U)
/*! FRM_VER_FILTER - Frame Version selector. The incoming packet's Frame Control Field is parsed to
 *    obtain the FrameVersion subfield, and that value is compared against this register, in
 *    accordance with the following: xxx1: Accept received packets with FrameVersion=00 xx1x: Accept
 *    received packets with FrameVersion=01 x1xx: Accept received packets with FrameVersion=10 1xxx:
 *    Accept received packets with FrameVersion=11 These filtering rules apply to Beacon, Acknowledge,
 *    Data, and MAC Command Frame Types, since these frame types require a 2-octet Frame Control Field
 *    which embeds a 2-bit FrameVersion subfield. Later frame types introduced in the 802.15.4e
 *    addendum (LLDN, Multipurpose) don't guarantee a FrameVersion subfield with the original meaning,
 *    so these filtering rules do not apply to these frame types. See registers LLDN_FT and
 *    MULTIPURPOSE_FT. For Acknowledge frames, FrameVersion bits are ignored by the Packet Processor,
 *    irrespective of FRM_VER_FILTER.
 */
#define ZLL_RX_FRAME_FILTER_FRM_VER_FILTER(x)    (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_FRM_VER_FILTER_SHIFT)) & ZLL_RX_FRAME_FILTER_FRM_VER_FILTER_MASK)

#define ZLL_RX_FRAME_FILTER_FV2_ALLOW_BCD_TYPE_FOR_PP_MASK (0x1000U)
#define ZLL_RX_FRAME_FILTER_FV2_ALLOW_BCD_TYPE_FOR_PP_SHIFT (12U)
/*! FV2_ALLOW_BCD_TYPE_FOR_PP - Enable packet_processor filter check on pp_filterfail_code0/1 for
 *    FV2, FrameType Beacon/CMD/DATA if 1'b1 : pp_filterail_code0/1 enabled for FV2, PacketType
 *    Beacon/Cmd/Data if 1'b0 (default) pp_filterfail_code0/1 are forced zero (for FV2)
 */
#define ZLL_RX_FRAME_FILTER_FV2_ALLOW_BCD_TYPE_FOR_PP(x) (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_FV2_ALLOW_BCD_TYPE_FOR_PP_SHIFT)) & ZLL_RX_FRAME_FILTER_FV2_ALLOW_BCD_TYPE_FOR_PP_MASK)

#define ZLL_RX_FRAME_FILTER_EXTENDED_FCS_CHK_MASK (0x8000U)
#define ZLL_RX_FRAME_FILTER_EXTENDED_FCS_CHK_SHIFT (15U)
/*! EXTENDED_FCS_CHK - Verify FCS on Frame Type Extended 0x0,Packet Processor will not check FCS for
 *    Frame Type EXTENDED (default), 0x1,Packet Processor will check FCS at end-of-packet based on
 *    packet, length derived from PHR, for Frame Type EXTENDED
 */
#define ZLL_RX_FRAME_FILTER_EXTENDED_FCS_CHK(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_EXTENDED_FCS_CHK_SHIFT)) & ZLL_RX_FRAME_FILTER_EXTENDED_FCS_CHK_MASK)

#define ZLL_RX_FRAME_FILTER_FV2_BEACON_RECD_MASK (0x10000U)
#define ZLL_RX_FRAME_FILTER_FV2_BEACON_RECD_SHIFT (16U)
/*! FV2_BEACON_RECD - Frame Version 2 Beacon Packet Received 0x0,The last packet received was not
 *    Frame Type Beacon with Frame Version 2, 0x1,The last packet received was Frame Type Beacon with
 *    Frame Version 2 and FRM_VER_FILTER[2]=1 to allow such packets
 */
#define ZLL_RX_FRAME_FILTER_FV2_BEACON_RECD(x)   (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_FV2_BEACON_RECD_SHIFT)) & ZLL_RX_FRAME_FILTER_FV2_BEACON_RECD_MASK)

#define ZLL_RX_FRAME_FILTER_FV2_DATA_RECD_MASK   (0x20000U)
#define ZLL_RX_FRAME_FILTER_FV2_DATA_RECD_SHIFT  (17U)
/*! FV2_DATA_RECD - Frame Version 2 Data Packet Received 0x0,The last packet received was not Frame
 *    Type Data with Frame Version 2, 0x1,The last packet received was Frame Type Data with Frame
 *    Version 2 and FRM_VER_FILTER[2]=1 to allow such packets
 */
#define ZLL_RX_FRAME_FILTER_FV2_DATA_RECD(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_FV2_DATA_RECD_SHIFT)) & ZLL_RX_FRAME_FILTER_FV2_DATA_RECD_MASK)

#define ZLL_RX_FRAME_FILTER_FV2_ACK_RECD_MASK    (0x40000U)
#define ZLL_RX_FRAME_FILTER_FV2_ACK_RECD_SHIFT   (18U)
/*! FV2_ACK_RECD - Frame Version 2 Acknowledge Packet Received 0x0,The last packet received was not
 *    Frame Type Ack with Frame Version 2, 0x1,The last packet received was Frame Type Ack with
 *    Frame Version 2 and FRM_VER_FILTER[2]=1 to allow such packets
 */
#define ZLL_RX_FRAME_FILTER_FV2_ACK_RECD(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_FV2_ACK_RECD_SHIFT)) & ZLL_RX_FRAME_FILTER_FV2_ACK_RECD_MASK)

#define ZLL_RX_FRAME_FILTER_FV2_CMD_RECD_MASK    (0x80000U)
#define ZLL_RX_FRAME_FILTER_FV2_CMD_RECD_SHIFT   (19U)
/*! FV2_CMD_RECD - Frame Version 2 MAC Command Packet Received 0x0,The last packet received was not
 *    Frame Type MAC Command with Frame, Version 2 0x1,The last packet received was Frame Type MAC
 *    Command with Frame, Version 2, and FRM_VER_FILTER[2]=1 to allow such packets
 */
#define ZLL_RX_FRAME_FILTER_FV2_CMD_RECD(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_FV2_CMD_RECD_SHIFT)) & ZLL_RX_FRAME_FILTER_FV2_CMD_RECD_MASK)

