zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_RX_FRAME_FILTER_LLDN_RECD_MASK       (0x100000U)
#define ZLL_RX_FRAME_FILTER_LLDN_RECD_SHIFT      (20U)
/*! LLDN_RECD - LLDN Packet Received 0x0,The last packet received was not Frame Type LLDN, 0x1,The
 *    last packet received was Frame Type LLDN, and LLDN_FT=1 to allow, such packets.
 */
#define ZLL_RX_FRAME_FILTER_LLDN_RECD(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_LLDN_RECD_SHIFT)) & ZLL_RX_FRAME_FILTER_LLDN_RECD_MASK)

#define ZLL_RX_FRAME_FILTER_MULTIPURPOSE_RECD_MASK (0x200000U)
#define ZLL_RX_FRAME_FILTER_MULTIPURPOSE_RECD_SHIFT (21U)
/*! MULTIPURPOSE_RECD - Multipurpose Packet Received 0x0,last packet received was not Frame Type
 *    MULTIPURPOSE, 0x1,The last packet received was Frame Type MULTIPURPOSE, and, MULTIPURPOSE_FT=1 to
 *    allow such packets.
 */
#define ZLL_RX_FRAME_FILTER_MULTIPURPOSE_RECD(x) (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_MULTIPURPOSE_RECD_SHIFT)) & ZLL_RX_FRAME_FILTER_MULTIPURPOSE_RECD_MASK)

#define ZLL_RX_FRAME_FILTER_EXTENDED_RECD_MASK   (0x800000U)
#define ZLL_RX_FRAME_FILTER_EXTENDED_RECD_SHIFT  (23U)
/*! EXTENDED_RECD - Extended Packet Received 0x0,The last packet received was not Frame Type
 *    EXTENDED, 0x1,The last packet received was Frame Type EXTENDED, and EXTENDED_FT=1, to allow such
 *    packets.
 */
#define ZLL_RX_FRAME_FILTER_EXTENDED_RECD(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_EXTENDED_RECD_SHIFT)) & ZLL_RX_FRAME_FILTER_EXTENDED_RECD_MASK)

#define ZLL_RX_FRAME_FILTER_PROMISCUOUS_MASK     (0x1000000U)
#define ZLL_RX_FRAME_FILTER_PROMISCUOUS_SHIFT    (24U)
/*! PROMISCUOUS - Promiscuous Mode Enable (PAN0) Bypasses most packet filtering. 0x0,normal mode,
 *    0x1,all packet filtering except frame length checking (FrameLength>=5, and FrameLength<=127) is
 *    bypassed.
 */
#define ZLL_RX_FRAME_FILTER_PROMISCUOUS(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_PROMISCUOUS_SHIFT)) & ZLL_RX_FRAME_FILTER_PROMISCUOUS_MASK)

#define ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_MASK (0x2000000U)
#define ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_SHIFT (25U)
/*! ACTIVE_PROMISCUOUS - Active Promiscuous (PAN0) 0x0,normal operation, 0x1,Provide Data Indication
 *    on all received packets under the same rules, which apply in PROMISCUOUS mode, however
 *    acknowledge those packets under rules which apply in non-PROMISCUOUS mode
 */
#define ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS(x) (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_SHIFT)) & ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_MASK)

#define ZLL_RX_FRAME_FILTER_AUTOACK_MASK         (0x4000000U)
#define ZLL_RX_FRAME_FILTER_AUTOACK_SHIFT        (26U)
/*! AUTOACK - Auto Acknowledge Enable (PAN0) Applies only to Sequence R and Sequence TR, ignored
 *    during other sequences 0x0,sequence manager will not follow a receive frame with a Tx Ack, frame,
 *    under any conditions; the autosequence will terminate after the receive frame. 0x1,sequence
 *    manager will follow a receive frame with an automatic, hardware-generated Tx Ack frame,
 *    assuming other necessary conditions are met.
 */
#define ZLL_RX_FRAME_FILTER_AUTOACK(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_AUTOACK_SHIFT)) & ZLL_RX_FRAME_FILTER_AUTOACK_MASK)

#define ZLL_RX_FRAME_FILTER_PANCORDNTR0_MASK     (0x8000000U)
#define ZLL_RX_FRAME_FILTER_PANCORDNTR0_SHIFT    (27U)
/*! PANCORDNTR0 - Device is a PAN Coordinator on PAN0 Device is a PAN Coordinator on PAN0. Allows
 *    device to receive packets with no destination address, if Source PAN ID matches.
 */
#define ZLL_RX_FRAME_FILTER_PANCORDNTR0(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_PANCORDNTR0_SHIFT)) & ZLL_RX_FRAME_FILTER_PANCORDNTR0_MASK)

#define ZLL_RX_FRAME_FILTER_PROMISCUOUS_PAN1_MASK (0x10000000U)
#define ZLL_RX_FRAME_FILTER_PROMISCUOUS_PAN1_SHIFT (28U)
/*! PROMISCUOUS_PAN1 - Promiscuous Mode Enable (PAN1) */
#define ZLL_RX_FRAME_FILTER_PROMISCUOUS_PAN1(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_PROMISCUOUS_PAN1_SHIFT)) & ZLL_RX_FRAME_FILTER_PROMISCUOUS_PAN1_MASK)

#define ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_PAN1_MASK (0x20000000U)
#define ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_PAN1_SHIFT (29U)
/*! ACTIVE_PROMISCUOUS_PAN1 - Active Promiscuous Mode Enable (PAN1) */
#define ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_PAN1(x) (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_PAN1_SHIFT)) & ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_PAN1_MASK)

#define ZLL_RX_FRAME_FILTER_AUTOACK_PAN1_MASK    (0x40000000U)
#define ZLL_RX_FRAME_FILTER_AUTOACK_PAN1_SHIFT   (30U)
/*! AUTOACK_PAN1 - Auto Acknowledge Enable (PAN1) */
#define ZLL_RX_FRAME_FILTER_AUTOACK_PAN1(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_AUTOACK_PAN1_SHIFT)) & ZLL_RX_FRAME_FILTER_AUTOACK_PAN1_MASK)

#define ZLL_RX_FRAME_FILTER_PANCORDNTR1_MASK     (0x80000000U)
#define ZLL_RX_FRAME_FILTER_PANCORDNTR1_SHIFT    (31U)
/*! PANCORDNTR1 - Device is a PAN Coordinator on PAN1 */
#define ZLL_RX_FRAME_FILTER_PANCORDNTR1(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_RX_FRAME_FILTER_PANCORDNTR1_SHIFT)) & ZLL_RX_FRAME_FILTER_PANCORDNTR1_MASK)
/*! @} */

/*! @name CCA_LQI_CTRL - CCA AND LQI CONTROL (CCA_LQI_CTRL) */
/*! @{ */

#define ZLL_CCA_LQI_CTRL_CCA1_THRESH_MASK        (0xFFU)
#define ZLL_CCA_LQI_CTRL_CCA1_THRESH_SHIFT       (0U)
/*! CCA1_THRESH - CCA Mode 1 Threshold Programmable energy threshold register for CCA mode 1. */
#define ZLL_CCA_LQI_CTRL_CCA1_THRESH(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_CCA_LQI_CTRL_CCA1_THRESH_SHIFT)) & ZLL_CCA_LQI_CTRL_CCA1_THRESH_MASK)

#define ZLL_CCA_LQI_CTRL_LQI_OFFSET_COMP_MASK    (0xFF0000U)
#define ZLL_CCA_LQI_CTRL_LQI_OFFSET_COMP_SHIFT   (16U)
/*! LQI_OFFSET_COMP - LQI Offset Compensation Programmable amount to offset RSSI based LQI value */
#define ZLL_CCA_LQI_CTRL_LQI_OFFSET_COMP(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_CCA_LQI_CTRL_LQI_OFFSET_COMP_SHIFT)) & ZLL_CCA_LQI_CTRL_LQI_OFFSET_COMP_MASK)

#define ZLL_CCA_LQI_CTRL_SIMUL_CCA_RX_MASK       (0x1000000U)
#define ZLL_CCA_LQI_CTRL_SIMUL_CCA_RX_SHIFT      (24U)
/*! SIMUL_CCA_RX - Simultaneous CCA and Receive Enable During autosequences of type Sequence T or
 *    Sequence TR with CCA before TX, this bit allows a packet to be received if preamble and SFD are
 *    detected during the CCA measurement window. 0x0,Packets can't be received during CCA
 *    measurement, 0x1,Packet reception is enabled during CCA measurement if preamble and, SFD are detected
 */
#define ZLL_CCA_LQI_CTRL_SIMUL_CCA_RX(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_CCA_LQI_CTRL_SIMUL_CCA_RX_SHIFT)) & ZLL_CCA_LQI_CTRL_SIMUL_CCA_RX_MASK)

#define ZLL_CCA_LQI_CTRL_CCA3_AND_NOT_OR_MASK    (0x8000000U)
#define ZLL_CCA_LQI_CTRL_CCA3_AND_NOT_OR_SHIFT   (27U)
/*! CCA3_AND_NOT_OR - CCA Mode 3 AND not OR Determines the way CCA3 is required to be detected 0x0,CCA1 or CCA2, 0x1,CCA1 and CCA2 */
#define ZLL_CCA_LQI_CTRL_CCA3_AND_NOT_OR(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_CCA_LQI_CTRL_CCA3_AND_NOT_OR_SHIFT)) & ZLL_CCA_LQI_CTRL_CCA3_AND_NOT_OR_MASK)

