zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_CCA_LQI_CTRL_CONT_RSSI_EN_MASK       (0x20000000U)
#define ZLL_CCA_LQI_CTRL_CONT_RSSI_EN_SHIFT      (29U)
/*! CONT_RSSI_EN - This is a function not used in WCS FFU Instantiation */
#define ZLL_CCA_LQI_CTRL_CONT_RSSI_EN(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_CCA_LQI_CTRL_CONT_RSSI_EN_SHIFT)) & ZLL_CCA_LQI_CTRL_CONT_RSSI_EN_MASK)
/*! @} */

/*! @name CCA2_CTRL - CCA2 CONTROL (CCA2_CTRL)CCA Mode 2 Control in Link Layer. This register provides control for CCA Mode 2 Correlation Threshold and Correlation Peaks related settings */
/*! @{ */

#define ZLL_CCA2_CTRL_CCA2_NUM_CORR_PEAKS_MASK   (0xFU)
#define ZLL_CCA2_CTRL_CCA2_NUM_CORR_PEAKS_SHIFT  (0U)
/*! CCA2_NUM_CORR_PEAKS - CCA Mode 2 Number of Correlation Peaks Detected Counts of number of peaks
 *    that crossed CCA2_CORR_THRESH in CCA Mode 2 operation
 */
#define ZLL_CCA2_CTRL_CCA2_NUM_CORR_PEAKS(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_CCA2_CTRL_CCA2_NUM_CORR_PEAKS_SHIFT)) & ZLL_CCA2_CTRL_CCA2_NUM_CORR_PEAKS_MASK)

#define ZLL_CCA2_CTRL_CCA2_MIN_NUM_CORR_TH_MASK  (0x70U)
#define ZLL_CCA2_CTRL_CCA2_MIN_NUM_CORR_TH_SHIFT (4U)
/*! CCA2_MIN_NUM_CORR_TH - CCA Mode 2 Threshold Number of Correlation Peaks Programmable threshold
 *    to be compared against number of correlation peaks that exceeded CCA2_CORR_THRESH for detecting
 *    CCA mode 2. Number of peaks detected = CCA2_MIN_NUM_CORR_TH + 1; Example: If it is programmed
 *    to 3, CCA2 logic looks for at least 4 correlation peaks that crossed the threshold, to
 *    indicate channel is idle or busy.
 */
#define ZLL_CCA2_CTRL_CCA2_MIN_NUM_CORR_TH(x)    (((uint32_t)(((uint32_t)(x)) << ZLL_CCA2_CTRL_CCA2_MIN_NUM_CORR_TH_SHIFT)) & ZLL_CCA2_CTRL_CCA2_MIN_NUM_CORR_TH_MASK)

#define ZLL_CCA2_CTRL_CCA2_CORR_THRESH_MASK      (0xFF00U)
#define ZLL_CCA2_CTRL_CCA2_CORR_THRESH_SHIFT     (8U)
/*! CCA2_CORR_THRESH - CCA Mode 2 Correlation Threshold Correlator threshold used to qualify
 *    correlator peaks counted by CCA2_NUM_CORR_PEAKS. Correlator peaks exceeding this value increment
 *    CCA2_NUM_CORR_PEAKS.
 */
#define ZLL_CCA2_CTRL_CCA2_CORR_THRESH(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_CCA2_CTRL_CCA2_CORR_THRESH_SHIFT)) & ZLL_CCA2_CTRL_CCA2_CORR_THRESH_MASK)
/*! @} */

/*! @name DSM_CTRL - DSM CONTROL (DSM_CTRL) */
/*! @{ */

#define ZLL_DSM_CTRL_ZIGBEE_SLEEP_REQUEST_MASK   (0x1U)
#define ZLL_DSM_CTRL_ZIGBEE_SLEEP_REQUEST_SHIFT  (0U)
/*! ZIGBEE_SLEEP_REQUEST - 802.15.4 Deep Sleep Mode Request for Manual DSM If 802.15.4 is assigned
 *    to Manual DSM (XCVR_CTRL[MAN_DSM_SEL] = 1), setting ZIGBEE_SLEEP_REQUEST to 1 enables Deep
 *    Sleep Mode (DSM) to be entered when the RFMC TIMER matches the WOR ENTER_TIME register.
 */
#define ZLL_DSM_CTRL_ZIGBEE_SLEEP_REQUEST(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_DSM_CTRL_ZIGBEE_SLEEP_REQUEST_SHIFT)) & ZLL_DSM_CTRL_ZIGBEE_SLEEP_REQUEST_MASK)
/*! @} */

/*! @name BSM_CTRL - BSM CONTROL (BSM_CTRL) */
/*! @{ */

#define ZLL_BSM_CTRL_BSM_EN_MASK                 (0x1U)
#define ZLL_BSM_CTRL_BSM_EN_SHIFT                (0U)
/*! BSM_EN - Enable Bit Stream Mode Controller */
#define ZLL_BSM_CTRL_BSM_EN(x)                   (((uint32_t)(((uint32_t)(x)) << ZLL_BSM_CTRL_BSM_EN_SHIFT)) & ZLL_BSM_CTRL_BSM_EN_MASK)
/*! @} */

/*! @name MACSHORTADDRS1 - MAC SHORT ADDRESS FOR PAN1 (MACSHORTADDRS1)The MACSHORTADDRS1 register . */
/*! @{ */

#define ZLL_MACSHORTADDRS1_MACPANID1_MASK        (0xFFFFU)
#define ZLL_MACSHORTADDRS1_MACPANID1_SHIFT       (0U)
/*! MACPANID1 - MAC PAN ID for PAN1 MAC PAN ID for PAN1. The packet processor compares the incoming
 *    packet's Destination PAN ID against the contents of this register to determine if the packet
 *    is addressed to this device; or if the incoming packet is a Beacon frame, the packet processor
 *    compares the incoming packet Source PAN ID against this register. Also, if PANCORDNTR1=1, and
 *    the incoming packet has no Destination Address field, and if the incoming packet is a Data or
 *    MAC Command frame, the packet processor compares the incoming packet Source PAN ID against
 *    this register.
 */
#define ZLL_MACSHORTADDRS1_MACPANID1(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_MACSHORTADDRS1_MACPANID1_SHIFT)) & ZLL_MACSHORTADDRS1_MACPANID1_MASK)

#define ZLL_MACSHORTADDRS1_MACSHORTADDRS1_MASK   (0xFFFF0000U)
#define ZLL_MACSHORTADDRS1_MACSHORTADDRS1_SHIFT  (16U)
/*! MACSHORTADDRS1 - MAC SHORT ADDRESS for PAN1 MAC Short Address for PAN1, for 16-bit destination
 *    addressing mode. The packet processor compares the incoming packet's Destination Address
 *    against the contents of this register to determine if the packet is addressed to this device.
 */
#define ZLL_MACSHORTADDRS1_MACSHORTADDRS1(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_MACSHORTADDRS1_MACSHORTADDRS1_SHIFT)) & ZLL_MACSHORTADDRS1_MACSHORTADDRS1_MASK)
/*! @} */

/*! @name MACLONGADDRS1_LSB - MAC LONG ADDRESS 1 LSB (MACLONGADDRS1_LSB)MAC Long Address for PAN1 */
/*! @{ */

#define ZLL_MACLONGADDRS1_LSB_MACLONGADDRS1_LSB_MASK (0xFFFFFFFFU)
#define ZLL_MACLONGADDRS1_LSB_MACLONGADDRS1_LSB_SHIFT (0U)
/*! MACLONGADDRS1_LSB - MAC LONG ADDRESS for PAN1 LSB MAC Long Address for PAN1, for 64-bit
 *    destination addressing mode. The packet processor compares the incoming packet's Destination Address
 *    against the contents of this register to determine if the packet is addressed to this device.
 */
#define ZLL_MACLONGADDRS1_LSB_MACLONGADDRS1_LSB(x) (((uint32_t)(((uint32_t)(x)) << ZLL_MACLONGADDRS1_LSB_MACLONGADDRS1_LSB_SHIFT)) & ZLL_MACLONGADDRS1_LSB_MACLONGADDRS1_LSB_MASK)
/*! @} */

/*! @name MACLONGADDRS1_MSB - MAC LONG ADDRESS 1 MSB (MACLONGADDRS1_MSB)MAC Long Address for PAN1 */
/*! @{ */

#define ZLL_MACLONGADDRS1_MSB_MACLONGADDRS1_MSB_MASK (0xFFFFFFFFU)
#define ZLL_MACLONGADDRS1_MSB_MACLONGADDRS1_MSB_SHIFT (0U)
/*! MACLONGADDRS1_MSB - MAC LONG ADDRESS for PAN1 MSB MAC Long Address for PAN1, for 64-bit
 *    destination addressing mode. The packet processor compares the incoming packet's Destination Address
 *    against the contents of this register to determine if the packet is addressed to this device.
 */
#define ZLL_MACLONGADDRS1_MSB_MACLONGADDRS1_MSB(x) (((uint32_t)(((uint32_t)(x)) << ZLL_MACLONGADDRS1_MSB_MACLONGADDRS1_MSB_SHIFT)) & ZLL_MACLONGADDRS1_MSB_MACLONGADDRS1_MSB_MASK)
/*! @} */

/*! @name DUAL_PAN_CTRL - DUAL PAN CONTROL (DUAL_PAN_CTRL)Dual PAN Control Register */
/*! @{ */

