zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_DUAL_PAN_CTRL_ACTIVE_NETWORK_MASK    (0x1U)
#define ZLL_DUAL_PAN_CTRL_ACTIVE_NETWORK_SHIFT   (0U)
/*! ACTIVE_NETWORK - Active Network Selector Selects the PAN on which to transceive, by activating a
 *    PAN parameter set (PAN0 or PAN1). In Manual Dual PAN mode (or Single PAN mode), this bit
 *    selects the active PAN parameter set (channel and addressing parameters) which governs all
 *    autosequences. In Auto Dual PAN mode, this bit selects the PAN on which to begin transceiving,
 *    latched at the point at which DUAL_PAN_DWELL register is written. 0x0,Select PAN0, 0x1,Select PAN1
 */
#define ZLL_DUAL_PAN_CTRL_ACTIVE_NETWORK(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_ACTIVE_NETWORK_SHIFT)) & ZLL_DUAL_PAN_CTRL_ACTIVE_NETWORK_MASK)

#define ZLL_DUAL_PAN_CTRL_DUAL_PAN_AUTO_MASK     (0x2U)
#define ZLL_DUAL_PAN_CTRL_DUAL_PAN_AUTO_SHIFT    (1U)
/*! DUAL_PAN_AUTO - Activates automatic Dual PAN operating mode Activates automatic Dual PAN
 *    operating mode. In this mode, PAN-switching is controlled by hardware at a pre-programmed rate,
 *    determined by DUAL_PAN_DWELL. 0: Manual Dual PAN mode (or Single PAN mode). 1: Auto Dual PAN Mode
 *    Whenever DUAL_PAN_AUTO=0, CURRENT_NETWORK=ACTIVE_NETWORK at all times. In other words, software
 *    directly controls which PAN is selected. Whenever DUAL_PAN_AUTO=1, CURRENT_NETWORK is
 *    controlled by hardware.
 */
#define ZLL_DUAL_PAN_CTRL_DUAL_PAN_AUTO(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_DUAL_PAN_AUTO_SHIFT)) & ZLL_DUAL_PAN_CTRL_DUAL_PAN_AUTO_MASK)

#define ZLL_DUAL_PAN_CTRL_CURRENT_NETWORK_MASK   (0x8U)
#define ZLL_DUAL_PAN_CTRL_CURRENT_NETWORK_SHIFT  (3U)
/*! CURRENT_NETWORK - Indicates which PAN is currently selected by hardware This read-only bit
 *    indicates which PAN is currently selected by hardware in automatic Dual PAN mode 0x0,PAN0 is
 *    selected, 0x1,PAN1 is selected
 */
#define ZLL_DUAL_PAN_CTRL_CURRENT_NETWORK(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_CURRENT_NETWORK_SHIFT)) & ZLL_DUAL_PAN_CTRL_CURRENT_NETWORK_MASK)

#define ZLL_DUAL_PAN_CTRL_ZB_DP_CHAN_OVRD_EN_MASK (0x10U)
#define ZLL_DUAL_PAN_CTRL_ZB_DP_CHAN_OVRD_EN_SHIFT (4U)
/*! ZB_DP_CHAN_OVRD_EN - Dual PAN Channel Override Enable In Dual PAN mode, in case there is a need
 *    to generate a frequency which may be offset from the 16 prescribed 5MHz-spaced channels, to,
 *    for example, avoid interference on one of the Dual PAN channels, a method has been provided to
 *    accomplish that, by designating one of the two PAN channels to use the transceiver's set of
 *    direct frequency-programming registers, instead of CHANNEL_NUMx. Programming the direct
 *    frequency-programming registers -- integer, numerator, and denominator, allows an RF frequency to be
 *    selected with much more precision than the 5MHz granularity of the Zigbee mapped-channel
 *    registers, CHANNEL_NUM0 and CHANNEL_NUM1. Two bits have been provided in 802.15.4 space to realize
 *    this feature: ZB_DP_CHAN_OVRD_SEL and ZB_DP_CHAN_OVRD_EN. When ZB_DP_CHAN_OVRD_EN=1, this
 *    enables one of the Dual PAN channels to use the direct frequency programming. The
 *    ZB_DP_CHAN_OVRD_SEL bit determines which channel uses the direct programming, according to the following: If
 *    ZB_DP_CHAN_OVRD_EN=0, then PAN0 frequency is determined by register CHANNEL_NUM0[6:0] and PAN1
 *    frequency is determined by register CHANNEL_NUM1[6:0]. If ZB_DP_CHAN_OVRD_EN=1 and
 *    ZB_DP_CHAN_OVRD_SEL=0, then PAN0 frequency is determined by DIRECT FREQUENCY PROGRAMMING and PAN1
 *    frequency is determined by register CHANNEL_NUM1[6:0]. If ZB_DP_CHAN_OVRD_EN=1 and
 *    ZB_DP_CHAN_OVRD_SEL=1, then PAN0 frequency is determined by register CHANNEL_NUM0[6:0] and PAN1 frequency is
 *    determined by DIRECT FREQUENCY PROGRAMMING. Direct Frequency Programming is accomplished by
 *    setting the PLL's Integer, Numerator, and Denominator registers to the appropriate values for the
 *    desired RF frequency.
 */
#define ZLL_DUAL_PAN_CTRL_ZB_DP_CHAN_OVRD_EN(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_ZB_DP_CHAN_OVRD_EN_SHIFT)) & ZLL_DUAL_PAN_CTRL_ZB_DP_CHAN_OVRD_EN_MASK)

#define ZLL_DUAL_PAN_CTRL_ZB_DP_CHAN_OVRD_SEL_MASK (0x20U)
#define ZLL_DUAL_PAN_CTRL_ZB_DP_CHAN_OVRD_SEL_SHIFT (5U)
/*! ZB_DP_CHAN_OVRD_SEL - Dual PAN Channel Override Selector This bit works with ZB_DP_CHAN_OVRD_EN
 *    to allow one of the two Dual PAN channels to use Direct Frequency programming. See description
 *    for ZB_DP_CHAN_OVRD_EN .
 */
#define ZLL_DUAL_PAN_CTRL_ZB_DP_CHAN_OVRD_SEL(x) (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_ZB_DP_CHAN_OVRD_SEL_SHIFT)) & ZLL_DUAL_PAN_CTRL_ZB_DP_CHAN_OVRD_SEL_MASK)

#define ZLL_DUAL_PAN_CTRL_RECYC_IMMEDIATE_PPME_MASK (0x40U)
#define ZLL_DUAL_PAN_CTRL_RECYC_IMMEDIATE_PPME_SHIFT (6U)
/*! RECYC_IMMEDIATE_PPME - RECYCLE trigger timing for Filterfail_codes generated by PPME 1'b0:
 *    trigger transition to RECYCLE at the end of the packet reception (default) 1'b1: trigger RECYCLE
 *    immediately
 */
#define ZLL_DUAL_PAN_CTRL_RECYC_IMMEDIATE_PPME(x) (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_RECYC_IMMEDIATE_PPME_SHIFT)) & ZLL_DUAL_PAN_CTRL_RECYC_IMMEDIATE_PPME_MASK)

#define ZLL_DUAL_PAN_CTRL_RECYC_IMMEDIATE_PP_MASK (0x80U)
#define ZLL_DUAL_PAN_CTRL_RECYC_IMMEDIATE_PP_SHIFT (7U)
/*! RECYC_IMMEDIATE_PP - RECYCLE trigger timing for Filterfail_codes generated by packet_processor
 *    1'b0: trigger transition to RECYCLE at the end of the packet reception (default) 1'b1: trigger
 *    RECYCLE immediately
 */
#define ZLL_DUAL_PAN_CTRL_RECYC_IMMEDIATE_PP(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_RECYC_IMMEDIATE_PP_SHIFT)) & ZLL_DUAL_PAN_CTRL_RECYC_IMMEDIATE_PP_MASK)

#define ZLL_DUAL_PAN_CTRL_DUAL_PAN_DWELL_MASK    (0xFF00U)
#define ZLL_DUAL_PAN_CTRL_DUAL_PAN_DWELL_SHIFT   (8U)
/*! DUAL_PAN_DWELL - Dual PAN Channel Frequency Dwell Time Channel Frequency Dwell Time. In Auto
 *    Dual PAN mode, hardware will toggle the PAN, after dwelling on the current PAN for the interval
 *    described below (assuming Preamble/SFD not detected). A write to DUAL_PAN_DWELL, always
 *    re-initializes the DWELL TIMER to the programmed value. If a write to DUAL_PAN_DWELL occurs during an
 *    autosequence, the DWELL TIMER will begin counting down immediately. If a write to
 *    DUAL_PAN_DWELL occurs when there is no autosequence underway, the DWELL TIMER will not begin counting
 *    until the next autosequence begins; it will begin counting at the start of the sequence warmup.
 *    DUAL_PAN_DWELL[1:0] select the timebase for the dwell time. There are 4 options:
 *    DUAL_PAN_DWELL[1:0]=0b00 --> TIMEBASE=0.5ms DUAL_PAN_DWELL[1:0]=0b01 --> TIMEBASE=2.5ms
 *    DUAL_PAN_DWELL[1:0]=0b10 --> TIMEBASE=10ms DUAL_PAN_DWELL[1:0]=0b11 --> TIMEBASE=50ms DUAL_PAN_DWELL[7:2] select
 *    how many multiples of the time base to use, from 1 (DUAL_PAN_DWELL[7:2]=0) to 64
 *    (DUAL_PAN_DWELL[7:2]=63). Given those definitions, the table below specifies the minimum and maximum dwell
 *    times for each TIMEBASE option: DUAL_PAN_DWELL[1:0]=0b00 --> MIN_DWELL=0.5ms MAX_DWELL=32ms
 *    DUAL_PAN_DWELL[1:0]=0b01 --> MIN_DWELL=2.5ms MAX_DWELL=160ms DUAL_PAN_DWELL[1:0]=0b10 -->
 *    MIN_DWELL=10ms MAX_DWELL=640ms DUAL_PAN_DWELL[1:0]=0b11 --> MIN_DWELL=50ms MAX_DWELL=3.2seconds A
 *    write to DUAL_PAN_DWELL also causes the value of ACTIVE_NETWORK to get latched into the hardware.
 *    This latched value will be the starting point for the automatic dual-pan mode (i.e., start on
 *    PAN0 or on PAN1). The starting value takes effect immediately (if sequence is underway and
 *    DUAL_PAN_AUTO=1), or is otherwise delayed until sequence starts and DUAL_PAN_AUTO=1.
 */
#define ZLL_DUAL_PAN_CTRL_DUAL_PAN_DWELL(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_DUAL_PAN_DWELL_SHIFT)) & ZLL_DUAL_PAN_CTRL_DUAL_PAN_DWELL_MASK)

#define ZLL_DUAL_PAN_CTRL_DUAL_PAN_REMAIN_MASK   (0x3F0000U)
#define ZLL_DUAL_PAN_CTRL_DUAL_PAN_REMAIN_SHIFT  (16U)
/*! DUAL_PAN_REMAIN - Time Remaining before next PAN switch in auto Dual PAN mode This read-only
 *    register indicates time remaining before next PAN switch in auto Dual PAN mode. The units for
 *    this register, depend on the PRESCALER setting (bits [1:0]) in the DUAL_PAN_DWELL register. Tthe
 *    units are the same as the TIMEBASE determined by the prescaler, as per the following table:
 *    DUAL_PAN_DWELL[1:0]=0b00 (TIMEBASE=0.5ms) DUAL_PAN_REMAIN UNITS=0.5ms DUAL_PAN_DWELL[1:0]=0b01
 *    (TIMEBASE=2.5ms) DUAL_PAN_REMAIN UNITS=2.5ms DUAL_PAN_DWELL[1:0]=0b10 (TIMEBASE=10ms)
 *    DUAL_PAN_REMAIN UNITS=10ms DUAL_PAN_DWELL[1:0]=0b11 (TIMEBASE=50ms) DUAL_PAN_REMAIN UNITS=50ms The
 *    readback value indicates that between N-1 and N timebase units remain until the next PAN switch.
 *    For example, a DUAL_PAN_REMAIN readback value of 3, with a DUAL_PAN_DWELL PRESCALER setting of
 *    2 (10ms), indicates that between 20ms (2*10ms) and 30ms (3*10ms), remain until the next
 *    automatic PAN switch.
 */
#define ZLL_DUAL_PAN_CTRL_DUAL_PAN_REMAIN(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_DUAL_PAN_REMAIN_SHIFT)) & ZLL_DUAL_PAN_CTRL_DUAL_PAN_REMAIN_MASK)

#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN0_MASK      (0x1000000U)
#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN0_SHIFT     (24U)
/*! RECD_ON_PAN0 - Last Packet was Received on PAN0 Indicates the packet which was just received,
 *    was received on PAN0. In Dual PAN mode operating on 2 different channels, RECD_ON_PAN0 will be
 *    set if CURRENT_NETWORK=0 when the packet was received, regardless of FILTERFAIL status. In DUAL
 *    PAN mode operating with same channel on both networks, CURRENT_NETWORK will be ignored and
 *    RECD_ON_PAN0 will be set only if a valid packet was received on PAN0 (PAN0's FILTERFAIL_FLAG is
 *    deasserted). RECD_ON_PAN0 remains valid until the start of the next autoseqeuence.
 */
#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN0(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_RECD_ON_PAN0_SHIFT)) & ZLL_DUAL_PAN_CTRL_RECD_ON_PAN0_MASK)

#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN1_MASK      (0x2000000U)
#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN1_SHIFT     (25U)
/*! RECD_ON_PAN1 - Last Packet was Received on PAN1 Indicates the packet which was just received,
 *    was received on PAN1. In Dual PAN mode operating on 2 different channels, RECD_ON_PAN1 will be
 *    set if CURRENT_NETWORK=1 when the packet was received, regardless of FILTERFAIL status. In DUAL
 *    PAN mode operating with same channel on both networks, CURRENT_NETWORK will be ignored and
 *    RECD_ON_PAN1 will be set only if a valid packet was received on PAN1 (PAN1's FILTERFAIL_FLAG is
 *    deasserted). RECD_ON_PAN1 remains valid until the start of the next autoseqeuence.
 */
#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN1(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_RECD_ON_PAN1_SHIFT)) & ZLL_DUAL_PAN_CTRL_RECD_ON_PAN1_MASK)

#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN0_EARLY_MASK (0x10000000U)
#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN0_EARLY_SHIFT (28U)
/*! RECD_ON_PAN0_EARLY - Current packet is Received on PAN0, early indication. The early indication
 *    is evaluated when packet_processor or PPME have finished the addresses and/or PANId matching
 *    check on the incomming packet. The status of RECD_ON_PAN0_EARLY is valid if
 *    RECD_ON_PAN_EARLY_STS = 1'b1. Indicates the packet which was just received, was received on PAN0. In Dual PAN
 *    mode operating on 2 different channels, RECD_ON_PAN0_EARLY will be set if CURRENT_NETWORK=0 when
 *    the address or PANId matching was processed, regardless of FILTERFAIL status. In DUAL PAN mode
 *    operating with same channel on both networks, CURRENT_NETWORK will be ignored and
 *    RECD_ON_PAN0_EARLY will be set only if a valid packet was received on PAN0 (PAN0's FILTERFAIL_FLAG is
 *    deasserted). RECD_ON_PAN0_EARLY remains valid until the start of the next autoseqeuence.
 */
#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN0_EARLY(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_RECD_ON_PAN0_EARLY_SHIFT)) & ZLL_DUAL_PAN_CTRL_RECD_ON_PAN0_EARLY_MASK)

#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN1_EARLY_MASK (0x20000000U)
#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN1_EARLY_SHIFT (29U)
/*! RECD_ON_PAN1_EARLY - Current packet is Received on PAN1, early indication. The early indication
 *    is evaluated when packet_processor or PPME have finished the addresses and/or PANId matching
 *    check on the incomming packet. The status of RECD_ON_PAN1_EARLY is valid if
 *    RECD_ON_PAN_EARLY_STS = 1'b1. Indicates the packet which was just received, was received on PAN1. In Dual PAN
 *    mode operating on 2 different channels, RECD_ON_PAN1_EARLY will be set if CURRENT_NETWORK=0 when
 *    the address or PANId matching was processed, regardless of FILTERFAIL status. In DUAL PAN mode
 *    operating with same channel on both networks, CURRENT_NETWORK will be ignored and
 *    RECD_ON_PAN1_EARLY will be set only if a valid packet was received on PAN1 (PAN1's FILTERFAIL_FLAG is
 *    deasserted). RECD_ON_PAN1_EARLY remains valid until the start of the next autoseqeuence.
 */
#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN1_EARLY(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_RECD_ON_PAN1_EARLY_SHIFT)) & ZLL_DUAL_PAN_CTRL_RECD_ON_PAN1_EARLY_MASK)

