zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN_EARLY_STS_MASK (0x40000000U)
#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN_EARLY_STS_SHIFT (30U)
/*! RECD_ON_PAN_EARLY_STS - Status flag. Indicates that for the current packet address and PANId
 *    checks are processed and that RECD_ON_PAN0_EARLY and RECD_ON_PAN1_EARLY have been evaluated and
 *    valid. For packet types that are supported for the second stage of packet filtering of the
 *    packet_processor - which includes matching checks on Address and PANId fields of the Packet header
 *    - this is at the end of receiving the packet header fields. For packet-types for which the
 *    packet_processor does not support the address and PanID fiels checks, PPME can be used for
 *    "second stage" filtering. For those PP-unsupported packets, the RECD_ON_PAN_EARLY status is set if
 *    PPME filtering has been processed, i.e as soon as the matching process has finished (either
 *    resulting in a match or no-match indication).
 */
#define ZLL_DUAL_PAN_CTRL_RECD_ON_PAN_EARLY_STS(x) (((uint32_t)(((uint32_t)(x)) << ZLL_DUAL_PAN_CTRL_RECD_ON_PAN_EARLY_STS_SHIFT)) & ZLL_DUAL_PAN_CTRL_RECD_ON_PAN_EARLY_STS_MASK)
/*! @} */

/*! @name CHANNEL_NUM1 - CHANNEL NUMBER 1 (CHANNEL_NUM1) */
/*! @{ */

#define ZLL_CHANNEL_NUM1_CHANNEL_NUM1_MASK       (0x7FU)
#define ZLL_CHANNEL_NUM1_CHANNEL_NUM1_SHIFT      (0U)
/*! CHANNEL_NUM1 - Channel Number for PAN1 This is the mapped channel number used to transmit and
 *    receive Zigbee packets. This register applies to PAN1 only. CHANNEL_NUM1 should be in the range:
 *    11 <= CHANNEL_NUM1 <= 26 Note : This register should not be programmed, and left in its
 *    default state, if Dual PAN mode is not in use.
 */
#define ZLL_CHANNEL_NUM1_CHANNEL_NUM1(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_CHANNEL_NUM1_CHANNEL_NUM1_SHIFT)) & ZLL_CHANNEL_NUM1_CHANNEL_NUM1_MASK)

#define ZLL_CHANNEL_NUM1_TEMP_MACSHORTADDRS1_MASK (0xFFFF00U)
#define ZLL_CHANNEL_NUM1_TEMP_MACSHORTADDRS1_SHIFT (8U)
/*! TEMP_MACSHORTADDRS1 - TEMPORARY MAC SHORT ADDRESS for PAN1 DURING TRANSITION FROM CHILD TO PARENT AND VICE-VERSA */
#define ZLL_CHANNEL_NUM1_TEMP_MACSHORTADDRS1(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_CHANNEL_NUM1_TEMP_MACSHORTADDRS1_SHIFT)) & ZLL_CHANNEL_NUM1_TEMP_MACSHORTADDRS1_MASK)

#define ZLL_CHANNEL_NUM1_TEMP_SHORTADDRS_EN1_MASK (0x1000000U)
#define ZLL_CHANNEL_NUM1_TEMP_SHORTADDRS_EN1_SHIFT (24U)
/*! TEMP_SHORTADDRS_EN1 - When asserted Packet Processor will accept the packets with MACSHORTADDRS1
 *    and TEMP_MACSHORTADDRS1 during transition of the device. When de-asserted Packet Processor
 *    will accept only the packets with MACSHORTADDRS1
 */
#define ZLL_CHANNEL_NUM1_TEMP_SHORTADDRS_EN1(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_CHANNEL_NUM1_TEMP_SHORTADDRS_EN1_SHIFT)) & ZLL_CHANNEL_NUM1_TEMP_SHORTADDRS_EN1_MASK)
/*! @} */

/*! @name SAM_CTRL - SAM CONTROL (SAM_CTRL)Source Address Management Control Register */
/*! @{ */

#define ZLL_SAM_CTRL_SAP0_EN_MASK                (0x1U)
#define ZLL_SAM_CTRL_SAP0_EN_SHIFT               (0U)
/*! SAP0_EN - Enables SAP0 Partition of the SAM Table 0x0,Disables SAP0 Partition, 0x1,Enables SAP0 Partition */
#define ZLL_SAM_CTRL_SAP0_EN(x)                  (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_CTRL_SAP0_EN_SHIFT)) & ZLL_SAM_CTRL_SAP0_EN_MASK)

#define ZLL_SAM_CTRL_SAA0_EN_MASK                (0x2U)
#define ZLL_SAM_CTRL_SAA0_EN_SHIFT               (1U)
/*! SAA0_EN - Enables SAA0 Partition of the SAM Table 0x0,Disables SAA0 Partition, 0x1,Enables SAA0 Partition */
#define ZLL_SAM_CTRL_SAA0_EN(x)                  (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_CTRL_SAA0_EN_SHIFT)) & ZLL_SAM_CTRL_SAA0_EN_MASK)

#define ZLL_SAM_CTRL_SAP1_EN_MASK                (0x4U)
#define ZLL_SAM_CTRL_SAP1_EN_SHIFT               (2U)
/*! SAP1_EN - Enables SAP1 Partition of the SAM Table 0x0,Disables SAP1 Partition, 0x1,Enables SAP1 Partition */
#define ZLL_SAM_CTRL_SAP1_EN(x)                  (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_CTRL_SAP1_EN_SHIFT)) & ZLL_SAM_CTRL_SAP1_EN_MASK)

#define ZLL_SAM_CTRL_SAA1_EN_MASK                (0x8U)
#define ZLL_SAM_CTRL_SAA1_EN_SHIFT               (3U)
/*! SAA1_EN - Enables SAA1 Partition of the SAM Table 0x0,Disables SAA1 Partition, 0x1,Enables SAA1 Partition */
#define ZLL_SAM_CTRL_SAA1_EN(x)                  (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_CTRL_SAA1_EN_SHIFT)) & ZLL_SAM_CTRL_SAA1_EN_MASK)

#define ZLL_SAM_CTRL_ENABLE_FV1_DATA_PKT_IND_MASK (0x10U)
#define ZLL_SAM_CTRL_ENABLE_FV1_DATA_PKT_IND_SHIFT (4U)
/*! ENABLE_FV1_DATA_PKT_IND - Enables HW Frame Pending calculation for Frame Version 1 Data Packets
 *    for PAN0 0x0,Disables HW Frame Pending calculation for Frame Version 1 Data Packet,
 *    0x1,Enables HW Frame Pending calculation for Frame Version 1 Data Packet
 */
#define ZLL_SAM_CTRL_ENABLE_FV1_DATA_PKT_IND(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_CTRL_ENABLE_FV1_DATA_PKT_IND_SHIFT)) & ZLL_SAM_CTRL_ENABLE_FV1_DATA_PKT_IND_MASK)

#define ZLL_SAM_CTRL_FV1_DATA_PKT_IND_MASK       (0x20U)
#define ZLL_SAM_CTRL_FV1_DATA_PKT_IND_SHIFT      (5U)
/*! FV1_DATA_PKT_IND - Data Packet Indication for Frame Version 1 packet (valid only when
 *    ENABLE_FV1_DATA_PKT_IND is set) 0x0,Data Packet Indication not received, 0x1,Data Packet Indication
 *    received
 */
#define ZLL_SAM_CTRL_FV1_DATA_PKT_IND(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_CTRL_FV1_DATA_PKT_IND_SHIFT)) & ZLL_SAM_CTRL_FV1_DATA_PKT_IND_MASK)

#define ZLL_SAM_CTRL_ENABLE_FV1_DATA_PKT_IND_PAN1_MASK (0x40U)
#define ZLL_SAM_CTRL_ENABLE_FV1_DATA_PKT_IND_PAN1_SHIFT (6U)
/*! ENABLE_FV1_DATA_PKT_IND_PAN1 - Enables HW Frame Pending calculation for Frame Version 1 Data
 *    Packets for PAN1 0x0,Disables HW Frame Pending calculation for Frame Version 1 Data Packet,
 *    0x1,Enables HW Frame Pending calculation for Frame Version 1 Data Packet
 */
#define ZLL_SAM_CTRL_ENABLE_FV1_DATA_PKT_IND_PAN1(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_CTRL_ENABLE_FV1_DATA_PKT_IND_PAN1_SHIFT)) & ZLL_SAM_CTRL_ENABLE_FV1_DATA_PKT_IND_PAN1_MASK)

#define ZLL_SAM_CTRL_SAA0_START_MASK             (0xFF00U)
#define ZLL_SAM_CTRL_SAA0_START_SHIFT            (8U)
/*! SAA0_START - First Index of SAA0 partition The reset value is 0x40 for SAM size = 128 The reset value is 0x80 for SAM size = 256 */
#define ZLL_SAM_CTRL_SAA0_START(x)               (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_CTRL_SAA0_START_SHIFT)) & ZLL_SAM_CTRL_SAA0_START_MASK)

#define ZLL_SAM_CTRL_SAP1_START_MASK             (0xFF0000U)
#define ZLL_SAM_CTRL_SAP1_START_SHIFT            (16U)
/*! SAP1_START - First Index of SAP1 partition */
#define ZLL_SAM_CTRL_SAP1_START(x)               (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_CTRL_SAP1_START_SHIFT)) & ZLL_SAM_CTRL_SAP1_START_MASK)

#define ZLL_SAM_CTRL_SAA1_START_MASK             (0xFF000000U)
#define ZLL_SAM_CTRL_SAA1_START_SHIFT            (24U)
/*! SAA1_START - First Index of SAA1 partition */
#define ZLL_SAM_CTRL_SAA1_START(x)               (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_CTRL_SAA1_START_SHIFT)) & ZLL_SAM_CTRL_SAA1_START_MASK)
/*! @} */

/*! @name SAM_TABLE - SOURCE ADDRESS MANAGEMENT TABLE (SAM_TABLE)Source Address Management Table */
/*! @{ */

#define ZLL_SAM_TABLE_SAM_INDEX_MASK             (0xFFU)
#define ZLL_SAM_TABLE_SAM_INDEX_SHIFT            (0U)
/*! SAM_INDEX - Contains the SAM table index to be enabled or invalidated Contains the table index
 *    to be enabled or invalidated. Software must ensure that the index is within the range of the
 *    desired partition.
 */
#define ZLL_SAM_TABLE_SAM_INDEX(x)               (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_TABLE_SAM_INDEX_SHIFT)) & ZLL_SAM_TABLE_SAM_INDEX_MASK)

#define ZLL_SAM_TABLE_SAM_CHECKSUM_MASK          (0xFFFF00U)
#define ZLL_SAM_TABLE_SAM_CHECKSUM_SHIFT         (8U)
/*! SAM_CHECKSUM - Software-computed source address checksum, to be installed into a table index
 *    Software-computed source address checksum, to be installed into a table index. The value on
 *    SAM_CHECKSUM[15:0] can be installed into the table with a single, atomic 32-bit write; in that
 *    case, the write data would contain the desired SAM_INDEX[6:0] and SAM_CHECKSUM[15:0], and
 *    SAM_INDEX_WR=1. If SAM_INDEX_WR=0, then the SAM_INDEX[6:0] register is written, but the checksum is
 *    not written to the table. The readback value of SAM_CHECKSUM[15:0] is the contents of the SAM
 *    Table at the location pointed to by SAM_INDEX[6:0]. To readback from a specific table index,
 *    software should first write the desired index to SAM_INDEX[6:0], and then read back the checksum
 *    from the table on SAM_CHECKSUM[15:0].
 */
#define ZLL_SAM_TABLE_SAM_CHECKSUM(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_TABLE_SAM_CHECKSUM_SHIFT)) & ZLL_SAM_TABLE_SAM_CHECKSUM_MASK)

#define ZLL_SAM_TABLE_SAM_INDEX_INV_MASK         (0x1000000U)
#define ZLL_SAM_TABLE_SAM_INDEX_INV_SHIFT        (24U)
/*! SAM_INDEX_INV - Invalidate the SAM table index selected by SAM_INDEX */
#define ZLL_SAM_TABLE_SAM_INDEX_INV(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_TABLE_SAM_INDEX_INV_SHIFT)) & ZLL_SAM_TABLE_SAM_INDEX_INV_MASK)

