zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
/*! @name SEQ_CTRL_STS - SEQUENCE CONTROL AND STATUS (SEQ_CTRL_STS) */
/*! @{ */

#define ZLL_SEQ_CTRL_STS_FORCE_CLK_ON_MASK       (0x2U)
#define ZLL_SEQ_CTRL_STS_FORCE_CLK_ON_SHIFT      (1U)
/*! FORCE_CLK_ON - Force On 802.15.4 phy_gck Force On 802.15.4 phy_gck 0x0,Allow TSM to control
 *    802.15.4 phy_gck, for minimum power consumption, (default) 0x1,Force on 802.15.4 phy_gclk at all
 *    times, for debug purposes only
 */
#define ZLL_SEQ_CTRL_STS_FORCE_CLK_ON(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_FORCE_CLK_ON_SHIFT)) & ZLL_SEQ_CTRL_STS_FORCE_CLK_ON_MASK)

#define ZLL_SEQ_CTRL_STS_CLR_NEW_SEQ_INHIBIT_MASK (0x4U)
#define ZLL_SEQ_CTRL_STS_CLR_NEW_SEQ_INHIBIT_SHIFT (2U)
/*! CLR_NEW_SEQ_INHIBIT - Overrides the automatic hardware locking of the programmed XCVSEQ while an
 *    autosequence is underway when asserted, overrides the automatic hardware locking of the
 *    programmed XCVSEQ while an autosequence is underway. Asserting this feature will allow software to
 *    change the programmed autosequence on-the-fly, without aborting and returning to idle between
 *    sequences. Overriding the hardware lockout of XCVSEQ should be used with caution, since the
 *    Sequence Manager is not designed (or verified) for manual state transitions between one type of
 *    autosequence and other (i.e., Sequence T -> Sequence R).
 */
#define ZLL_SEQ_CTRL_STS_CLR_NEW_SEQ_INHIBIT(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_CLR_NEW_SEQ_INHIBIT_SHIFT)) & ZLL_SEQ_CTRL_STS_CLR_NEW_SEQ_INHIBIT_MASK)

#define ZLL_SEQ_CTRL_STS_EVENT_TMR_DO_NOT_LATCH_MASK (0x8U)
#define ZLL_SEQ_CTRL_STS_EVENT_TMR_DO_NOT_LATCH_SHIFT (3U)
/*! EVENT_TMR_DO_NOT_LATCH - Overrides the automatic hardware latching of the Event Timer when
 *    asserted, overrides the automatic hardware latching of the Event Timer that prevents the timer from
 *    updating while software reads the 3 Event Timer bytes. This allows the Event Timer LS byte to
 *    continue to update without reading the upper 2 bytes. Overriding the automatic latching of
 *    the Event Timer should be used with caution, as it can allow the Event Timer lower bytes to get
 *    out-of-sync with the upper bytes. However, it can be useful when polling the Event Timer LS
 *    byte for a value that is just a few counts in the future.
 */
#define ZLL_SEQ_CTRL_STS_EVENT_TMR_DO_NOT_LATCH(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_EVENT_TMR_DO_NOT_LATCH_SHIFT)) & ZLL_SEQ_CTRL_STS_EVENT_TMR_DO_NOT_LATCH_MASK)

#define ZLL_SEQ_CTRL_STS_LATCH_PREAMBLE_MASK     (0x10U)
#define ZLL_SEQ_CTRL_STS_LATCH_PREAMBLE_SHIFT    (4U)
/*! LATCH_PREAMBLE - Stickiness Control for Preamble Detection 0x0,Don't make PREAMBLE_DET and
 *    SFD_DET bits of PHY_STS (SEQ_STATE), Register sticky, i.e, these status bits reflect the realtime,
 *    dynamic state of preamble_detect and sfd_detect 0x1,Make PREAMBLE_DET and SFD_DET bits of
 *    PHY_STS (SEQ_STATE) Register, sticky, i.e., occurrences of preamble and SFD detection are latched
 *    and held until the start of the next autosequence
 */
#define ZLL_SEQ_CTRL_STS_LATCH_PREAMBLE(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_LATCH_PREAMBLE_SHIFT)) & ZLL_SEQ_CTRL_STS_LATCH_PREAMBLE_MASK)

#define ZLL_SEQ_CTRL_STS_NO_RX_RECYCLE_MASK      (0x20U)
#define ZLL_SEQ_CTRL_STS_NO_RX_RECYCLE_SHIFT     (5U)
/*! NO_RX_RECYCLE - Disable Automatic RX Sequence Recycling when asserted, prevents the Zigbee
 *    Sequence Manager (ZSM) from automatically re-starting (recycling) the receiver when a packet is
 *    received which results in a FilterFail or CRC failure. Normally, on a RX recycle, the ZSM returns
 *    to the RX_WU (warmup) state, and then resumes from there with a new, foreshortened, Rx
 *    warmup, in search of a new preamble. When this bit is set, the Sequence Manager will instead return
 *    to idle state, and issue a SEQIRQ, after a FilterFail or CRC failure.
 */
#define ZLL_SEQ_CTRL_STS_NO_RX_RECYCLE(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_NO_RX_RECYCLE_SHIFT)) & ZLL_SEQ_CTRL_STS_NO_RX_RECYCLE_MASK)

#define ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_MASK    (0x40U)
#define ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_SHIFT   (6U)
/*! FORCE_CRC_ERROR - Induce a CRC Error in Transmitted Packets 0x0,normal operation, 0x1,Force the
 *    next transmitted packet to have a CRC error
 */
#define ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_SHIFT)) & ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_MASK)

#define ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_MASK      (0x80U)
#define ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_SHIFT     (7U)
/*! CONTINUOUS_EN - Enable Continuous TX or RX Mode Continuous Mode Enable (Continuous TX or RX).
 *    Note: Dual PAN mode should not be engaged in Continuous TX or RX modes. 0x0,normal operation,
 *    0x1,Continuous TX or RX mode is enabled (depending on XCVSEQ setting).
 */
#define ZLL_SEQ_CTRL_STS_CONTINUOUS_EN(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_SHIFT)) & ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_MASK)

#define ZLL_SEQ_CTRL_STS_XCVSEQ_ACTUAL_MASK      (0x700U)
#define ZLL_SEQ_CTRL_STS_XCVSEQ_ACTUAL_SHIFT     (8U)
/*! XCVSEQ_ACTUAL - Indicates the programmed sequence that has been recognized by the ZSM Sequence
 *    Manager Reflects the programmed sequence that has been recognized by the Zigbee Sequence
 *    Manager. Takes into account the fact that sequence-change commands from software are ignored while a
 *    sequence is underway (see NEW_SEQ_INHIBIT). Read-only bits.
 */
#define ZLL_SEQ_CTRL_STS_XCVSEQ_ACTUAL(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_XCVSEQ_ACTUAL_SHIFT)) & ZLL_SEQ_CTRL_STS_XCVSEQ_ACTUAL_MASK)

#define ZLL_SEQ_CTRL_STS_SEQ_IDLE_MASK           (0x800U)
#define ZLL_SEQ_CTRL_STS_SEQ_IDLE_SHIFT          (11U)
/*! SEQ_IDLE - ZSM Sequence Idle Indicator */
#define ZLL_SEQ_CTRL_STS_SEQ_IDLE(x)             (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_SEQ_IDLE_SHIFT)) & ZLL_SEQ_CTRL_STS_SEQ_IDLE_MASK)

