zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_SEQ_CTRL_STS_NEW_SEQ_INHIBIT_MASK    (0x1000U)
#define ZLL_SEQ_CTRL_STS_NEW_SEQ_INHIBIT_SHIFT   (12U)
/*! NEW_SEQ_INHIBIT - New Sequence Inhibit When asserted, indicates that a new programmed
 *    autosequence has commenced (TMR2 match has occurred if TMRTRIGEN=1). Once this bit is asserted, software
 *    is blocked from commanding any new autosequences (other than Sequence I to abort the current
 *    sequence), until the current sequence completes. Hardware will ignore a sequence-change
 *    command from software while this bit is asserted. Hardware will automatically deassert this bit once
 *    the sequence completes. Read-only bit.
 */
#define ZLL_SEQ_CTRL_STS_NEW_SEQ_INHIBIT(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_NEW_SEQ_INHIBIT_SHIFT)) & ZLL_SEQ_CTRL_STS_NEW_SEQ_INHIBIT_MASK)

#define ZLL_SEQ_CTRL_STS_RX_TIMEOUT_PENDING_MASK (0x2000U)
#define ZLL_SEQ_CTRL_STS_RX_TIMEOUT_PENDING_SHIFT (13U)
/*! RX_TIMEOUT_PENDING - Indicates a TMR3 RX Timeout is Pending when asserted, indicates that a TMR3
 *    timeout (RX timeout) flag has been set by Hardware, but the Sequence Manager has not yet
 *    aborted because an RX operation is not currently underway. This would be the case, for example,
 *    during a Sequence TR, if a TMR3 timeout were to occur during the transmit operation of this
 *    sequence; the sequence would not be aborted by Hardware until the receive operation begins. This
 *    bit will always be 0 if TC3TMOUT=0. Read-only bit.
 */
#define ZLL_SEQ_CTRL_STS_RX_TIMEOUT_PENDING(x)   (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_RX_TIMEOUT_PENDING_SHIFT)) & ZLL_SEQ_CTRL_STS_RX_TIMEOUT_PENDING_MASK)

#define ZLL_SEQ_CTRL_STS_RX_MODE_MASK            (0x4000U)
#define ZLL_SEQ_CTRL_STS_RX_MODE_SHIFT           (14U)
/*! RX_MODE - RX Operation in Progress when asserted, this Sequence Manager Output indicates that an
 *    RX operation is in progress. An RX operation can be part of a complex transmit autosequence
 *    such as a Sequence TR. CCA and ED operations are considered RX operations, during which RX_MODE
 *    is asserted. Read-only bit.
 */
#define ZLL_SEQ_CTRL_STS_RX_MODE(x)              (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_RX_MODE_SHIFT)) & ZLL_SEQ_CTRL_STS_RX_MODE_MASK)

#define ZLL_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED_MASK (0x8000U)
#define ZLL_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED_SHIFT (15U)
/*! TMR2_SEQ_TRIG_ARMED - indicates that TMR2 has been programmed and is armed to trigger a new
 *    autosequence when asserted, indicates that TMR2 has been programmed and is armed to trigger a new
 *    autosequence, when Zigbee Sequence Manager timer-triggering mode is selected (i.e.,
 *    TMRTRIGEN=1). When timer-triggering mode is selected, TMR2 must be re-programmed (using either T2CMP or
 *    T2PRIMECMP), in advance of each new sequence. Once TMR2 is programmed, this bit will be
 *    asserted, and will remain asserted until the new sequence commences (at TMR2 match). Hardware will
 *    deassert this bit when the new sequence starts. When TMRTRIGEN=0, this bit should be ignored.
 *    Read-only bit.
 */
#define ZLL_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED_SHIFT)) & ZLL_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED_MASK)

#define ZLL_SEQ_CTRL_STS_SEQ_T_STATUS_MASK       (0x3F0000U)
#define ZLL_SEQ_CTRL_STS_SEQ_T_STATUS_SHIFT      (16U)
/*! SEQ_T_STATUS - Status of the just-completed or ongoing Sequence T or Sequence TR Status of the
 *    just-completed (or ongoing) Sequence T or Sequence TR autosequence. This register is valid at
 *    all times during, and after, the Sequence T or Sequence TR. Not valid for other types of
 *    autosequences. This is a read-only register. The bits of this register map to status, according to
 *    the following table: [0] 1st CCA complete (CCABFRTX=1) [1] 2nd CCA complete (SLOTTED=1) [2] Tx
 *    operation complete [3] Rx Recycle occurred (Sequence TR only) [4] Rx operation complete
 *    (Sequence TR only) [5] TxAck operation complete(Sequence TR only)
 */
#define ZLL_SEQ_CTRL_STS_SEQ_T_STATUS(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_SEQ_T_STATUS_SHIFT)) & ZLL_SEQ_CTRL_STS_SEQ_T_STATUS_MASK)

#define ZLL_SEQ_CTRL_STS_SW_ABORTED_MASK         (0x1000000U)
#define ZLL_SEQ_CTRL_STS_SW_ABORTED_SHIFT        (24U)
/*! SW_ABORTED - Autosequence has terminated due to a Software abort. when asserted, indicates that
 *    the autosequence has terminated due to an Software abort. Software can abort any programmed
 *    autosequence by writing Sequence I to XCVSEQ. This bit is valid at the SEQIRQ interrupt.
 *    Hardware will maintain this bit asserted until the next autosequence commences. Read-only bit.
 */
#define ZLL_SEQ_CTRL_STS_SW_ABORTED(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_SW_ABORTED_SHIFT)) & ZLL_SEQ_CTRL_STS_SW_ABORTED_MASK)

#define ZLL_SEQ_CTRL_STS_TC3_ABORTED_MASK        (0x2000000U)
#define ZLL_SEQ_CTRL_STS_TC3_ABORTED_SHIFT       (25U)
/*! TC3_ABORTED - autosequence has terminated due to an TMR3 timeout when asserted, indicates that
 *    the autosequence has terminated due to an TC3 (TMR3) timeout during a receive operation. This
 *    bit is valid at the SEQIRQ interrupt. Hardware will maintain this bit asserted until the next
 *    autosequence commences. Read-only bit.
 */
#define ZLL_SEQ_CTRL_STS_TC3_ABORTED(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_TC3_ABORTED_SHIFT)) & ZLL_SEQ_CTRL_STS_TC3_ABORTED_MASK)

#define ZLL_SEQ_CTRL_STS_PLL_ABORTED_MASK        (0x4000000U)
#define ZLL_SEQ_CTRL_STS_PLL_ABORTED_SHIFT       (26U)
/*! PLL_ABORTED - Autosequence has terminated due to an PLL unlock event when asserted, indicates
 *    that the autosequence has terminated due to an PLL unlock event. This bit is valid at the SEQIRQ
 *    interrupt. Hardware will maintain this bit asserted until the next autosequence commences.
 *    Read-only bit.
 */
#define ZLL_SEQ_CTRL_STS_PLL_ABORTED(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_PLL_ABORTED_SHIFT)) & ZLL_SEQ_CTRL_STS_PLL_ABORTED_MASK)

#define ZLL_SEQ_CTRL_STS_EXT_ABORTED_MASK        (0x8000000U)
#define ZLL_SEQ_CTRL_STS_EXT_ABORTED_SHIFT       (27U)
/*! EXT_ABORTED - Autosequence has terminated due to a Wake-On-Radio command when asserted,
 *    indicates that the autosequence has terminated due to an external event, such as a Wake-On-Radio stop
 *    command. This bit is valid at the SEQIRQ interrupt. Hardware will maintain this bit asserted
 *    until the next autosequence commences. Read-only bit.
 */
#define ZLL_SEQ_CTRL_STS_EXT_ABORTED(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_EXT_ABORTED_SHIFT)) & ZLL_SEQ_CTRL_STS_EXT_ABORTED_MASK)

#define ZLL_SEQ_CTRL_STS_ARB_GRANT_DEASSERTION_ABORTED_MASK (0x10000000U)
#define ZLL_SEQ_CTRL_STS_ARB_GRANT_DEASSERTION_ABORTED_SHIFT (28U)
/*! ARB_GRANT_DEASSERTION_ABORTED - Autosequence has terminated due to an arb_grant deassertion
 *    event when asserted, indicates that the autosequence has terminated due to an arb_grant
 *    deassertion event. This bit is valid at the SEQIRQ interrupt. Hardware will maintain this bit asserted
 *    until the next autosequence commences. Read-only bit.
 */
#define ZLL_SEQ_CTRL_STS_ARB_GRANT_DEASSERTION_ABORTED(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_CTRL_STS_ARB_GRANT_DEASSERTION_ABORTED_SHIFT)) & ZLL_SEQ_CTRL_STS_ARB_GRANT_DEASSERTION_ABORTED_MASK)
/*! @} */

/*! @name ACKDELAY - ACK DELAY (ACKDELAY)Provides a fine-tune adjustment of the time delay between Rx warmdownand the beginning of Tx warmup for an autoTxAck packet. */
/*! @{ */

#define ZLL_ACKDELAY_ACKDELAY_MASK               (0x7FU)
#define ZLL_ACKDELAY_ACKDELAY_SHIFT              (0U)
/*! ACKDELAY - ACK Delay Provides a fine-tune adjustment of the time delay between Rx warmdown and
 *    the beginning of Tx warmup for an Tx Acknowledge packet. ACKDELAY register will apply to both
 *    SLOTTED and UNSLOTTED TxAck, but only to TxAck (not T sequences). This is a two's complement
 *    value. Resolution = 2us. Range = -128 - 126us. Max ACKDELAY = 0x3F. Min ACKDELAY = 0x40.
 */
#define ZLL_ACKDELAY_ACKDELAY(x)                 (((uint32_t)(((uint32_t)(x)) << ZLL_ACKDELAY_ACKDELAY_SHIFT)) & ZLL_ACKDELAY_ACKDELAY_MASK)

#define ZLL_ACKDELAY_TXDELAY_MASK                (0x3F00U)
#define ZLL_ACKDELAY_TXDELAY_SHIFT               (8U)
/*! TXDELAY - TX Delay Provides a fine-tune adjustment of the time delay between post-CCA Rx
 *    warm-down and the beginning of Tx warm-up for an Tx (non-Ack) packet. TXDELAY register will apply in
 *    both SLOTTED and UNSLOTTED modes, but only to T sequences (e.g., T, TR, and T(R) ), not TxAck
 *    operations. This is a two's complement value. The minimum permissible value is -19 (0x2D).
 *    Values less than -19 will lead to unexpected results. Resolution = 2us. Range = +/- 62us. Max
 *    TXDELAY = 0x1F. Min TXDELAY = 0x2D.
 */
#define ZLL_ACKDELAY_TXDELAY(x)                  (((uint32_t)(((uint32_t)(x)) << ZLL_ACKDELAY_TXDELAY_SHIFT)) & ZLL_ACKDELAY_TXDELAY_MASK)

