zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_ACKDELAY_RXDELAY_MASK                (0x3F0000U)
#define ZLL_ACKDELAY_RXDELAY_SHIFT               (16U)
/*! RXDELAY - RX Delay Provides a fine-tune adjustment of the time delay between Tx warmdown and the
 *    beginning of Rx warmup for TR sequence. RXDELAY register will apply to both SLOTTED and
 *    UNSLOTTED TR sequence. This is an unsigned value. Resolution = 2us. Range = 3 - 127us. Max RXDELAY
 *    = 0x3F. Min RXDELAY = 0x01.
 */
#define ZLL_ACKDELAY_RXDELAY(x)                  (((uint32_t)(((uint32_t)(x)) << ZLL_ACKDELAY_RXDELAY_SHIFT)) & ZLL_ACKDELAY_RXDELAY_MASK)

#define ZLL_ACKDELAY_FAST_TX_WD_EN_MASK          (0x1000000U)
#define ZLL_ACKDELAY_FAST_TX_WD_EN_SHIFT         (24U)
/*! FAST_TX_WD_EN - Fast TX_WD enable/disable When this bit is enabled, the Zigbee squence manager
 *    executes the fast TX warmdown sequence by bypassing TX_PA_OFF and XTAL_CLK1 and jumping from
 *    TX_WD to TSM_WD directly. 0x0,Disable fast Tx warmdown sequence., 0x1,Enable fast Tx warmdown
 *    sequence.
 */
#define ZLL_ACKDELAY_FAST_TX_WD_EN(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_ACKDELAY_FAST_TX_WD_EN_SHIFT)) & ZLL_ACKDELAY_FAST_TX_WD_EN_MASK)

#define ZLL_ACKDELAY_FAST_TX_WD_DELAY_MASK       (0x6000000U)
#define ZLL_ACKDELAY_FAST_TX_WD_DELAY_SHIFT      (25U)
/*! FAST_TX_WD_DELAY - FAST_TX_WD_DELAY Provides a fine-tune adjustment of the time delay from the
 *    beginning of Tx warmdown to the end of Tx warmdown when FAST_TX_WD_EN is set to 1.
 */
#define ZLL_ACKDELAY_FAST_TX_WD_DELAY(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_ACKDELAY_FAST_TX_WD_DELAY_SHIFT)) & ZLL_ACKDELAY_FAST_TX_WD_DELAY_MASK)
/*! @} */

/*! @name FILTERFAIL_CODE - FILTER FAIL CODE (FILTERFAIL_CODE) */
/*! @{ */

#define ZLL_FILTERFAIL_CODE_PP_FILTERFAIL_CODE_MASK (0x3FFU)
#define ZLL_FILTERFAIL_CODE_PP_FILTERFAIL_CODE_SHIFT (0U)
/*! PP_FILTERFAIL_CODE - Filter Fail Code, packet_processor Code indicating what condition, or
 *    conditions, caused the Packet Processor to reject the just-received packet. The bits of
 *    FILTERFAIL_CODE indicate the reason for packet rejection. For a description of the individual
 *    FILTERFAIL_CODE bits, see the 802.15.4 Link Layer Controller chapter.
 */
#define ZLL_FILTERFAIL_CODE_PP_FILTERFAIL_CODE(x) (((uint32_t)(((uint32_t)(x)) << ZLL_FILTERFAIL_CODE_PP_FILTERFAIL_CODE_SHIFT)) & ZLL_FILTERFAIL_CODE_PP_FILTERFAIL_CODE_MASK)

#define ZLL_FILTERFAIL_CODE_PPME_FILTERFAIL_CODE_MASK (0xC00U)
#define ZLL_FILTERFAIL_CODE_PPME_FILTERFAIL_CODE_SHIFT (10U)
/*! PPME_FILTERFAIL_CODE - Filter Fail Code, Programmable Packet Filter Matching Engine (PPME) */
#define ZLL_FILTERFAIL_CODE_PPME_FILTERFAIL_CODE(x) (((uint32_t)(((uint32_t)(x)) << ZLL_FILTERFAIL_CODE_PPME_FILTERFAIL_CODE_SHIFT)) & ZLL_FILTERFAIL_CODE_PPME_FILTERFAIL_CODE_MASK)

#define ZLL_FILTERFAIL_CODE_FILTERFAIL_CODE_RAW_SEL_MASK (0x4000U)
#define ZLL_FILTERFAIL_CODE_FILTERFAIL_CODE_RAW_SEL_SHIFT (14U)
/*! FILTERFAIL_CODE_RAW_SEL - Select PP_FILTERFAIL_CODE before or after filtering by PROMISCOUS,
 *    Applied to PAN0 and PAN1 FILTERFAIL_CODES of the packet_processor (not relevant for
 *    PPME_FILTERFAIL_CODE) 1'b0: PP_FILTERFAIL_CODE after PROMISCUOUS filtering 1'b1: PP_FILTERFAIL_CODE before
 *    PROMISCOUS fitlering
 */
#define ZLL_FILTERFAIL_CODE_FILTERFAIL_CODE_RAW_SEL(x) (((uint32_t)(((uint32_t)(x)) << ZLL_FILTERFAIL_CODE_FILTERFAIL_CODE_RAW_SEL_SHIFT)) & ZLL_FILTERFAIL_CODE_FILTERFAIL_CODE_RAW_SEL_MASK)

#define ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_MASK (0x8000U)
#define ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_SHIFT (15U)
/*! FILTERFAIL_PAN_SEL - PAN Selector for Filter Fail Code 0x0,{ PPME_FILTERFAIL_CODE[1:0],
 *    PP_FILTERFAIL_CODE[9:0] } will report the FILTERFAIL status of PAN0, 0x1,{ PPME_FILTERFAIL_CODE[1:0],
 *    PP_FILTERFAIL_CODE[9:0] } will report the FILTERFAIL status of PAN1
 */
#define ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL(x) (((uint32_t)(((uint32_t)(x)) << ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_SHIFT)) & ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_MASK)
/*! @} */

/*! @name RX_WTR_MARK - RECEIVE WATER MARK (RX_WTR_MARK) */
/*! @{ */

#define ZLL_RX_WTR_MARK_RX_WTR_MARK_MASK         (0xFFU)
#define ZLL_RX_WTR_MARK_RX_WTR_MARK_SHIFT        (0U)
/*! RX_WTR_MARK - RECEIVE WATER MARK Receive byte count (octets) needed to trigger a RXWTRMRKIRQ
 *    interrupt . A setting of 0 generates an interrupt at end of the Frame Length field (first byte
 *    after SFD). A setting of 1 generates an interrupt after the first byte of Frame Control Field,
 *    etc.
 */
#define ZLL_RX_WTR_MARK_RX_WTR_MARK(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_RX_WTR_MARK_RX_WTR_MARK_SHIFT)) & ZLL_RX_WTR_MARK_RX_WTR_MARK_MASK)
/*! @} */

/*! @name RESET_CTRL -  */
/*! @{ */

#define ZLL_RESET_CTRL_SEQ_MGR_RST_MASK          (0x1U)
#define ZLL_RESET_CTRL_SEQ_MGR_RST_SHIFT         (0U)
/*! SEQ_MGR_RST - Setting this bit will reset all BSM Controller Register. FW should set it and then clear it to assert a reset pulse. */
#define ZLL_RESET_CTRL_SEQ_MGR_RST(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_RESET_CTRL_SEQ_MGR_RST_SHIFT)) & ZLL_RESET_CTRL_SEQ_MGR_RST_MASK)

#define ZLL_RESET_CTRL_RX_RST_MASK               (0x2U)
#define ZLL_RESET_CTRL_RX_RST_SHIFT              (1U)
/*! RX_RST - Setting this bit will reset all Rx Datapath. FW should set it and then clear it to assert a reset pulse. */
#define ZLL_RESET_CTRL_RX_RST(x)                 (((uint32_t)(((uint32_t)(x)) << ZLL_RESET_CTRL_RX_RST_SHIFT)) & ZLL_RESET_CTRL_RX_RST_MASK)

#define ZLL_RESET_CTRL_TX_RST_MASK               (0x4U)
#define ZLL_RESET_CTRL_TX_RST_SHIFT              (2U)
/*! TX_RST - Setting this bit will reset all Tx Datapath. FW should set it and then clear it to assert a reset pulse. */
#define ZLL_RESET_CTRL_TX_RST(x)                 (((uint32_t)(((uint32_t)(x)) << ZLL_RESET_CTRL_TX_RST_SHIFT)) & ZLL_RESET_CTRL_TX_RST_MASK)

#define ZLL_RESET_CTRL_PLL_RST_MASK              (0x8U)
#define ZLL_RESET_CTRL_PLL_RST_SHIFT             (3U)
/*! PLL_RST - This field will reset the PLL but not applicable to WCS FFU Instantiation */
#define ZLL_RESET_CTRL_PLL_RST(x)                (((uint32_t)(((uint32_t)(x)) << ZLL_RESET_CTRL_PLL_RST_SHIFT)) & ZLL_RESET_CTRL_PLL_RST_MASK)

#define ZLL_RESET_CTRL_REGS_RST_MASK             (0x10U)
#define ZLL_RESET_CTRL_REGS_RST_SHIFT            (4U)
/*! REGS_RST - Setting this bit will reset all Interrupt Status Register. FW should set it and then clear it to assert a reset pulse. */
#define ZLL_RESET_CTRL_REGS_RST(x)               (((uint32_t)(((uint32_t)(x)) << ZLL_RESET_CTRL_REGS_RST_SHIFT)) & ZLL_RESET_CTRL_REGS_RST_MASK)

#define ZLL_RESET_CTRL_ZIGBEE_RST_MASK           (0x80U)
#define ZLL_RESET_CTRL_ZIGBEE_RST_SHIFT          (7U)
/*! ZIGBEE_RST - Setting this bit will reset BSM Controller, Rx/Tx Datapath & Interrupt Status
 *    Register. FW should set it and then clear it to assert a reset pulse.
 */
#define ZLL_RESET_CTRL_ZIGBEE_RST(x)             (((uint32_t)(((uint32_t)(x)) << ZLL_RESET_CTRL_ZIGBEE_RST_SHIFT)) & ZLL_RESET_CTRL_ZIGBEE_RST_MASK)
/*! @} */

