zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
/*! @name SLOT_PRELOAD - SLOT PRELOAD (SLOT_PRELOAD)Slotted Mode Preload */
/*! @{ */

#define ZLL_SLOT_PRELOAD_SLOT_PRELOAD_MASK       (0xFFU)
#define ZLL_SLOT_PRELOAD_SLOT_PRELOAD_SHIFT      (0U)
/*! SLOT_PRELOAD - Slotted Mode Preload This register represents the number that gets loaded into
 *    the slot_timer at SFD detect, which ultimately determines when the next slot boundary will
 *    occur. Due to processing delays within the analog front-end and digital modem, the point at which
 *    SFD is detected by the modem, is delayed relative to over-the-air timing. This register setting
 *    compensates for that delay. This timing parameter is critical for the Sequence R autosequence
 *    in SLOTTED mode, when an automatic TxAck is required.
 */
#define ZLL_SLOT_PRELOAD_SLOT_PRELOAD(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_SLOT_PRELOAD_SLOT_PRELOAD_SHIFT)) & ZLL_SLOT_PRELOAD_SLOT_PRELOAD_MASK)
/*! @} */

/*! @name SEQ_STATE - 802.15.4 SEQUENCE STATE (SEQ_STATE)802.15.4 Sequence State Register */
/*! @{ */

#define ZLL_SEQ_STATE_SEQ_STATE_MASK             (0x1FU)
#define ZLL_SEQ_STATE_SEQ_STATE_SHIFT            (0U)
/*! SEQ_STATE - ZSM Sequence State This read-only register reflects the instantaneous state of the 802.15.4 Sequence Manager */
#define ZLL_SEQ_STATE_SEQ_STATE(x)               (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_STATE_SEQ_STATE_SHIFT)) & ZLL_SEQ_STATE_SEQ_STATE_MASK)

#define ZLL_SEQ_STATE_PREAMBLE_DET_MASK          (0x100U)
#define ZLL_SEQ_STATE_PREAMBLE_DET_SHIFT         (8U)
/*! PREAMBLE_DET - Preamble Detected 0x0 an 802.15.4 preamble has not been detected. 1: An 802.15.4
 *    preamble has been detected. The function of this read-only bit depends on the setting of the
 *    LATCH_PREAMBLE bit of the SEQ_MGR_CTRL register. If LATCH_PREAMBLE=1, any preamble detection
 *    during a Sequence R (even false detections), will set this bit, and it will remain set (sticky)
 *    until the start of the next autosequence. If LATCH_PREAMBLE=0, this bit is not sticky, and
 *    reflects the instantaneous state of the preamble-detection circuit; for false preambles, the bit
 *    will clear when the false nature of the preamble is recognized. When LATCH_PREAMBLE=0,
 *    PREAMBLE_DET should be considered valid only while an autosequence is underway.
 */
#define ZLL_SEQ_STATE_PREAMBLE_DET(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_STATE_PREAMBLE_DET_SHIFT)) & ZLL_SEQ_STATE_PREAMBLE_DET_MASK)

#define ZLL_SEQ_STATE_SFD_DET_MASK               (0x200U)
#define ZLL_SEQ_STATE_SFD_DET_SHIFT              (9U)
/*! SFD_DET - SFD Detected 0x0 an 802.15.4 preamble-and-SFD have not been detected. 1: An 802.15.4
 *    preamble-and-SFD have been detected. The function of this read-only bit depends on the setting
 *    of the LATCH_PREAMBLE bit of the SEQ_MGR_CTRL register. If LATCH_PREAMBLE=1, any
 *    preamble-and-SFD detection during a Sequence R (even false detections), will set this bit, and it will
 *    remain set (sticky) until the start of the next autosequence. If LATCH_PREAMBLE=0, this bit is not
 *    sticky, and reflects the instantaneous state of the SFD-detection circuit; for false SFD, the
 *    bit will clear when the false nature of the SFD is recognized (i.e., an RX recycle). When
 *    LATCH_PREAMBLE=0, SFD_DET should be considered valid only while an autosequence is underway.
 */
#define ZLL_SEQ_STATE_SFD_DET(x)                 (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_STATE_SFD_DET_SHIFT)) & ZLL_SEQ_STATE_SFD_DET_MASK)

#define ZLL_SEQ_STATE_FILTERFAIL_FLAG_SEL_MASK   (0x400U)
#define ZLL_SEQ_STATE_FILTERFAIL_FLAG_SEL_SHIFT  (10U)
/*! FILTERFAIL_FLAG_SEL - Consolidated Filter Fail Flag 0x0 The incoming, or just-received packet,
 *    passed packet filtering rules. 1: The incoming, or just-received packet, failed packet
 *    filtering rules When FILTERFAIL_FLAG_SEL=1, a non-zero FILTERFAIL_CODE is present (see FILTERFAIL_CODE
 *    registers). In Dual PAN mode, FILTERFAIL_FLAG_SEL applies to either or both networks, as
 *    follows: A: If PAN0 and PAN1 occupy different channels and CURRENT_NETWORK=0, FILTERFAIL_FLAG_SEL
 *    applies to PAN0. B: If PAN0 and PAN1 occupy different channels and CURRENT_NETWORK=1,
 *    FILTERFAIL_FLAG_SEL applies to PAN1. C: If PAN0 and PAN1 occupy the same channel, FILTERFAIL_FLAG_SEL
 *    is the logical 'AND' of the individual PANs' FILTERFAIL_FLAG bits.
 */
#define ZLL_SEQ_STATE_FILTERFAIL_FLAG_SEL(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_STATE_FILTERFAIL_FLAG_SEL_SHIFT)) & ZLL_SEQ_STATE_FILTERFAIL_FLAG_SEL_MASK)

#define ZLL_SEQ_STATE_CRCVALID_MASK              (0x800U)
#define ZLL_SEQ_STATE_CRCVALID_SHIFT             (11U)
/*! CRCVALID - CRC Valid Indicator * Cyclic Redundancy Check Valid: This flag indicates the compare
 *    result between the FCS field, in the most-recently received frame, and the internally
 *    calculated CRC value. This flag is cleared at next receiver warm up. 0x0,Rx FCS != calculated CRC
 *    (incorrect), 0x1,Rx FCS = calculated CRC (correct)
 */
#define ZLL_SEQ_STATE_CRCVALID(x)                (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_STATE_CRCVALID_SHIFT)) & ZLL_SEQ_STATE_CRCVALID_MASK)

#define ZLL_SEQ_STATE_PLL_ABORT_MASK             (0x1000U)
#define ZLL_SEQ_STATE_PLL_ABORT_SHIFT            (12U)
/*! PLL_ABORT - Raw PLL Abort Signal This bit reflects the instantaneous, consolidated status of the
 *    PLL unlock detection circuits; if asserted high, indicates that at least one of the three PLL
 *    unlock detect mechanisms is currently reporting an unlocked condition.
 */
#define ZLL_SEQ_STATE_PLL_ABORT(x)               (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_STATE_PLL_ABORT_SHIFT)) & ZLL_SEQ_STATE_PLL_ABORT_MASK)

#define ZLL_SEQ_STATE_PLL_ABORTED_MASK           (0x2000U)
#define ZLL_SEQ_STATE_PLL_ABORTED_SHIFT          (13U)
/*! PLL_ABORTED - Autosequence has terminated due to an PLL unlock event when asserted, indicates
 *    that the autosequence has terminated due to an PLL unlock event. This bit is valid at the SEQIRQ
 *    interrupt. Hardware will maintain this bit asserted until the next autosequence commences.
 *    This bit is a read-only mirror of the register bit of the same name in the ABORT_STS
 *    (SEQ_CTRL_STS) register.
 */
#define ZLL_SEQ_STATE_PLL_ABORTED(x)             (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_STATE_PLL_ABORTED_SHIFT)) & ZLL_SEQ_STATE_PLL_ABORTED_MASK)

#define ZLL_SEQ_STATE_PPME_FILTERFAIL_FLAG_SEL_MASK (0x4000U)
#define ZLL_SEQ_STATE_PPME_FILTERFAIL_FLAG_SEL_SHIFT (14U)
/*! PPME_FILTERFAIL_FLAG_SEL - Consolidated Filter Fail Flag (PPME) 0x0 The incoming, or
 *    just-received packet, passed PPME filtering (matching) rules. 1: The incoming, or just-received packet,
 *    failed packet filtering (matching) rules When PPME_FILTERFAIL_FLAG_SEL=1, a non-zero
 *    PPME_FILTERFAIL_CODE is present (see PPME_FILTERFAIL_CODE registers). In Dual PAN mode,
 *    PPME_FILTERFAIL_FLAG_SEL applies to either or both networks, as follows: A: If PAN0 and PAN1 occupy different
 *    channels and CURRENT_NETWORK=0, PPME_FILTERFAIL_FLAG_SEL applies to PAN0. B: If PAN0 and PAN1
 *    occupy different channels and CURRENT_NETWORK=1, PPME_FILTERFAIL_FLAG_SEL applies to PAN1. C:
 *    If PAN0 and PAN1 occupy the same channel, PPME_FILTERFAIL_FLAG_SEL is the logical 'AND' of the
 *    individual PANs' PPME_FILTERFAIL_FLAG bits.
 */
#define ZLL_SEQ_STATE_PPME_FILTERFAIL_FLAG_SEL(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_STATE_PPME_FILTERFAIL_FLAG_SEL_SHIFT)) & ZLL_SEQ_STATE_PPME_FILTERFAIL_FLAG_SEL_MASK)

#define ZLL_SEQ_STATE_RX_BYTE_COUNT_MASK         (0xFF0000U)
#define ZLL_SEQ_STATE_RX_BYTE_COUNT_SHIFT        (16U)
/*! RX_BYTE_COUNT - Realtime Received Byte Count During packet reception, this read-only register is
 *    a real-time indicator of the number of bytes that have been received. This register will read
 *    0 until SFD and PHR have been received. It will read 1 after the first byte of Frame Control
 *    Field has been received, etc.
 */
#define ZLL_SEQ_STATE_RX_BYTE_COUNT(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_STATE_RX_BYTE_COUNT_SHIFT)) & ZLL_SEQ_STATE_RX_BYTE_COUNT_MASK)

#define ZLL_SEQ_STATE_CCCA_BUSY_CNT_MASK         (0x3F000000U)
#define ZLL_SEQ_STATE_CCCA_BUSY_CNT_SHIFT        (24U)
/*! CCCA_BUSY_CNT - Number of CCA Measurements resulting in Busy Channel For Sequence CCCA mode
 *    only, this register indicates the number of busy CCA attempts which occurred during the
 *    autosequence, before the channel was detected to be idle. This register can also be read in real-time
 *    (during the autosequence) to determine how many busy CCA attempts have occurred to that point.
 *    The register saturates at 63 (i.e, if there are more than 63 busy attempts, the register will
 *    continue to read 63). This register is automatically cleared to zero by hardware when the next
 *    autosequence commences. Read-only register.
 */
#define ZLL_SEQ_STATE_CCCA_BUSY_CNT(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_SEQ_STATE_CCCA_BUSY_CNT_SHIFT)) & ZLL_SEQ_STATE_CCCA_BUSY_CNT_MASK)
/*! @} */

/*! @name TMR_PRESCALE - TIMER PRESCALER (TMR_PRESCALE)Timer Prescaler Control Register */
/*! @{ */

#define ZLL_TMR_PRESCALE_TMR_PRESCALE_MASK       (0x7U)
#define ZLL_TMR_PRESCALE_TMR_PRESCALE_SHIFT      (0U)
/*! TMR_PRESCALE - Timer Prescaler Timer Prescaler. Establishes the Event Timer clock rate (and also
 *    maximum timer duration) Note: To take advantage of the EVENT_TMR Fractional bits for 802.15.4
 *    DSM mode, only the default setting (5, or 62.5KHz) is allowed. 0x0,Reserved, 0x1,Reserved,
 *    0x2,500kHz (33.55 S), 0x3,250kHz (67.11 S), 0x4,125kHz (134.22 S), 0x5,62.5kHz (268.44 S) --
 *    default, 0x6,31.25kHz (536.87 S), 0x7,15.625kHz (1073.74 S)
 */
#define ZLL_TMR_PRESCALE_TMR_PRESCALE(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_TMR_PRESCALE_TMR_PRESCALE_SHIFT)) & ZLL_TMR_PRESCALE_TMR_PRESCALE_MASK)
/*! @} */

