zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
/*! @name LENIENCY_LSB - LENIENCY LSB (LENIENCY_LSB)Packet Processor Leniency Bits (LSB) */
/*! @{ */

#define ZLL_LENIENCY_LSB_LENIENCY_LSB_MASK       (0xFFFFFFFFU)
#define ZLL_LENIENCY_LSB_LENIENCY_LSB_SHIFT      (0U)
/*! LENIENCY_LSB - Leniency LSB Register The Packet Processor performs filtering on all received
 *    packets, in order to determine whether the packet is intended for the device. The packet
 *    filtering is based on rules. In case any of the packet filtering rules need to be overridden, a 43-bit
 *    leniency register has been provided. When the leniency register is programmed to its default
 *    value (0), all hardware packet filtering rules are in effect, and if an incoming packet
 *    violates any rule, a Filter Fail will occur (packet will be rejected). When a given leniency
 *    register bit is asserted, the packet filtering rule assigned to that bit will not be in effect, and
 *    if any incoming packet violates that rule (but no other rules), then a Filter Fail will not
 *    occur, the packet will not be rejected, the packet will be treated as intended for the device,
 *    and software will be notified of the incoming packet. For a description of the function of the
 *    individual leniency bits, see the 802.15.4 Link Layer Controller chapter.
 */
#define ZLL_LENIENCY_LSB_LENIENCY_LSB(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_LENIENCY_LSB_LENIENCY_LSB_SHIFT)) & ZLL_LENIENCY_LSB_LENIENCY_LSB_MASK)
/*! @} */

/*! @name LENIENCY_MSB - LENIENCY MSB (LENIENCY_MSB)Packet Processor Leniency Bits (MSB) */
/*! @{ */

#define ZLL_LENIENCY_MSB_LENIENCY_MSB_MASK       (0x7FFU)
#define ZLL_LENIENCY_MSB_LENIENCY_MSB_SHIFT      (0U)
/*! LENIENCY_MSB - Leniency MSB Register The Packet Processor performs filtering on all received
 *    packets, in order to determine whether the packet is intended for the device. The packet
 *    filtering is based on rules. In case any of the packet filtering rules need to be overridden, a 43-bit
 *    leniency register has been provided. When the leniency register is programmed to its default
 *    value (0), all hardware packet filtering rules are in effect, and if an incoming packet
 *    violates any rule, a Filter Fail will occur (packet will be rejected). When a given leniency
 *    register bit is asserted, the packet filtering rule assigned to that bit will not be in effect, and
 *    if any incoming packet violates that rule (but no other rules), then a Filter Fail will not
 *    occur, the packet will not be rejected, the packet will be treated as intended for the device,
 *    and software will be notified of the incoming packet. For a description of the function of the
 *    individual leniency bits, see the 802.15.4 Link Layer Controller chapter.
 */
#define ZLL_LENIENCY_MSB_LENIENCY_MSB(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_LENIENCY_MSB_LENIENCY_MSB_SHIFT)) & ZLL_LENIENCY_MSB_LENIENCY_MSB_MASK)
/*! @} */

/*! @name PART_ID - PART ID (PART_ID) */
/*! @{ */

#define ZLL_PART_ID_PART_ID_MASK                 (0xFFU)
#define ZLL_PART_ID_PART_ID_SHIFT                (0U)
/*! PART_ID - 802.15.4 Part ID */
#define ZLL_PART_ID_PART_ID(x)                   (((uint32_t)(((uint32_t)(x)) << ZLL_PART_ID_PART_ID_SHIFT)) & ZLL_PART_ID_PART_ID_MASK)
/*! @} */

/*! @name COEX_CTRL - COEXISTENCE CONTROL (COEX_CTRL)Coexistence Control Registers in Link Layer.This Register provides various control bits for Coexistence funciton. It contains the bits to enable the Coexistence funciton. Also contains Coexistence Timeout Interrupt, Coexistence Timeout Interrupt Mask bit and some other COEX bits */
/*! @{ */

#define ZLL_COEX_CTRL_COEX_EN_MASK               (0x1U)
#define ZLL_COEX_CTRL_COEX_EN_SHIFT              (0U)
/*! COEX_EN - Coexistence Enable 0x0,Coexistence function is disabled., 0x1,Coexistence function is enabled. */
#define ZLL_COEX_CTRL_COEX_EN(x)                 (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_EN_SHIFT)) & ZLL_COEX_CTRL_COEX_EN_MASK)

#define ZLL_COEX_CTRL_COEX_REQ_DELAY_EN_MASK     (0x2U)
#define ZLL_COEX_CTRL_COEX_REQ_DELAY_EN_SHIFT    (1U)
/*! COEX_REQ_DELAY_EN - Coexistence Request Delay Enable 0x0,arb_request is not delayed during R
 *    sequence., 0x1,arb_request is delayed until preamble is detected during R sequence.
 */
#define ZLL_COEX_CTRL_COEX_REQ_DELAY_EN(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_REQ_DELAY_EN_SHIFT)) & ZLL_COEX_CTRL_COEX_REQ_DELAY_EN_MASK)

#define ZLL_COEX_CTRL_COEX_REQ_ON_PD_MASK        (0x4U)
#define ZLL_COEX_CTRL_COEX_REQ_ON_PD_SHIFT       (2U)
/*! COEX_REQ_ON_PD - Coexistence Request on Preamble detected 0x0,arb_request is delayed until SFD
 *    is detected during R sequence., 0x1,arb_request is delayed until preamble is detected during R
 *    sequence.
 */
#define ZLL_COEX_CTRL_COEX_REQ_ON_PD(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_REQ_ON_PD_SHIFT)) & ZLL_COEX_CTRL_COEX_REQ_ON_PD_MASK)

#define ZLL_COEX_CTRL_COEX_TIMEOUT_MSK_MASK      (0x40U)
#define ZLL_COEX_CTRL_COEX_TIMEOUT_MSK_SHIFT     (6U)
/*! COEX_TIMEOUT_MSK - Coexistence Timeout Interrupt Mask bit 0x0,allows interrupt when coexistence
 *    timeout, 0x1,Interrupt generation is disabled, but a COEX_TIMEOUT_IRQ flag can be set
 */
#define ZLL_COEX_CTRL_COEX_TIMEOUT_MSK(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_TIMEOUT_MSK_SHIFT)) & ZLL_COEX_CTRL_COEX_TIMEOUT_MSK_MASK)

#define ZLL_COEX_CTRL_COEX_TIMEOUT_IRQ_MASK      (0x80U)
#define ZLL_COEX_CTRL_COEX_TIMEOUT_IRQ_SHIFT     (7U)
/*! COEX_TIMEOUT_IRQ - Coexistence Timeout Interrupt Indicates coexistence timeout occurs. This is write '1' to clear bit. */
#define ZLL_COEX_CTRL_COEX_TIMEOUT_IRQ(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_TIMEOUT_IRQ_SHIFT)) & ZLL_COEX_CTRL_COEX_TIMEOUT_IRQ_MASK)

#define ZLL_COEX_CTRL_COEX_TIMEOUT_MASK          (0xFF00U)
#define ZLL_COEX_CTRL_COEX_TIMEOUT_SHIFT         (8U)
/*! COEX_TIMEOUT - Coexistence timeout value After arb_request asserts, arb_grant should assert
 *    before the timeout value. Otherwise the sequence is abort and COEX_TIMEOUT_IRQ bit is set. The
 *    step of the timeout value is 32us.
 */
#define ZLL_COEX_CTRL_COEX_TIMEOUT(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_CTRL_COEX_TIMEOUT_SHIFT)) & ZLL_COEX_CTRL_COEX_TIMEOUT_MASK)
/*! @} */

/*! @name COEX_PRIORITY - COEXISTENCE PRIORITY (COEX_PRIORITY)Programmable 2-bit priority for each RX or TX state in each ZSM. */
/*! @{ */

#define ZLL_COEX_PRIORITY_PRIORITY_T_MASK        (0x3U)
#define ZLL_COEX_PRIORITY_PRIORITY_T_SHIFT       (0U)
/*! PRIORITY_T - PRIORITY_T PRIORITY value for TX Packet. */
#define ZLL_COEX_PRIORITY_PRIORITY_T(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_T_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_T_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_R_PRE_MASK    (0xCU)
#define ZLL_COEX_PRIORITY_PRIORITY_R_PRE_SHIFT   (2U)
/*! PRIORITY_R_PRE - PRIORITY_R_PRE PRIORITY value of searching Preamble for RX Packet. */
#define ZLL_COEX_PRIORITY_PRIORITY_R_PRE(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_R_PRE_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_R_PRE_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_R_PKT_MASK    (0x30U)
#define ZLL_COEX_PRIORITY_PRIORITY_R_PKT_SHIFT   (4U)
/*! PRIORITY_R_PKT - PRIORITY_R_PKT PRIORITY value for RX Packet. */
#define ZLL_COEX_PRIORITY_PRIORITY_R_PKT(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_R_PKT_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_R_PKT_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_TACK_MASK     (0xC0U)
#define ZLL_COEX_PRIORITY_PRIORITY_TACK_SHIFT    (6U)
/*! PRIORITY_TACK - PRIORITY_TACK PRIORITY value for TX ACK Packet. */
#define ZLL_COEX_PRIORITY_PRIORITY_TACK(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_TACK_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_TACK_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_CCA_MASK      (0x300U)
#define ZLL_COEX_PRIORITY_PRIORITY_CCA_SHIFT     (8U)
/*! PRIORITY_CCA - PRIORITY_CCA PRIORITY value for CCA. */
#define ZLL_COEX_PRIORITY_PRIORITY_CCA(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_CCA_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_CCA_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_CCCA_MASK     (0xC00U)
#define ZLL_COEX_PRIORITY_PRIORITY_CCCA_SHIFT    (10U)
/*! PRIORITY_CCCA - PRIORITY_CCCA PRIORITY value for Continuous CCA. */
#define ZLL_COEX_PRIORITY_PRIORITY_CCCA(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_CCCA_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_CCCA_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_CTX_MASK      (0x3000U)
#define ZLL_COEX_PRIORITY_PRIORITY_CTX_SHIFT     (12U)
/*! PRIORITY_CTX - PRIORITY_CT PRIORITY value for CCA before TX Packet. */
#define ZLL_COEX_PRIORITY_PRIORITY_CTX(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_CTX_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_CTX_MASK)

