zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PRE_MASK (0xC000U)
#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PRE_SHIFT (14U)
/*! PRIORITY_RACK_PRE - PRIORITY_RACK_PRE PRIORITY value during searching preamble of ACK packet. */
#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PRE(x)   (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_RACK_PRE_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_RACK_PRE_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PKT_MASK (0x30000U)
#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PKT_SHIFT (16U)
/*! PRIORITY_RACK_PKT - PRIORITY_RACK_PKT PRIORITY value during receiving ACK packet. */
#define ZLL_COEX_PRIORITY_PRIORITY_RACK_PKT(x)   (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_RACK_PKT_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_RACK_PKT_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_OVRD_MASK     (0x60000000U)
#define ZLL_COEX_PRIORITY_PRIORITY_OVRD_SHIFT    (29U)
/*! PRIORITY_OVRD - PRIORITY_OVRD When PRIORITY_OVRD_EN is set to 1, PRIORITY_OVRD is used to override PRIORITY value. */
#define ZLL_COEX_PRIORITY_PRIORITY_OVRD(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_OVRD_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_OVRD_MASK)

#define ZLL_COEX_PRIORITY_PRIORITY_OVRD_EN_MASK  (0x80000000U)
#define ZLL_COEX_PRIORITY_PRIORITY_OVRD_EN_SHIFT (31U)
/*! PRIORITY_OVRD_EN - PRIORITY_OVRD_EN Enable/Disable overriding PRIORITY value. 0x0,Disable
 *    overriding PRIORITY value., 0x1,Enable overriding PRIORITY value.
 */
#define ZLL_COEX_PRIORITY_PRIORITY_OVRD_EN(x)    (((uint32_t)(((uint32_t)(x)) << ZLL_COEX_PRIORITY_PRIORITY_OVRD_EN_SHIFT)) & ZLL_COEX_PRIORITY_PRIORITY_OVRD_EN_MASK)
/*! @} */

/*! @name ENHACK_CTRL0 - ENHACK_CTRL 0 (ENHACK_CTRL0)Control Register 0 for Enhanced Acknowledgment Feature */
/*! @{ */

#define ZLL_ENHACK_CTRL0_ENHACK_EN_MASK          (0x1U)
#define ZLL_ENHACK_CTRL0_ENHACK_EN_SHIFT         (0U)
/*! ENHACK_EN - Enhanced Acknowledgment Enable 0x0,Enhanced acknowledgment is disabled., 0x1,Enhanced acknowledgment is enabled. */
#define ZLL_ENHACK_CTRL0_ENHACK_EN(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_ENHACK_EN_SHIFT)) & ZLL_ENHACK_CTRL0_ENHACK_EN_MASK)

#define ZLL_ENHACK_CTRL0_SW_LEN_RDY_MASK         (0x2U)
#define ZLL_ENHACK_CTRL0_SW_LEN_RDY_SHIFT        (1U)
/*! SW_LEN_RDY - Software enhanced acknowledgment frame Length field ready 0x0,Software enhanced
 *    acknowledgment frame Length field is not ready., 0x1,Software enhanced acknowledgment frame
 *    Length field is ready in RAM
 */
#define ZLL_ENHACK_CTRL0_SW_LEN_RDY(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_SW_LEN_RDY_SHIFT)) & ZLL_ENHACK_CTRL0_SW_LEN_RDY_MASK)

#define ZLL_ENHACK_CTRL0_SW_HIE_RDY_MASK         (0x4U)
#define ZLL_ENHACK_CTRL0_SW_HIE_RDY_SHIFT        (2U)
/*! SW_HIE_RDY - Software enhanced acknowledgment frame HIE field ready 0x0,Software enhanced
 *    acknowledgment frame HIE field is not ready., 0x1,Software enhanced acknowledgment frame HIE field
 *    is ready in RAM
 */
#define ZLL_ENHACK_CTRL0_SW_HIE_RDY(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_SW_HIE_RDY_SHIFT)) & ZLL_ENHACK_CTRL0_SW_HIE_RDY_MASK)

#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_MASK (0x10U)
#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_SHIFT (4U)
/*! EMPTY_SECURITY_ENABLED_OVRD - Override value of Security Enabled field in Empty Enhanced Acknowledgment */
#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD(x) (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_SHIFT)) & ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_MASK)

#define ZLL_ENHACK_CTRL0_EMPTY_SRC_ADDR_MODE_MASK (0x60U)
#define ZLL_ENHACK_CTRL0_EMPTY_SRC_ADDR_MODE_SHIFT (5U)
/*! EMPTY_SRC_ADDR_MODE - Source Address Mode field in Empty Enhanced Acknowledgment */
#define ZLL_ENHACK_CTRL0_EMPTY_SRC_ADDR_MODE(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_EMPTY_SRC_ADDR_MODE_SHIFT)) & ZLL_ENHACK_CTRL0_EMPTY_SRC_ADDR_MODE_MASK)

#define ZLL_ENHACK_CTRL0_SW_MHR_LENGTH_MASK      (0xFF00U)
#define ZLL_ENHACK_CTRL0_SW_MHR_LENGTH_SHIFT     (8U)
/*! SW_MHR_LENGTH - Software calculated MHR(excludes the HIE field) Length in bytes. */
#define ZLL_ENHACK_CTRL0_SW_MHR_LENGTH(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_SW_MHR_LENGTH_SHIFT)) & ZLL_ENHACK_CTRL0_SW_MHR_LENGTH_MASK)

#define ZLL_ENHACK_CTRL0_HW_FRAME_PENDING_MASK   (0x10000U)
#define ZLL_ENHACK_CTRL0_HW_FRAME_PENDING_SHIFT  (16U)
/*! HW_FRAME_PENDING - Hardware calculated Frame Pending field When received a DATA or Command
 *    Frame, hardware calculates the Frame Pending field by Source Address Management. This bit can be
 *    used by software to build the Enhanced Acknowledgment frame.
 */
#define ZLL_ENHACK_CTRL0_HW_FRAME_PENDING(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_HW_FRAME_PENDING_SHIFT)) & ZLL_ENHACK_CTRL0_HW_FRAME_PENDING_MASK)

#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_EN_MASK (0x40000U)
#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_EN_SHIFT (18U)
/*! EMPTY_SECURITY_ENABLED_OVRD_EN - Override enable of Security Enabled field in Empty Enhanced
 *    Acknowledgment 0x0,Security Enabled field in Empty Enhanced Acknowledgment frame is 0.,
 *    0x1,Security Enabled field in Empty Enhanced Acknowledgment frame is, from EMPTY_SECURITY_ENABLED_OVRD.
 */
#define ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_EN_SHIFT)) & ZLL_ENHACK_CTRL0_EMPTY_SECURITY_ENABLED_OVRD_EN_MASK)

#define ZLL_ENHACK_CTRL0_ENABLE_HW_MODE7_8_MASK  (0x80000U)
#define ZLL_ENHACK_CTRL0_ENABLE_HW_MODE7_8_SHIFT (19U)
/*! ENABLE_HW_MODE7_8 - Enable AUTOACK for frame version 2 extended addressing modes 0x0,Disable
 *    autack for frame version 2 extended addressing modes, 0x1,Enable AUTOACK for frame version
 *    2extended addressing modes
 */
#define ZLL_ENHACK_CTRL0_ENABLE_HW_MODE7_8(x)    (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_ENABLE_HW_MODE7_8_SHIFT)) & ZLL_ENHACK_CTRL0_ENABLE_HW_MODE7_8_MASK)

#define ZLL_ENHACK_CTRL0_FORCE_ACK_ENABLE_FOR_FV2_MASK (0x100000U)
#define ZLL_ENHACK_CTRL0_FORCE_ACK_ENABLE_FOR_FV2_SHIFT (20U)
/*! FORCE_ACK_ENABLE_FOR_FV2 - Force AUTOACK for all frame version 2 packets, PAN0 0x0,Normal
 *    operation, 0x1,Force AUTOACK for all frame version2 packets
 */
#define ZLL_ENHACK_CTRL0_FORCE_ACK_ENABLE_FOR_FV2(x) (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_FORCE_ACK_ENABLE_FOR_FV2_SHIFT)) & ZLL_ENHACK_CTRL0_FORCE_ACK_ENABLE_FOR_FV2_MASK)

