zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_ENHACK_CTRL0_FORCE_ACK_ENABLE_FOR_FV2_PAN1_MASK (0x200000U)
#define ZLL_ENHACK_CTRL0_FORCE_ACK_ENABLE_FOR_FV2_PAN1_SHIFT (21U)
/*! FORCE_ACK_ENABLE_FOR_FV2_PAN1 - Force AUTOACK for all frame version 2 packets, PAN1 0x0,Normal
 *    operation, 0x1,Force AUTOACK for all frame version2 packets
 */
#define ZLL_ENHACK_CTRL0_FORCE_ACK_ENABLE_FOR_FV2_PAN1(x) (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_FORCE_ACK_ENABLE_FOR_FV2_PAN1_SHIFT)) & ZLL_ENHACK_CTRL0_FORCE_ACK_ENABLE_FOR_FV2_PAN1_MASK)

#define ZLL_ENHACK_CTRL0_ACK_ABORT_MSK_MASK      (0x4000000U)
#define ZLL_ENHACK_CTRL0_ACK_ABORT_MSK_SHIFT     (26U)
/*! ACK_ABORT_MSK - Enhanced Acknowledgment Abort IRQ Mask bit 0x0,allows interrupt when HIE field
 *    is not ready by software., 0x1,Interrupt generation is disabled, but a ACK_ABORT_IRQ flag can
 *    be set
 */
#define ZLL_ENHACK_CTRL0_ACK_ABORT_MSK(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_ACK_ABORT_MSK_SHIFT)) & ZLL_ENHACK_CTRL0_ACK_ABORT_MSK_MASK)

#define ZLL_ENHACK_CTRL0_ACK_ABORT_IRQ_MASK      (0x8000000U)
#define ZLL_ENHACK_CTRL0_ACK_ABORT_IRQ_SHIFT     (27U)
/*! ACK_ABORT_IRQ - Enhanced Acknowledgment Abort IRQ This interrupt status bit indicates the HIE field is not ready by software. */
#define ZLL_ENHACK_CTRL0_ACK_ABORT_IRQ(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_ACK_ABORT_IRQ_SHIFT)) & ZLL_ENHACK_CTRL0_ACK_ABORT_IRQ_MASK)

#define ZLL_ENHACK_CTRL0_EMPTY_ACK_MSK_MASK      (0x10000000U)
#define ZLL_ENHACK_CTRL0_EMPTY_ACK_MSK_SHIFT     (28U)
/*! EMPTY_ACK_MSK - Empty Enhanced Acknowledgment IRQ Mask bit 0x0,allows interrupt when Empty
 *    Enhanced Acknowledgment, 0x1,Interrupt generation is disabled, but a EMPTY_ACK_IRQ flag can be set
 */
#define ZLL_ENHACK_CTRL0_EMPTY_ACK_MSK(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_EMPTY_ACK_MSK_SHIFT)) & ZLL_ENHACK_CTRL0_EMPTY_ACK_MSK_MASK)

#define ZLL_ENHACK_CTRL0_EMPTY_ACK_IRQ_MASK      (0x20000000U)
#define ZLL_ENHACK_CTRL0_EMPTY_ACK_IRQ_SHIFT     (29U)
/*! EMPTY_ACK_IRQ - Empty Enhanced Acknowledgment IRQ This interrupt status bit indicates the Empty Enhanced Acknowledgment is to be sent. */
#define ZLL_ENHACK_CTRL0_EMPTY_ACK_IRQ(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_EMPTY_ACK_IRQ_SHIFT)) & ZLL_ENHACK_CTRL0_EMPTY_ACK_IRQ_MASK)

#define ZLL_ENHACK_CTRL0_RECYC_MSK_MASK          (0x40000000U)
#define ZLL_ENHACK_CTRL0_RECYC_MSK_SHIFT         (30U)
/*! RECYC_MSK - Recycle IRQ Mask bit 0x0,allows interrupt when recycle, 0x1,Interrupt generation is
 *    disabled, but a RECYC_IRQ flag can be set
 */
#define ZLL_ENHACK_CTRL0_RECYC_MSK(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_RECYC_MSK_SHIFT)) & ZLL_ENHACK_CTRL0_RECYC_MSK_MASK)

#define ZLL_ENHACK_CTRL0_RECYC_IRQ_MASK          (0x80000000U)
#define ZLL_ENHACK_CTRL0_RECYC_IRQ_SHIFT         (31U)
/*! RECYC_IRQ - Recycle IRQ This interrupt status bit indicates the hardware recycle on filter fail or CRC invalid. */
#define ZLL_ENHACK_CTRL0_RECYC_IRQ(x)            (((uint32_t)(((uint32_t)(x)) << ZLL_ENHACK_CTRL0_RECYC_IRQ_SHIFT)) & ZLL_ENHACK_CTRL0_RECYC_IRQ_MASK)
/*! @} */

/*! @name CG_OVRD - Clock Gating Override Register (CG_OVRD) */
/*! @{ */

#define ZLL_CG_OVRD_AHB_HCLK_GATED_OVRD_MASK     (0x1U)
#define ZLL_CG_OVRD_AHB_HCLK_GATED_OVRD_SHIFT    (0U)
/*! AHB_HCLK_GATED_OVRD - Zigbee AHB clock enable override (default = 0 ) If set 1'b1, the AHB hclk is always enabled */
#define ZLL_CG_OVRD_AHB_HCLK_GATED_OVRD(x)       (((uint32_t)(((uint32_t)(x)) << ZLL_CG_OVRD_AHB_HCLK_GATED_OVRD_SHIFT)) & ZLL_CG_OVRD_AHB_HCLK_GATED_OVRD_MASK)

#define ZLL_CG_OVRD_IPS_CLK_EN_OVRD_MASK         (0x2U)
#define ZLL_CG_OVRD_IPS_CLK_EN_OVRD_SHIFT        (1U)
/*! IPS_CLK_EN_OVRD - IPS clock enable override (default =0), if set 1'b1 the CFG clock of the ahb_slave is always enabled */
#define ZLL_CG_OVRD_IPS_CLK_EN_OVRD(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_CG_OVRD_IPS_CLK_EN_OVRD_SHIFT)) & ZLL_CG_OVRD_IPS_CLK_EN_OVRD_MASK)

#define ZLL_CG_OVRD_SAME_CH_BOTH_SAM_LKUP_EM_MASK (0x4U)
#define ZLL_CG_OVRD_SAME_CH_BOTH_SAM_LKUP_EM_SHIFT (2U)
/*! SAME_CH_BOTH_SAM_LKUP_EM - Enable look-up for both PAN0 and PAN1 SAM table for same channel scenario */
#define ZLL_CG_OVRD_SAME_CH_BOTH_SAM_LKUP_EM(x)  (((uint32_t)(((uint32_t)(x)) << ZLL_CG_OVRD_SAME_CH_BOTH_SAM_LKUP_EM_SHIFT)) & ZLL_CG_OVRD_SAME_CH_BOTH_SAM_LKUP_EM_MASK)

#define ZLL_CG_OVRD_ZIGREG_CKEN_FW_OV_MASK       (0x8U)
#define ZLL_CG_OVRD_ZIGREG_CKEN_FW_OV_SHIFT      (3U)
/*! ZIGREG_CKEN_FW_OV - AHB clock (hclk) enable override (default = 0 ) If set 1'b1, the AHB hclk is always enabled */
#define ZLL_CG_OVRD_ZIGREG_CKEN_FW_OV(x)         (((uint32_t)(((uint32_t)(x)) << ZLL_CG_OVRD_ZIGREG_CKEN_FW_OV_SHIFT)) & ZLL_CG_OVRD_ZIGREG_CKEN_FW_OV_MASK)
/*! @} */

/*! @name PROG_PKT_FLTR_LO_PATT_A -  */
/*! @{ */

#define ZLL_PROG_PKT_FLTR_LO_PATT_A_PKT_FLTR_LO_PATT_A_MASK (0xFFFFFFFFU)
#define ZLL_PROG_PKT_FLTR_LO_PATT_A_PKT_FLTR_LO_PATT_A_SHIFT (0U)
/*! PKT_FLTR_LO_PATT_A - PPME filter A: 32bit LSB Rx Pattern programmed by software to be matched with the subfield of the incoming Rx Packet. */
#define ZLL_PROG_PKT_FLTR_LO_PATT_A_PKT_FLTR_LO_PATT_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_LO_PATT_A_PKT_FLTR_LO_PATT_A_SHIFT)) & ZLL_PROG_PKT_FLTR_LO_PATT_A_PKT_FLTR_LO_PATT_A_MASK)
/*! @} */

/*! @name PROG_PKT_FLTR_UP_PATT_A -  */
/*! @{ */

#define ZLL_PROG_PKT_FLTR_UP_PATT_A_PKT_FLTR_UP_PATT_A_MASK (0xFFFFFFFFU)
#define ZLL_PROG_PKT_FLTR_UP_PATT_A_PKT_FLTR_UP_PATT_A_SHIFT (0U)
/*! PKT_FLTR_UP_PATT_A - PPME filter A: 32bit MSB Rx Pattern programmed by software to be matched with the subfield of the incoming Rx Packet. */
#define ZLL_PROG_PKT_FLTR_UP_PATT_A_PKT_FLTR_UP_PATT_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_UP_PATT_A_PKT_FLTR_UP_PATT_A_SHIFT)) & ZLL_PROG_PKT_FLTR_UP_PATT_A_PKT_FLTR_UP_PATT_A_MASK)
/*! @} */

/*! @name PROG_PKT_FLTR_LO_MSK_A -  */
/*! @{ */

#define ZLL_PROG_PKT_FLTR_LO_MSK_A_PKT_FLTR_LO_MSK_A_MASK (0xFFFFFFFFU)
#define ZLL_PROG_PKT_FLTR_LO_MSK_A_PKT_FLTR_LO_MSK_A_SHIFT (0U)
/*! PKT_FLTR_LO_MSK_A - PPME filter A: To mask off the bits not required to be compared between
 *    PKT_FLTR_LO_PATT_A and Rx packet buffer mask bit = 1 means "no compare" mask-bit = 0 means "do
 *    compare"
 */
#define ZLL_PROG_PKT_FLTR_LO_MSK_A_PKT_FLTR_LO_MSK_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_LO_MSK_A_PKT_FLTR_LO_MSK_A_SHIFT)) & ZLL_PROG_PKT_FLTR_LO_MSK_A_PKT_FLTR_LO_MSK_A_MASK)
/*! @} */

/*! @name PROG_PKT_FLTR_UP_MSK_A -  */
/*! @{ */

#define ZLL_PROG_PKT_FLTR_UP_MSK_A_PKT_FLTR_UP_MSK_A_MASK (0xFFFFFFFFU)
#define ZLL_PROG_PKT_FLTR_UP_MSK_A_PKT_FLTR_UP_MSK_A_SHIFT (0U)
/*! PKT_FLTR_UP_MSK_A - PPME filter A: To mask off the bits not required to be compared between
 *    PKT_FLTR_UP_PATT_A and Rx packet buffer mask bit = 1 means "no compare" mask-bit = 0 means "do
 *    compare"
 */
#define ZLL_PROG_PKT_FLTR_UP_MSK_A_PKT_FLTR_UP_MSK_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_UP_MSK_A_PKT_FLTR_UP_MSK_A_SHIFT)) & ZLL_PROG_PKT_FLTR_UP_MSK_A_PKT_FLTR_UP_MSK_A_MASK)
/*! @} */

/*! @name PROG_PKT_FLTR_CTRL_A -  */
/*! @{ */

#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_OFST_A_MASK (0xFFU)
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_OFST_A_SHIFT (0U)
/*! PKT_FLTR_OFST_A - PPME_A: Offset to skip pattern match for any number of bytes between 0 to
 *    127th byte of the packet buffer for pkt_fltr_patt_a
 */
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_OFST_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_OFST_A_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_OFST_A_MASK)

