zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_EN_A_MASK (0x100U)
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_EN_A_SHIFT (8U)
/*! PKT_FLTR_EN_A - PPME_A: Set to enable packet filter for pkt_fltr_patt_a */
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_EN_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_EN_A_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_EN_A_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_REJECT_PKT_A_MASK (0x200U)
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_REJECT_PKT_A_SHIFT (9U)
/*! PKT_FLTR_REJECT_PKT_A - PPME_A: Enable to abort the current packet. Disable to generate
 *    FILTERFAIL_IRQ interrupt and continue reception of the current packet.
 */
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_REJECT_PKT_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_REJECT_PKT_A_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_REJECT_PKT_A_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_MAT_IRQ_MODE_A_MASK (0x400U)
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_MAT_IRQ_MODE_A_SHIFT (10U)
/*! PKT_FLTR_MAT_IRQ_MODE_A - PPME_A: Disabled (1'b0) - There will be no patt_mat_irq_a generated in
 *    real time if pkt_fltr_patt_a matches and if there is No CRC failure. At the end of the
 *    receive only RXIRQ will be generated to signify the end of the packet. Enabled (1'b1) - interrupt
 *    patt_mat_irq_a will be generated in the real time.
 */
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_MAT_IRQ_MODE_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_MAT_IRQ_MODE_A_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_MAT_IRQ_MODE_A_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_PAN_A_MASK (0x800U)
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_PAN_A_SHIFT (11U)
/*! PKT_FLTR_PAN_A - PPME_A: PAN selector 0x0 - filter set a assigned to PAN0 0x1 - filter set a assigned to PAN1 */
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_PAN_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_PAN_A_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_PAN_A_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_A_PPME_FILTERFAIL_ENABLE_MASK (0x1000U)
#define ZLL_PROG_PKT_FLTR_CTRL_A_PPME_FILTERFAIL_ENABLE_SHIFT (12U)
/*! PPME_FILTERFAIL_ENABLE - If set 1'b1, PPME Filterfail_code0/1 is disabled for
 *    RECD_ON_PAN_0/1_EARLY evaluation, regardless if PPME is setup for "phase2" frame header checking for PP
 *    -unsupported frame types if reset (1'b0), PPME Fitlerfail_codes are evaluated for
 *    RECD_ON_PAN_0/1_EARLY evaluation
 */
#define ZLL_PROG_PKT_FLTR_CTRL_A_PPME_FILTERFAIL_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_A_PPME_FILTERFAIL_ENABLE_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_A_PPME_FILTERFAIL_ENABLE_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_A_PPME_SECURITY_ENABLED_OVRD_MASK (0x2000U)
#define ZLL_PROG_PKT_FLTR_CTRL_A_PPME_SECURITY_ENABLED_OVRD_SHIFT (13U)
/*! PPME_SECURITY_ENABLED_OVRD - Override that the "security_enabled" packet header field when set
 *    is clearing PPME filterfail codes. If set 1'b1, ppme_fitlerfail_codes are not cleared
 *    regardless of security_enabled
 */
#define ZLL_PROG_PKT_FLTR_CTRL_A_PPME_SECURITY_ENABLED_OVRD(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_A_PPME_SECURITY_ENABLED_OVRD_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_A_PPME_SECURITY_ENABLED_OVRD_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_FRM_VER_A_MASK (0xF0000U)
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_FRM_VER_A_SHIFT (16U)
/*! PKT_FLTR_FRM_VER_A - PPME_A: Packet Filter Frame Version selector for filter set a. The incoming
 *    packet's Frame Control Field is parsed to obtain the FrameVersion subfield, and that value is
 *    compared against this register, in accordance with the following: xxx1: Accept received
 *    packets with FrameVersion=00 xx1x: Accept received packets with FrameVersion=01 x1xx: Accept
 *    received packets with FrameVersion=10 1xxx: Accept received packets with FrameVersion=11
 */
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_FRM_VER_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_FRM_VER_A_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_FRM_VER_A_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_FRM_TYPE_A_MASK (0xFF000000U)
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_FRM_TYPE_A_SHIFT (24U)
/*! PKT_FLTR_FRM_TYPE_A - PPME fiter A: Packet type selector for filter set a. Packet type can be
 *    parsed from Frame Control field and can be used to filter the packet types as per the settings
 *    in this register. xxxxxxx1 - Accept packets with Frame Type Beacon xxxxxx1x - Accept packets
 *    with Frame Type Data xxxxx1xx - Accept packets with Frame Type Acknowledgement xxxx1xxx - Accept
 *    packets with Frame Type MAC command. xxx1xxxx - Accept packets with Frame Type Reserved
 *    xx1xxxxx - Accept packets with Frame Type Multipurpose x1xxxxxx - Accept packets with Frame Type
 *    Fragment or Frak 1xxxxxxx - Accept packets with Frame Type Extended
 */
#define ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_FRM_TYPE_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_FRM_TYPE_A_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_A_PKT_FLTR_FRM_TYPE_A_MASK)
/*! @} */

/*! @name PROG_PKT_FLTR_LO_PATT_B -  */
/*! @{ */

#define ZLL_PROG_PKT_FLTR_LO_PATT_B_PKT_FLTR_LO_PATT_B_MASK (0xFFFFFFFFU)
#define ZLL_PROG_PKT_FLTR_LO_PATT_B_PKT_FLTR_LO_PATT_B_SHIFT (0U)
/*! PKT_FLTR_LO_PATT_B - PPME filter B: 32bit LSB Rx Pattern programmed by software to be matched with the subfield of the incoming Rx Packet. */
#define ZLL_PROG_PKT_FLTR_LO_PATT_B_PKT_FLTR_LO_PATT_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_LO_PATT_B_PKT_FLTR_LO_PATT_B_SHIFT)) & ZLL_PROG_PKT_FLTR_LO_PATT_B_PKT_FLTR_LO_PATT_B_MASK)
/*! @} */

/*! @name PROG_PKT_FLTR_UP_PATT_B -  */
/*! @{ */

#define ZLL_PROG_PKT_FLTR_UP_PATT_B_PKT_FLTR_UP_PATT_B_MASK (0xFFFFFFFFU)
#define ZLL_PROG_PKT_FLTR_UP_PATT_B_PKT_FLTR_UP_PATT_B_SHIFT (0U)
/*! PKT_FLTR_UP_PATT_B - PPME filter B: 32bit MSB Rx Pattern programmed by software to be matched with the subfield of the incoming Rx Packet. */
#define ZLL_PROG_PKT_FLTR_UP_PATT_B_PKT_FLTR_UP_PATT_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_UP_PATT_B_PKT_FLTR_UP_PATT_B_SHIFT)) & ZLL_PROG_PKT_FLTR_UP_PATT_B_PKT_FLTR_UP_PATT_B_MASK)
/*! @} */

