zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
/*! @name PROG_PKT_FLTR_LO_MSK_B -  */
/*! @{ */

#define ZLL_PROG_PKT_FLTR_LO_MSK_B_PKT_FLTR_LO_MSK_B_MASK (0xFFFFFFFFU)
#define ZLL_PROG_PKT_FLTR_LO_MSK_B_PKT_FLTR_LO_MSK_B_SHIFT (0U)
/*! PKT_FLTR_LO_MSK_B - PPME filter B: To mask off the bits not required to be compared between
 *    PKT_FLTR_LO_PATT_B and Rx packet buffer mask bit = 1 means "no compare" mask-bit = 0 means "do
 *    compare"
 */
#define ZLL_PROG_PKT_FLTR_LO_MSK_B_PKT_FLTR_LO_MSK_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_LO_MSK_B_PKT_FLTR_LO_MSK_B_SHIFT)) & ZLL_PROG_PKT_FLTR_LO_MSK_B_PKT_FLTR_LO_MSK_B_MASK)
/*! @} */

/*! @name PROG_PKT_FLTR_UP_MSK_B -  */
/*! @{ */

#define ZLL_PROG_PKT_FLTR_UP_MSK_B_PKT_FLTR_UP_MSK_B_MASK (0xFFFFFFFFU)
#define ZLL_PROG_PKT_FLTR_UP_MSK_B_PKT_FLTR_UP_MSK_B_SHIFT (0U)
/*! PKT_FLTR_UP_MSK_B - PPME filter B: To mask off the bits not required to be compared between
 *    PKT_FLTR_UP_PATT_B and Rx packet buffer mask bit = 1 means "no compare" mask-bit = 0 means "do
 *    compare"
 */
#define ZLL_PROG_PKT_FLTR_UP_MSK_B_PKT_FLTR_UP_MSK_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_UP_MSK_B_PKT_FLTR_UP_MSK_B_SHIFT)) & ZLL_PROG_PKT_FLTR_UP_MSK_B_PKT_FLTR_UP_MSK_B_MASK)
/*! @} */

/*! @name PROG_PKT_FLTR_CTRL_B -  */
/*! @{ */

#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_OFST_B_MASK (0xFFU)
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_OFST_B_SHIFT (0U)
/*! PKT_FLTR_OFST_B - PPME_B: Offset to skip pattern match for any number of bytes between 0 to
 *    127th byte of the packet buffer for pkt_fltr_patt_b
 */
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_OFST_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_OFST_B_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_OFST_B_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_EN_B_MASK (0x100U)
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_EN_B_SHIFT (8U)
/*! PKT_FLTR_EN_B - PPME_B: Set to enable packet filter for pkt_fltr_patt_b */
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_EN_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_EN_B_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_EN_B_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_REJECT_PKT_B_MASK (0x200U)
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_REJECT_PKT_B_SHIFT (9U)
/*! PKT_FLTR_REJECT_PKT_B - PPME_B: Enable to abort the current packet. Disable to generate
 *    FILTERFAIL_IRQ interrupt and continue reception of the current packet.
 */
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_REJECT_PKT_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_REJECT_PKT_B_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_REJECT_PKT_B_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_MAT_IRQ_MODE_B_MASK (0x400U)
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_MAT_IRQ_MODE_B_SHIFT (10U)
/*! PKT_FLTR_MAT_IRQ_MODE_B - PPME_B: Disabled (1'b0) - There will be no patt_mat_irq_a generated in
 *    real time if pkt_fltr_patt_b matches and if there is No CRC failure. At the end of the
 *    receive only RXIRQ will be generated to signify the end of the packet. Enabled (1'b1) - interrupt
 *    patt_mat_irq_b will be generated in the real time.
 */
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_MAT_IRQ_MODE_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_MAT_IRQ_MODE_B_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_MAT_IRQ_MODE_B_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_PAN_B_MASK (0x800U)
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_PAN_B_SHIFT (11U)
/*! PKT_FLTR_PAN_B - PPME_B: PAN selector 0x0 - filter set a assigned to PAN0 0x1 - filter set a assigned to PAN1 */
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_PAN_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_PAN_B_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_PAN_B_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_REJECT_AND_MASK (0x1000U)
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_REJECT_AND_SHIFT (12U)
/*! PKT_FLTR_REJECT_AND - When both filter sets A and B are enabled and packet rejection bits
 *    PKT_FLTR_REJECT_PKT_A, PKT_FLTR_REJECT_PKT_B is enabled software can select to reject the Rx packet
 *    if both patterns are not matched or either pattern is not matched. 0: Rx packet rejected if
 *    pkt_fltr_patt_a OR pkt_fltr_patt_b is not matched 1: Rx packet rejected if pkt_fltr_patt_a AND
 *    pkt_fltr_patt_b is not matched
 */
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_REJECT_AND(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_REJECT_AND_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_REJECT_AND_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_CONCAT_PFAB_MASK (0x2000U)
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_CONCAT_PFAB_SHIFT (13U)
/*! PKT_FLTR_CONCAT_PFAB - To concatenate the pkt_fltr_patt_a + pkt_fltr_patt_b and receive
 *    interrupt patt_mat_irq_b only when complete pattern has matched
 */
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_CONCAT_PFAB(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_CONCAT_PFAB_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_CONCAT_PFAB_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FLOAT_OFST_EN_MASK (0x4000U)
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FLOAT_OFST_EN_SHIFT (14U)
/*! PKT_FLTR_FLOAT_OFST_EN - This bit is used to decide if pattern b offset should be fixed
 *    (configurable by software) or should be kept floating (anytime the match occurs).
 */
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FLOAT_OFST_EN(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FLOAT_OFST_EN_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FLOAT_OFST_EN_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FRM_VER_B_MASK (0xF0000U)
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FRM_VER_B_SHIFT (16U)
/*! PKT_FLTR_FRM_VER_B - PPME_B: Packet Filter Frame Version selector for filter set B. The incoming
 *    packet's Frame Control Field is parsed to obtain the FrameVersion subfield, and that value is
 *    compared against this register, in accordance with the following: xxx1: Accept received
 *    packets with FrameVersion=00 xx1x: Accept received packets with FrameVersion=01 x1xx: Accept
 *    received packets with FrameVersion=10 1xxx: Accept received packets with FrameVersion=11
 */
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FRM_VER_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FRM_VER_B_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FRM_VER_B_MASK)

#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FRM_TYPE_B_MASK (0xFF000000U)
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FRM_TYPE_B_SHIFT (24U)
/*! PKT_FLTR_FRM_TYPE_B - PPME filter B: Packet type selector for filter set B. Packet type can be
 *    parsed from Frame Control field and can be used to filter the packet types as per the settings
 *    in this register. xxxxxxx1 - Accept packets with Frame Type Beacon xxxxxx1x - Accept packets
 *    with Frame Type Data xxxxx1xx - Accept packets with Frame Type Acknowledgement xxxx1xxx -
 *    Accept packets with Frame Type MAC command. xxx1xxxx - Accept packets with Frame Type Reserved
 *    xx1xxxxx - Accept packets with Frame Type Multipurpose x1xxxxxx - Accept packets with Frame Type
 *    Fragment or Frak 1xxxxxxx - Accept packets with Frame Type Extended
 */
#define ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FRM_TYPE_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FRM_TYPE_B_SHIFT)) & ZLL_PROG_PKT_FLTR_CTRL_B_PKT_FLTR_FRM_TYPE_B_MASK)
/*! @} */

/*! @name SAM_ADDR_PRESENT - SAM ADDRESS PRESENT (SAM_ADDR_PRESENT) */
/*! @{ */

