zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
#define ZLL_SAM_ADDR_PRESENT_SAP0_ADDR_PRESENT_MASK (0x1U)
#define ZLL_SAM_ADDR_PRESENT_SAP0_ADDR_PRESENT_SHIFT (0U)
/*! SAP0_ADDR_PRESENT - A Checksum Match is Present in the SAP0 Partition of the SAM Table */
#define ZLL_SAM_ADDR_PRESENT_SAP0_ADDR_PRESENT(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_ADDR_PRESENT_SAP0_ADDR_PRESENT_SHIFT)) & ZLL_SAM_ADDR_PRESENT_SAP0_ADDR_PRESENT_MASK)

#define ZLL_SAM_ADDR_PRESENT_SAA0_ADDR_ABSENT_MASK (0x2U)
#define ZLL_SAM_ADDR_PRESENT_SAA0_ADDR_ABSENT_SHIFT (1U)
/*! SAA0_ADDR_ABSENT - A Checksum Match is Absent in the SAA0 Partition of the SAM Table */
#define ZLL_SAM_ADDR_PRESENT_SAA0_ADDR_ABSENT(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_ADDR_PRESENT_SAA0_ADDR_ABSENT_SHIFT)) & ZLL_SAM_ADDR_PRESENT_SAA0_ADDR_ABSENT_MASK)

#define ZLL_SAM_ADDR_PRESENT_SAP1_ADDR_PRESENT_MASK (0x4U)
#define ZLL_SAM_ADDR_PRESENT_SAP1_ADDR_PRESENT_SHIFT (2U)
/*! SAP1_ADDR_PRESENT - A Checksum Match is Present in the SAP1 Partition of the SAM Table */
#define ZLL_SAM_ADDR_PRESENT_SAP1_ADDR_PRESENT(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_ADDR_PRESENT_SAP1_ADDR_PRESENT_SHIFT)) & ZLL_SAM_ADDR_PRESENT_SAP1_ADDR_PRESENT_MASK)

#define ZLL_SAM_ADDR_PRESENT_SAA1_ADDR_ABSENT_MASK (0x8U)
#define ZLL_SAM_ADDR_PRESENT_SAA1_ADDR_ABSENT_SHIFT (3U)
/*! SAA1_ADDR_ABSENT - A Checksum Match is Absent in the SAA1 Partition of the SAM Table */
#define ZLL_SAM_ADDR_PRESENT_SAA1_ADDR_ABSENT(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_ADDR_PRESENT_SAA1_ADDR_ABSENT_SHIFT)) & ZLL_SAM_ADDR_PRESENT_SAA1_ADDR_ABSENT_MASK)
/*! @} */

/*! @name TIMER_CTRL - TIMER CONTROL (TIMER_CTRL) */
/*! @{ */

#define ZLL_TIMER_CTRL_EVENT_TMR_LD_MASK         (0x1U)
#define ZLL_TIMER_CTRL_EVENT_TMR_LD_SHIFT        (0U)
/*! EVENT_TMR_LD - Event Timer Load Enable Loads the Event Timer with the values written to the
 *    EVENT_TMR[23:0] and EVENT_TMR_FRAC[3:0] fields of this register.
 */
#define ZLL_TIMER_CTRL_EVENT_TMR_LD(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_TIMER_CTRL_EVENT_TMR_LD_SHIFT)) & ZLL_TIMER_CTRL_EVENT_TMR_LD_MASK)

#define ZLL_TIMER_CTRL_EVENT_TMR_ADD_MASK        (0x2U)
#define ZLL_TIMER_CTRL_EVENT_TMR_ADD_SHIFT       (1U)
/*! EVENT_TMR_ADD - Event Timer Add Enable Increments the Event Timer by the values written to the
 *    EVENT_TMR[23:0] and EVENT_TMR_FRAC[3:0] fields of this register.
 */
#define ZLL_TIMER_CTRL_EVENT_TMR_ADD(x)          (((uint32_t)(((uint32_t)(x)) << ZLL_TIMER_CTRL_EVENT_TMR_ADD_SHIFT)) & ZLL_TIMER_CTRL_EVENT_TMR_ADD_MASK)

#define ZLL_TIMER_CTRL_EVNTMR_WKUP_TRIG_EN_MASK  (0x10U)
#define ZLL_TIMER_CTRL_EVNTMR_WKUP_TRIG_EN_SHIFT (4U)
/*! EVNTMR_WKUP_TRIG_EN - Configuration to trigger T[1-4]CMP comparison after a wakeup is detected.
 *    This bit is used only for the first TX or RX event after wakeup, and is self-cleared by HW.
 */
#define ZLL_TIMER_CTRL_EVNTMR_WKUP_TRIG_EN(x)    (((uint32_t)(((uint32_t)(x)) << ZLL_TIMER_CTRL_EVNTMR_WKUP_TRIG_EN_SHIFT)) & ZLL_TIMER_CTRL_EVNTMR_WKUP_TRIG_EN_MASK)

#define ZLL_TIMER_CTRL_CAPTURE_TIMESTAMP_MASK    (0x20U)
#define ZLL_TIMER_CTRL_CAPTURE_TIMESTAMP_SHIFT   (5U)
/*! CAPTURE_TIMESTAMP - SW can write this bit to capture a snapshot of FP4_UNIVERSAL_CLOCK and Event
 *    Timer in UC_TIMESTAMP and TIMESTAMP registers. This bit is self-cleared by HW
 */
#define ZLL_TIMER_CTRL_CAPTURE_TIMESTAMP(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_TIMER_CTRL_CAPTURE_TIMESTAMP_SHIFT)) & ZLL_TIMER_CTRL_CAPTURE_TIMESTAMP_MASK)

#define ZLL_TIMER_CTRL_TMSTMP_ANCHORED_MASK      (0x40U)
#define ZLL_TIMER_CTRL_TMSTMP_ANCHORED_SHIFT     (6U)
/*! TMSTMP_ANCHORED - When set, CAPTURE_TIMESTAMP will capture an anchored TIMESTAMP of universal
 *    clock counter and event timer. This bit does not affect the timestamping at RX SFD detection
 */
#define ZLL_TIMER_CTRL_TMSTMP_ANCHORED(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_TIMER_CTRL_TMSTMP_ANCHORED_SHIFT)) & ZLL_TIMER_CTRL_TMSTMP_ANCHORED_MASK)

#define ZLL_TIMER_CTRL_RST_EVNTMR_AT_WKUP_MASK   (0x80U)
#define ZLL_TIMER_CTRL_RST_EVNTMR_AT_WKUP_SHIFT  (7U)
/*! RST_EVNTMR_AT_WKUP - Bit to enable Event Timer reset at wakeup */
#define ZLL_TIMER_CTRL_RST_EVNTMR_AT_WKUP(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_TIMER_CTRL_RST_EVNTMR_AT_WKUP_SHIFT)) & ZLL_TIMER_CTRL_RST_EVNTMR_AT_WKUP_MASK)
/*! @} */

/*! @name UNIV_CNTR_TIMESTAMP - Universal Counter Timestamp (UNIV_CNTR_TIMESTAMP) */
/*! @{ */

#define ZLL_UNIV_CNTR_TIMESTAMP_UNIV_CNTR_TIMESTAMP_MASK (0xFFFFFFFFU)
#define ZLL_UNIV_CNTR_TIMESTAMP_UNIV_CNTR_TIMESTAMP_SHIFT (0U)
/*! UNIV_CNTR_TIMESTAMP - Timestamped value captured from FP4_UNIVERSAL_CLOCK counter at
 *    CAPTURE_TIMESTAMP assertion from SW. This TIMESTAMP is also updated at SFD detection when Event Timer
 *    TIMESTAMP is updated in ZLL TIMESTAMP register
 */
#define ZLL_UNIV_CNTR_TIMESTAMP_UNIV_CNTR_TIMESTAMP(x) (((uint32_t)(((uint32_t)(x)) << ZLL_UNIV_CNTR_TIMESTAMP_UNIV_CNTR_TIMESTAMP_SHIFT)) & ZLL_UNIV_CNTR_TIMESTAMP_UNIV_CNTR_TIMESTAMP_MASK)
/*! @} */

/*! @name UNIV_CLK_CNTR - Universal Clock Counter Freerunning value (UNIV_CLK_CNTR) */
/*! @{ */

#define ZLL_UNIV_CLK_CNTR_FP4_UNIVERSAL_CLOCK_MASK (0xFFFFFFFFU)
#define ZLL_UNIV_CLK_CNTR_FP4_UNIVERSAL_CLOCK_SHIFT (0U)
/*! FP4_UNIVERSAL_CLOCK - FP4_UNIVERSAL_CLOCK counter (live value) readback from d_ip_15p4_radio_syn block */
#define ZLL_UNIV_CLK_CNTR_FP4_UNIVERSAL_CLOCK(x) (((uint32_t)(((uint32_t)(x)) << ZLL_UNIV_CLK_CNTR_FP4_UNIVERSAL_CLOCK_SHIFT)) & ZLL_UNIV_CLK_CNTR_FP4_UNIVERSAL_CLOCK_MASK)
/*! @} */

/*! @name EVENT_TMR_PRESET - EVENT TIMER Preset value (EVENT_TMR_PRESET) */
/*! @{ */

#define ZLL_EVENT_TMR_PRESET_EVENT_TMR_PRESET_MASK (0xFFFFFFFFU)
#define ZLL_EVENT_TMR_PRESET_EVENT_TMR_PRESET_SHIFT (0U)
/*! EVENT_TMR_PRESET - for SW to provide the pre-set value to load into, or, add to, the Event Timer
 *    when EVENT_TMR_LD or EVENT_TMR_ADD bits in FFU_DSM_CTRL register are set
 */
#define ZLL_EVENT_TMR_PRESET_EVENT_TMR_PRESET(x) (((uint32_t)(((uint32_t)(x)) << ZLL_EVENT_TMR_PRESET_EVENT_TMR_PRESET_SHIFT)) & ZLL_EVENT_TMR_PRESET_EVENT_TMR_PRESET_MASK)
/*! @} */

