zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_ZLL.h
/*! @name PROG_PKT_FLTR_INTR_MSK_STS -  */
/*! @{ */

#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_MASK_A_MASK (0x1U)
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_MASK_A_SHIFT (0U)
/*! PKT_FLTR_IRQ_MASK_A - PPME_A: if 1'b1: disable PKT_FLTR_IRQ_A to trigger FW IRQ (irq_b, ipi_int_modem_rx) */
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_MASK_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_MASK_A_SHIFT)) & ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_MASK_A_MASK)

#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_A_MASK (0x2U)
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_A_SHIFT (1U)
/*! PKT_FLTR_IRQ_A - PPME_A: Pattern match interrupt on PPME_A, generated if a pattern match was found in PPME_A, write 1 to clear */
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_A_SHIFT)) & ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_A_MASK)

#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_MASK_B_MASK (0x4U)
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_MASK_B_SHIFT (2U)
/*! PKT_FLTR_IRQ_MASK_B - PPME_B: if 1'b1: disable PKT_FLTR_IRQ_B to trigger FW IRQ (irq_b, ipi_int_modem_rx) */
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_MASK_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_MASK_B_SHIFT)) & ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_MASK_B_MASK)

#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_B_MASK (0x8U)
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_B_SHIFT (3U)
/*! PKT_FLTR_IRQ_B - PPME_B: Pattern match interrupt on PPME_B, generated if a pattern match was found in PPME_B, write 1 to clear */
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_B_SHIFT)) & ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_IRQ_B_MASK)

#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_OFST_ERR_A_MASK (0x10U)
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_OFST_ERR_A_SHIFT (4U)
/*! PKT_FLTR_OFST_ERR_A - PPME_A: Pattern offset error status. Generated at packet start if
 *    PKT_FLTR_OFST_A (+ASH index) exceeds the packet length, write 1 to clear
 */
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_OFST_ERR_A(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_OFST_ERR_A_SHIFT)) & ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_OFST_ERR_A_MASK)

#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_OFST_ERR_B_MASK (0x20U)
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_OFST_ERR_B_SHIFT (5U)
/*! PKT_FLTR_OFST_ERR_B - PPME_B: Pattern offset error status. Generated at packet start if
 *    PKT_FLTR_OFST_B (+ASH index) exceeds the packet length, write 1 to clear
 */
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_OFST_ERR_B(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_OFST_ERR_B_SHIFT)) & ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_OFST_ERR_B_MASK)

#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_PAN_CFG_ERR_MASK (0x40U)
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_PAN_CFG_ERR_SHIFT (6U)
/*! PKT_FLTR_PAN_CFG_ERR - PPME PAN configuration error in concatenation mode Set when the assigned PAN of PPME-A is not equal to the PAN of PPME-B */
#define ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_PAN_CFG_ERR(x) (((uint32_t)(((uint32_t)(x)) << ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_PAN_CFG_ERR_SHIFT)) & ZLL_PROG_PKT_FLTR_INTR_MSK_STS_PKT_FLTR_PAN_CFG_ERR_MASK)
/*! @} */

/*! @name INTR_SUMMARY -  */
/*! @{ */

#define ZLL_INTR_SUMMARY_IRQSTS_IRQ_MASK         (0x1U)
#define ZLL_INTR_SUMMARY_IRQSTS_IRQ_SHIFT        (0U)
/*! IRQSTS_irq - IRQSTS_IRQ = (SEQIRQ | TXIRQ | RXIRQ | CCAIRQ | RXWTRMKIRQ | FILTERFAIL_IRQ |
 *    PLL_INLOCK_IRQ | WAKE_IRQ | ARB_GRANT_DEASSERTION_IRQ | TSM_IRQ | (| TMR_IRQ_STATUS_TMR_IRQ (4:1) )
 */
#define ZLL_INTR_SUMMARY_IRQSTS_IRQ(x)           (((uint32_t)(((uint32_t)(x)) << ZLL_INTR_SUMMARY_IRQSTS_IRQ_SHIFT)) & ZLL_INTR_SUMMARY_IRQSTS_IRQ_MASK)

#define ZLL_INTR_SUMMARY_ENHACK_CTRL0_IRQ_MASK   (0x2U)
#define ZLL_INTR_SUMMARY_ENHACK_CTRL0_IRQ_SHIFT  (1U)
/*! ENHACK_CTRL0_IRQ - ENHACK_CTRL_IRQ = ( RECY_IRQ OR EMPTY_ACK_IRQ | ACK_ABORT_IRQ) */
#define ZLL_INTR_SUMMARY_ENHACK_CTRL0_IRQ(x)     (((uint32_t)(((uint32_t)(x)) << ZLL_INTR_SUMMARY_ENHACK_CTRL0_IRQ_SHIFT)) & ZLL_INTR_SUMMARY_ENHACK_CTRL0_IRQ_MASK)

#define ZLL_INTR_SUMMARY_COEX_CTRL_IRQ_MASK      (0x4U)
#define ZLL_INTR_SUMMARY_COEX_CTRL_IRQ_SHIFT     (2U)
/*! COEX_CTRL_IRQ - COEX_TIMEOUT_IRQ */
#define ZLL_INTR_SUMMARY_COEX_CTRL_IRQ(x)        (((uint32_t)(((uint32_t)(x)) << ZLL_INTR_SUMMARY_COEX_CTRL_IRQ_SHIFT)) & ZLL_INTR_SUMMARY_COEX_CTRL_IRQ_MASK)

#define ZLL_INTR_SUMMARY_XCVR_STATUS_IRQ_MASK    (0x8U)
#define ZLL_INTR_SUMMARY_XCVR_STATUS_IRQ_SHIFT   (3U)
/*! XCVR_STATUS_IRQ - TSM_IRQ */
#define ZLL_INTR_SUMMARY_XCVR_STATUS_IRQ(x)      (((uint32_t)(((uint32_t)(x)) << ZLL_INTR_SUMMARY_XCVR_STATUS_IRQ_SHIFT)) & ZLL_INTR_SUMMARY_XCVR_STATUS_IRQ_MASK)

#define ZLL_INTR_SUMMARY_PROG_PKT_FLTR_INTR_MSK_STS_IRQ_MASK (0x10U)
#define ZLL_INTR_SUMMARY_PROG_PKT_FLTR_INTR_MSK_STS_IRQ_SHIFT (4U)
/*! PROG_PKT_FLTR_INTR_MSK_STS_IRQ - PPME IRQ status summary (PKT_FLTR_OFST_ERR_B | PKT_FLTR_OFST_ERR_A | PKT_FLTR_OFST_ERR_B | PKT_FLTR_OFST_ERR_A) */
#define ZLL_INTR_SUMMARY_PROG_PKT_FLTR_INTR_MSK_STS_IRQ(x) (((uint32_t)(((uint32_t)(x)) << ZLL_INTR_SUMMARY_PROG_PKT_FLTR_INTR_MSK_STS_IRQ_SHIFT)) & ZLL_INTR_SUMMARY_PROG_PKT_FLTR_INTR_MSK_STS_IRQ_MASK)
/*! @} */

/*! @name SAM_FREE_IDX_FND - SAM FREE INDEX FOUND (SAM_FREE_IDX_FND) */
/*! @{ */

#define ZLL_SAM_FREE_IDX_FND_SAP0_1ST_FREE_IDX_FOUND_MASK (0x1U)
#define ZLL_SAM_FREE_IDX_FND_SAP0_1ST_FREE_IDX_FOUND_SHIFT (0U)
/*! SAP0_1ST_FREE_IDX_FOUND - Source Address Present #0 First Free Index found */
#define ZLL_SAM_FREE_IDX_FND_SAP0_1ST_FREE_IDX_FOUND(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_FREE_IDX_FND_SAP0_1ST_FREE_IDX_FOUND_SHIFT)) & ZLL_SAM_FREE_IDX_FND_SAP0_1ST_FREE_IDX_FOUND_MASK)

#define ZLL_SAM_FREE_IDX_FND_SAA0_1ST_FREE_IDX_FOUND_MASK (0x2U)
#define ZLL_SAM_FREE_IDX_FND_SAA0_1ST_FREE_IDX_FOUND_SHIFT (1U)
/*! SAA0_1ST_FREE_IDX_FOUND - Source Address Absent #0 First Free Index found */
#define ZLL_SAM_FREE_IDX_FND_SAA0_1ST_FREE_IDX_FOUND(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_FREE_IDX_FND_SAA0_1ST_FREE_IDX_FOUND_SHIFT)) & ZLL_SAM_FREE_IDX_FND_SAA0_1ST_FREE_IDX_FOUND_MASK)

#define ZLL_SAM_FREE_IDX_FND_SAP1_1ST_FREE_IDX_FOUND_MASK (0x4U)
#define ZLL_SAM_FREE_IDX_FND_SAP1_1ST_FREE_IDX_FOUND_SHIFT (2U)
/*! sap1_1st_free_idx_found - Source Address Present #1 First Free Index found */
#define ZLL_SAM_FREE_IDX_FND_SAP1_1ST_FREE_IDX_FOUND(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_FREE_IDX_FND_SAP1_1ST_FREE_IDX_FOUND_SHIFT)) & ZLL_SAM_FREE_IDX_FND_SAP1_1ST_FREE_IDX_FOUND_MASK)

#define ZLL_SAM_FREE_IDX_FND_SAA1_1ST_FREE_IDX_FOUND_MASK (0x8U)
#define ZLL_SAM_FREE_IDX_FND_SAA1_1ST_FREE_IDX_FOUND_SHIFT (3U)
/*! SAA1_1ST_FREE_IDX_FOUND - Source Address Absent #1 First Free Index found */
#define ZLL_SAM_FREE_IDX_FND_SAA1_1ST_FREE_IDX_FOUND(x) (((uint32_t)(((uint32_t)(x)) << ZLL_SAM_FREE_IDX_FND_SAA1_1ST_FREE_IDX_FOUND_SHIFT)) & ZLL_SAM_FREE_IDX_FND_SAA1_1ST_FREE_IDX_FOUND_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ZLL_Register_Masks */


/*!
 * @}
 */ /* end of group ZLL_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_ZLL_H_ */

